{
  "book": 48,
  "bookName": "Mark",
  "bookAbbreviation": "Mark",
  "chapter": 9,
  "sections": [
    {
      "title": "The Coming of God's Kingdom with Power",
      "startVerse": 1,
      "endVerse": 13
    },
    {
      "title": "Jesus Heals a Boy with an Unclean Spirit",
      "startVerse": 14,
      "endVerse": 29
    },
    {
      "title": "Jesus Again Foretells His Death and Resurrection",
      "startVerse": 30,
      "endVerse": 32
    },
    {
      "title": "Who Is the Greatest?",
      "startVerse": 33,
      "endVerse": 50
    }
  ],
  "verses": [
    {
      "pk": 48009001,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 1,
      "text": "And He said to them, \"Truly I tell you, there are some standing here who will not taste death until they see the kingdom of God come with power.\"",
      "links": "<a href='/AIV/41/9/27'>Mark 9:27</a>; <a href='/AIV/40/16/28'>Matthew 16:28</a>",
      "comment": "Jesus prophesies that some present will witness the manifestation of God's kingdom, often interpreted as fulfilled at the Transfiguration or in the events of Pentecost. This hints at the incoming establishment of divine authority among the apostles.",
      "sectionHeader": "The Coming of God's Kingdom with Power"
    },
    {
      "pk": 48009002,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 2,
      "text": "After six days, Jesus took Peter, James, and John and led them up a high mountain by themselves. And He was transfigured before them.",
      "links": "<a href='/AIV/40/17/1'>Matthew 17:1</a>; <a href='/AIV/42/9/28'>Luke 9:28</a>",
      "comment": "The Transfiguration reveals Jesus' divine glory to His closest disciples. The choice of three specific apostles underscores apostolic witness."
    },
    {
      "pk": 48009003,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 3,
      "text": "His clothes became dazzling white—whiter than anyone on earth could bleach them.",
      "links": "<a href='/AIV/27/7/9'>Daniel 7:9</a>; <a href='/AIV/66/1/14'>Revelation 1:14</a>",
      "comment": "The supernatural whiteness reflects the heavenly glory of the Son and echoes Old Testament visions of divine presence (cf. Daniel 7:9)."
    },
    {
      "pk": 48009004,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 4,
      "text": "And Elijah appeared to them together with Moses, and they were talking with Jesus.",
      "links": "<a href='/AIV/11/2/11'>2 Kings 2:11</a>; <a href='/AIV/5/34/5'>Deuteronomy 34:5</a>",
      "comment": "Elijah and Moses represent the Prophets and the Law, testifying to Jesus as their fulfillment. Their presence confirms Christ's central place in salvation history."
    },
    {
      "pk": 48009005,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 5,
      "text": "Peter responded and said to Jesus, \"Rabbi, it is good for us to be here. Let us make three shelters—one for You, one for Moses, and one for Elijah.\"",
      "links": "<a href='/AIV/40/17/4'>Matthew 17:4</a>",
      "comment": "Peter's suggestion implies a desire to preserve the experience, but misunderstands the uniqueness of Jesus compared to the Law and the Prophets."
    },
    {
      "pk": 48009006,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 6,
      "text": "For he did not know what to say, because they were very afraid.",
      "links": "",
      "comment": "Peter’s reaction shows the apostles’ awe and confusion before a divine revelation."
    },
    {
      "pk": 48009007,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 7,
      "text": "Then a cloud came and overshadowed them, and a voice came from the cloud: \"This is My beloved Son; listen to Him.\"",
      "links": "<a href='/AIV/2/24/16'>Exodus 24:16</a>; <a href='/AIV/19/2/7'>Psalm 2:7</a>; <a href='/AIV/41/1/11'>Mark 1:11</a>",
      "comment": "The Father's voice from the cloud identifies Jesus as His Son, commanding obedience. This repeats themes from Christ’s baptism and reinforces divine sonship—a claim to divinity."
    },
    {
      "pk": 48009008,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 8,
      "text": "Suddenly, when they looked around, they no longer saw anyone except Jesus with them.",
      "links": "",
      "comment": "Moses and Elijah disappear, leaving Jesus alone—signifying Jesus’ preeminence over the Law and the Prophets."
    },
    {
      "pk": 48009009,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 9,
      "text": "As they were coming down the mountain, He commanded them not to tell anyone what they had seen until the Son of Man had risen from the dead.",
      "links": "<a href='/AIV/41/8/30-31'>Mark 8:30-31</a>",
      "comment": "Jesus refers to His resurrection, signifying a messianic secret meant to be revealed later. The command presupposes divine authority over life and death."
    },
    {
      "pk": 48009010,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 10,
      "text": "They kept the matter to themselves, questioning what 'rising from the dead' meant.",
      "links": "<a href='/AIV/41/9/31'>Mark 9:31</a>",
      "comment": "The disciples' lack of understanding shows that resurrection was still a mysterious concept, pointing toward the later fulfillment in Christ's victory over death."
    },
    {
      "pk": 48009011,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 11,
      "text": "And they asked Him, \"Why do the scribes say that Elijah must come first?\"",
      "links": "<a href='/AIV/39/4/5'>Malachi 4:5</a>",
      "comment": "Refers to the prophecy that Elijah would precede the Messiah's coming, showing expectation of eschatological fulfillment."
    },
    {
      "pk": 48009012,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 12,
      "text": "He answered them, \"Elijah does come first to restore all things. And how is it written about the Son of Man that He should suffer many things and be treated with contempt?\"",
      "links": "<a href='/AIV/23/53/3-5'>Isaiah 53:3-5</a>",
      "comment": "Jesus affirms Elijah's role, but also alludes to His own suffering as consistent with prophetic expectation (Isaiah 53)."
    },
    {
      "pk": 48009013,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 13,
      "text": "But I tell you that Elijah has indeed come, and they did to him whatever they wished, just as it is written about him.\"",
      "links": "<a href='/AIV/40/17/12-13'>Matthew 17:12-13</a>",
      "comment": "The reference is to John the Baptist, the 'Elijah' who comes in spirit and fulfillment, pointing to prophetic continuity."
    },
    {
      "pk": 48009014,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 14,
      "text": "When they came to the other disciples, they saw a great crowd around them, and scribes arguing with them.",
      "links": "",
      "comment": "This introduces the next miracle performed by Jesus, with His apostles facing challenge in His absence.",
      "sectionHeader": "Jesus Heals a Boy with an Unclean Spirit"
    },
    {
      "pk": 48009015,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 15,
      "text": "Immediately, when the whole crowd saw Jesus, they were greatly amazed and ran to greet Him.",
      "links": "",
      "comment": "The people’s reaction shows Jesus’ unique authority and presence among the people."
    },
    {
      "pk": 48009016,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 16,
      "text": "And He asked them, \"What are you arguing with them about?\"",
      "links": "",
      "comment": "Jesus directly addresses the situation, emphasizing the importance of dialogue in teaching."
    },
    {
      "pk": 48009017,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 17,
      "text": "Someone from the crowd answered Him, \"Teacher, I have brought my son to You, for he has a spirit that makes him mute.\"",
      "links": "",
      "comment": "The father’s approach reflects faith in Jesus’ power, highlighting the centrality of seeking Christ for healing."
    },
    {
      "pk": 48009018,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 18,
      "text": "Whenever it seizes him, it throws him down, and he foams at the mouth, grinds his teeth, and becomes rigid. I asked Your disciples to cast it out, but they were not able.\"",
      "links": "",
      "comment": "The inability of the disciples points to a dependence on Jesus for spiritual authority, stressing the need for grace beyond mere human effort."
    },
    {
      "pk": 48009019,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 19,
      "text": "He answered them and said, \"O faithless generation, how long must I be with you? How long must I bear with you? Bring him to Me.\"",
      "links": "<a href='/AIV/41/4/40'>Mark 4:40</a>",
      "comment": "Jesus laments their lack of faith, calling all present to trust more deeply. This appeals to the importance of persevering faith fostered within a believing community."
    },
    {
      "pk": 48009020,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 20,
      "text": "They brought the boy to Him. And when the spirit saw Jesus, immediately it threw the boy into convulsions. He fell on the ground and rolled about, foaming at the mouth.",
      "links": "",
      "comment": "The demon recognizes Jesus' true identity and reacts violently, attesting to Christ’s authority over evil."
    },
    {
      "pk": 48009021,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 21,
      "text": "Jesus asked his father, \"How long has this been happening to him?\" He said, \"From childhood.",
      "links": "",
      "comment": "Jesus draws out a personal testimony, emphasizing compassion and pastoral care for afflicted souls."
    },
    {
      "pk": 48009022,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 22,
      "text": "And often it has cast him into fire and into water to destroy him. But if You can do anything, have compassion on us and help us.\"",
      "links": "",
      "comment": "The father's plea underscores desperate hope and the human need for mercy."
    },
    {
      "pk": 48009023,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 23,
      "text": "Jesus said to him, \"If you can! All things are possible for one who believes.\"",
      "links": "<a href='/AIV/40/17/20'>Matthew 17:20</a>",
      "comment": "Jesus emphasizes that faith makes miracles possible. This verse is foundational for understanding prayer and intercession."
    },
    {
      "pk": 48009024,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 24,
      "text": "Immediately the father of the child cried out and said, \"I believe; help my unbelief!\"",
      "links": "",
      "comment": "The father's confession shows that faith, though imperfect, is welcomed and completed by God’s grace."
    },
    {
      "pk": 48009025,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 25,
      "text": "When Jesus saw that a crowd was running together, He rebuked the unclean spirit, saying to it, \"You mute and deaf spirit, I command you—come out of him and never enter him again!\"",
      "links": "",
      "comment": "Jesus’s authority is absolute. The command is final and shows the incarnation’s power over spiritual affliction."
    },
    {
      "pk": 48009026,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 26,
      "text": "And after crying out and convulsing him greatly, it came out. The boy was like a corpse, so that many said, \"He is dead.\"",
      "links": "",
      "comment": "The apparent death prefigures resurrection—new life follows Christ’s intervention."
    },
    {
      "pk": 48009027,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 27,
      "text": "But Jesus took him by the hand and lifted him up, and he arose.",
      "links": "<a href='/AIV/40/9/25'>Matthew 9:25</a>",
      "comment": "Jesus raising the boy highlights His role as the source of resurrection and new life."
    },
    {
      "pk": 48009028,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 28,
      "text": "After Jesus had gone indoors, His disciples asked Him privately, \"Why could we not cast it out?\"",
      "links": "",
      "comment": "Private instruction suggests an ongoing, deeper formation for those entrusted with Christ’s ministry."
    },
    {
      "pk": 48009029,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 29,
      "text": "He said to them, \"This kind cannot come out by anything except prayer.\"",
      "links": "<a href='/AIV/41/6/7-13'>Mark 6:7-13</a>",
      "comment": "The necessity of prayer underscores the need for a humble, sacramental dependence on God rather than self-reliance."
    },
    {
      "pk": 48009030,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 30,
      "text": "They went on from there and passed through Galilee. He did not want anyone to know it,",
      "links": "",
      "comment": "Jesus withdraws for private teaching, showing the importance of intentional formation of His disciples.",
      "sectionHeader": "Jesus Again Foretells His Death and Resurrection"
    },
    {
      "pk": 48009031,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 31,
      "text": "for He was teaching His disciples and saying to them, \"The Son of Man is going to be delivered into the hands of men. They will kill Him, and after He is killed, three days later He will rise.\"",
      "links": "<a href='/AIV/41/8/31'>Mark 8:31</a>; <a href='/AIV/28/6/2'>Hosea 6:2</a>",
      "comment": "Jesus predicts His Passion, alluding to Old Testament anticipation of suffering, death, and resurrection as the path to glory."
    },
    {
      "pk": 48009032,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 32,
      "text": "But they did not understand this statement and were afraid to ask Him.",
      "links": "",
      "comment": "The disciples' fear shows human limitation in grasping divine mysteries until the fullness of revelation unfolds."
    },
    {
      "pk": 48009033,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 33,
      "text": "And they came to Capernaum. When He was inside the house, He asked them, \"What were you discussing on the way?\"",
      "links": "",
      "comment": "Jesus, knowing their thoughts, guides His disciples toward humility—a foundation for Christian leadership.",
      "sectionHeader": "Who Is the Greatest?"
    },
    {
      "pk": 48009034,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 34,
      "text": "But they kept silent, for on the way they had argued with one another about who was the greatest.",
      "links": "<a href='/AIV/42/22/24-27'>Luke 22:24-27</a>",
      "comment": "Competitive ambition is corrected by Christ’s teachings on humble service as the path to greatness."
    },
    {
      "pk": 48009035,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 35,
      "text": "And He sat down, called the twelve, and said to them, \"If anyone wants to be first, he must be last of all and servant of all.\"",
      "links": "<a href='/AIV/41/10/44-45'>Mark 10:44-45</a>",
      "comment": "True leadership in the Church is modeled after Christ's humility and service, not worldly status."
    },
    {
      "pk": 48009036,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 36,
      "text": "And He took a child and placed him in the midst of them. Taking the child into His arms, He said to them,",
      "links": "",
      "comment": "The act of embracing a child is a lived parable of Christ’s love for the lowly, and the value of innocence and trust in discipleship."
    },
    {
      "pk": 48009037,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 37,
      "text": "\"Whoever receives one such child in My name receives Me, and whoever receives Me, receives not just Me but Him who sent Me.\"",
      "links": "<a href='/AIV/40/18/5'>Matthew 18:5</a>",
      "comment": "Receiving the weak and humble is akin to receiving Christ Himself, revealing the deep communion between Christ, His disciples, and the Father."
    },
    {
      "pk": 48009038,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 38,
      "text": "John said to Him, \"Teacher, we saw someone casting out demons in Your name, and we tried to stop him because he was not following us.\"",
      "links": "",
      "comment": "John's concern for proper authority highlights the role of legitimated ministry and unity."
    },
    {
      "pk": 48009039,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 39,
      "text": "But Jesus said, \"Do not stop him, for no one who does a mighty work in My name will be able soon afterward to speak evil of Me.",
      "links": "",
      "comment": "Jesus' answer shows that power in His name is not limited to the Twelve, but always remains under His divine sovereignty."
    },
    {
      "pk": 48009040,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 40,
      "text": "For whoever is not against us is for us.",
      "links": "<a href='/AIV/40/12/30'>Matthew 12:30</a>",
      "comment": "This statement emphasizes unity and charity among all who work for Christ—even outside visible structures, there remains a mysterious bond to Christ. This should encourage all believers to seek spiritual unity grounded in Christ's will."
    },
    {
      "pk": 48009041,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 41,
      "text": "Truly I tell you, whoever gives you a cup of water to drink because you belong to Christ will certainly not lose their reward.",
      "links": "<a href='/AIV/40/10/42'>Matthew 10:42</a>",
      "comment": "Jesus affirms the value of even small acts of kindness done for his followers, associating reward with acts of mercy. Notice the phrase 'because you belong to Christ,' which confirms belief in Christ as essential for divine recognition. The passage link to Matthew 10:42 shows the continuity of this teaching regarding care for disciples, underscoring the interconnectedness of believers in Christ’s community."
    },
    {
      "pk": 48009042,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 42,
      "text": "And if anyone causes one of these little ones who believe in me to stumble, it would be better for them if a great millstone were hung around their neck and they were thrown into the sea.",
      "links": "<a href='/AIV/40/18/6'>Matthew 18:6</a>",
      "comment": "Jesus uses stark imagery to emphasize the seriousness of leading believers astray, especially those who are spiritually young or vulnerable. The warning echoes the gravity of spiritual responsibility and the accountability for scandal or false teaching. 'Little ones' refers not just to children, but to all humble believers, supporting the high view of community and guardianship in Christian life."
    },
    {
      "pk": 48009043,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 43,
      "text": "If your hand causes you to sin, cut it off. It is better for you to enter life maimed than to have two hands and go into Gehenna, into the unquenchable fire.",
      "links": "<a href='/AIV/40/5/29-30'>Matthew 5:29-30</a>",
      "comment": "This passage presents strong language to illustrate the radical commitment necessary to avoid sin and its consequences, using the term 'Gehenna'—a symbol of final judgment and separation from God. The teaching aligns with the tradition of mortification and self-denial in spiritual practice. The literal act is hyperbolic but points to the seriousness of avoiding anything that leads one away from holiness."
    },
    {
      "pk": 48009044,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 45,
      "text": "And if your foot causes you to sin, cut it off. It is better for you to enter life crippled than to have two feet and be thrown into Gehenna.",
      "links": "<a href='/AIV/40/18/8'>Matthew 18:8</a>",
      "comment": "This verse continues the metaphor from verse 43, reinforcing the principle that nothing should be allowed to jeopardize one's eternal salvation, even if sacrifice is required. Notice how the terminology 'enter life' hints at eternal life, connecting physical actions and their effect on spiritual destiny—the bodily and spiritual interplay which has been emphasized throughout Christian tradition."
    },
    {
      "pk": 48009045,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 47,
      "text": "And if your eye causes you to sin, tear it out. It is better for you to enter the kingdom of God with one eye than to have two eyes and be thrown into Gehenna,",
      "links": "<a href='/AIV/40/5/29'>Matthew 5:29</a>",
      "comment": "This parallel to verses 43 and 45 further demonstrates the priority Jesus places on salvation over earthly comfort. 'Entering the kingdom of God' points to life in full union with God, and the language connects to broader biblical themes of sanctification. Interpreted spiritually, it calls for removal of anything that hinders holiness, as the Christian vocation is fully transformative."
    },
    {
      "pk": 48009046,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 48,
      "text": "where their worm does not die and the fire is not quenched.",
      "links": "<a href='/AIV/23/66/24'>Isaiah 66:24</a>",
      "comment": "For the third time, Mark repeats the solemn warning from Isaiah, affirming the reality of divine justice after death. The threefold repetition acts as a rhetorical device enforcing the gravity of our choices. This passage has shaped Christian understanding of judgment and motivates on-going conversion and penance—a spiritual exercise dating to the earliest Christian centuries."
    },
    {
      "pk": 48009047,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 49,
      "text": "For everyone will be salted with fire.",
      "links": "<a href='/AIV/3/2/13'>Leviticus 2:13</a>, <a href='/AIV/40/3/11'>Matthew 3:11</a>",
      "comment": "This cryptic statement draws from Old Testament sacrifice, where offerings were salted (Leviticus 2:13), and connects to spiritual purification through fire. Fire here symbolizes both trial and purification, as in Matthew 3:11, alluding to the transforming work of the Holy Spirit. This spiritualization invites deeper self-examination and personal sanctification—a key aspect of Christian growth."
    },
    {
      "pk": 48009048,
      "translation": "AIV",
      "book": 48,
      "bookName": "Mark",
      "bookAbbreviation": "Mark",
      "chapter": 9,
      "verse": 50,
      "text": "Salt is good, but if the salt loses its flavor, how will you restore it? Have salt in yourselves, and be at peace with one another.",
      "links": "<a href='/AIV/40/5/13'>Matthew 5:13</a>, <a href='/AIV/51/4/6'>Colossians 4:6</a>",
      "comment": "Jesus uses the image of salt to express the importance of remaining faithful and distinctive in conduct, echoing Matthew 5:13. 'Be at peace with one another' alludes to the call for Christian unity, an essential mark of the true Church established by Christ. This unity and internal transformation, described here, prepares believers for deeper participation in Christ's life—recalling the high calling to holiness and reconciliation within the Church."
    }
  ],
  "translatedAt": "2026-01-02T06:03:03.852Z"
}