{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 5,
  "verses": [
    {
      "pk": 21005001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 1,
      "text": "About this time, Antiochus set out on a second expedition into Egypt.",
      "links": "<a href='/AIV/27/11/29'>Dan. 11:29</a>",
      "comment": "Antiochus Epiphanes, the persecutor of the Jews, invades Egypt again as predicted in Daniel 11. The text highlights how the turmoil unfolds due to his ambition. This prepares for God's intervention, reminiscent of God's sovereignty over empires (see Daniel).",
      "sectionHeader": "Omens and Disturbances in Jerusalem"
    },
    {
      "pk": 21005002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 2,
      "text": "At the same time, there appeared throughout all Jerusalem visions of horses clad in gold charging through the air, with warriors riding on them in battle formation, launching attacks and brandishing swords—an army seen in fearsome array.",
      "links": "<a href='/AIV/12/6/17'>2 Kgs. 6:17</a>; <a href='/AIV/66/19/11-16'>Rev. 19:11-16</a>",
      "comment": "This is a supernatural vision indicating divine intervention, much like when Elisha's servant saw the armies of heaven. The spiritual reality behind physical events is emphasized. In Christian theology, such angelic hosts prefigure spiritual battles won through divine power, themes fulfilled in Revelation."
    },
    {
      "pk": 21005003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 3,
      "text": "There appeared troops of cavalry drawn up, attacks and counterattacks made on this side and on that, brandishing of shields, massing of spears, hurling of missiles, the flash of golden trappings, and armor of all kinds.",
      "links": "<a href='/AIV/44/12/5'>Acts 12:5</a>",
      "comment": "The faithful turn to prayer when confronted by supernatural signs, demonstrating a communal trust in God's providence. This echoes the importance of persistent prayer for deliverance, a theme found throughout both Old and New Testament."
    },
    {
      "pk": 21005004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 4,
      "text": "Therefore everyone prayed that the apparition might prove to have been a good omen.",
      "links": "<a href='/AIV/21/4/41-42'>1 Macc. 4:41-42</a>",
      "comment": "Jason, the former high priest, exploits civil turmoil for power. Internal strife weakens the people, mirroring conflicts over rightful leadership—a recurring theme in Israel's history and the early Church.",
      "sectionHeader": "Jason's Violent Coup and Downfall"
    },
    {
      "pk": 21005005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 5,
      "text": "When a false rumor arose that Antiochus was dead, Jason took no fewer than a thousand men and suddenly made an assault on the city. When the troops on the wall had been forced back and at last the city was being taken, Menelaus took refuge in the citadel.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15-16</a>; <a href='/AIV/40/26/52'>Matt. 26:52</a>",
      "comment": "Violence against one's own people is always condemned in Scripture. This verse foreshadows the principle that those who take up the sword will perish by it—a warning against divisions within the community of faith."
    },
    {
      "pk": 21005006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 6,
      "text": "But Jason kept relentlessly slaughtering his compatriots, not realizing that success at the cost of one’s kindred is the greatest misfortune, but imagining that he was setting up trophies of victory over enemies and not over compatriots.",
      "links": "<a href='/AIV/24/28/17'>Prov. 28:17</a>; <a href='/AIV/47/24/10'>Matt. 24:10</a>; <a href='/AIV/30/22/17'>Jer. 22:17</a>",
      "comment": "Jason's ruthless violence against his own people underscores the moral disaster of fraternal strife, echoing the biblical warning that internal discord is more tragic than defeat by foreign enemies (cf. Genesis 4:8; Judges 9:23-57)."
    },
    {
      "pk": 21005007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 7,
      "text": "He did not, however, gain control of the government; in the end he got only disgrace from his conspiracy, and fled again into the country of the Ammonites.",
      "links": "<a href='/AIV/24/26/27'>Prov. 26:27</a>; <a href='/AIV/19/7/10'>Esth. 7:10</a>; <a href='/AIV/23/7/15'>Ps. 7:15</a>",
      "comment": "Despite his ambition, Jason's conspiracy brings only shame and exile, illustrating the biblical theme that unjust means undermine any quest for power (cf. Psalm 37:35-36)."
    },
    {
      "pk": 21005008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 8,
      "text": "Finally he met a miserable end. Accused before Aretas the ruler of the Arabs, fleeing from city to city, pursued by everyone, hated as a rebel against the laws, and abhorred as the executioner of his country and his compatriots, he was cast ashore in Egypt.",
      "links": "<a href='/AIV/23/109/9'>Ps. 109:9-13</a>; <a href='/AIV/29/57/21'>Isa. 57:21</a>; <a href='/AIV/22/18/8'>Job. 18:8-19</a>",
      "comment": "Jason is relentlessly pursued and condemned by all, fulfilling the motif of the wicked becoming 'a fugitive and a wanderer' (cf. Genesis 4:12), and demonstrates the eventual collapse of those who betray their community."
    },
    {
      "pk": 21005009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 9,
      "text": "There he who had driven many from their own country into exile died in exile, having embarked to go to the Lacedaemonians in hope of finding protection because of their kinship.",
      "links": "<a href='/AIV/30/22/10'>Jer. 22:10</a>; <a href='/AIV/47/7/2'>Matt. 7:2</a>; <a href='/AIV/38/1/15'>Obad. 1:15</a>",
      "comment": "Ironically, Jason—who exiled many—dies in exile himself, his failed reliance on distant kin (the Lacedaemonians) highlighting the futility of seeking security apart from faithfulness to God and people (cf. Proverbs 14:32).",
      "sectionHeader": "Antiochus IV's Attack and Desecration of the Temple"
    },
    {
      "pk": 21005010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 10,
      "text": "He who had cast out many to lie unburied had no one to mourn for him; he had no funeral of any sort and no place in the tomb of his ancestors.",
      "links": "<a href='/AIV/14/21/19'>2Chr. 21:19-20</a>; <a href='/AIV/30/22/19'>Jer. 22:19</a>; <a href='/AIV/29/14/19'>Isa. 14:19-20</a>",
      "comment": "Denied burial and mourners, Jason's fate mirrors that of the wicked in wisdom literature (cf. Jeremiah 22:19), accentuating the ignominy awaiting those who destroy their own community."
    },
    {
      "pk": 21005011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 11,
      "text": "When news of what had happened reached the king, he took it to mean that Judea was in revolt. So, raging inwardly, he left Egypt and took the city by storm.",
      "links": "<a href='/AIV/21/5/15'>2Macc. 5:15-16</a>; <a href='/AIV/34/11/28'>Dan. 11:28-30</a>; <a href='/AIV/12/25/9'>2Kgs. 25:9-10</a>",
      "comment": "The chaos caused by Jason's actions leads to cruel consequences for all Judea, as Antiochus IV interprets internal strife as rebellion and unleashes severe reprisals, intensifying the cycle of suffering foretold in Deuteronomy 28:49-52."
    },
    {
      "pk": 21005012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 12,
      "text": "He commanded his soldiers to cut down relentlessly everyone they met and to kill those who went into their houses.",
      "links": "<a href='/AIV/21/1/21-22'>1 Macc. 1:21-22</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The desecration of the Temple is described as blasphemy of the highest order. Jesus later refers to this event as a prophecy of future abomination, highlighting the seriousness of profaning what is holy."
    },
    {
      "pk": 21005013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 13,
      "text": "Then there was massacre of young and old, destruction of boys, women, and children, and slaughter of young girls and infants.",
      "links": "<a href='/AIV/27/5/2-4'>Dan. 5:2-4</a>",
      "comment": "The theme of defiling sacred vessels recurs in Daniel. This is a grave sin, as true worship requires purity, foreshadowing the purity demanded of Christ's sacrifice in the New Covenant."
    },
    {
      "pk": 21005014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 14,
      "text": "Within the total of three days eighty thousand were destroyed, forty thousand in hand-to-hand fighting, and as many were sold into slavery as were killed.",
      "links": "<a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>",
      "comment": "God sometimes uses pagan rulers to discipline His people, as in Isaiah and Jeremiah, though He holds them accountable for their pride. The passage teaches humility and trust in God's providential sovereignty."
    },
    {
      "pk": 21005015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 15,
      "text": "Not content with this, Antiochus dared to enter the most holy temple in all the world, guided by Menelaus, who had become a traitor both to the laws and to his country.",
      "links": "<a href='/AIV/21/3/24-27'>2 Macc. 3:24-27</a>",
      "comment": "Past divine interventions protected the Temple. Persistent sin forfeits such protection. The importance of repentance and honoring what is holy stands out, a continual invitation for all believers."
    },
    {
      "pk": 21005016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 16,
      "text": "He took the holy vessels with his polluted hands, and swept away with profane hands the votive offerings that other kings had made to enhance the glory and honor of the place.",
      "links": "<a href='/AIV/05/12/11-14'>Deut. 12:11-14</a>; <a href='/AIV/44/7/48-50'>Acts 7:48-50</a>",
      "comment": "Sacred places are significant, but God's relationship with His people is primary. This is echoed in Stephen’s speech in Acts, showing God transcends any one location. The true temple is ultimately the community gathered in His name."
    },
    {
      "pk": 21005017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 17,
      "text": "Antiochus was elated in spirit, and did not perceive that the Lord was angered for a little while because of the sins of those who lived in the city, and that this was the reason he was disregarding the holy place.",
      "links": "<a href='/AIV/16/12/43'>Neh. 12:43</a>; <a href='/AIV/19/102/13-16'>Ps. 102:13-16</a>",
      "comment": "The fate of the Temple is linked to the spiritual health of God’s people. Restoration and mercy are prominent, themes fulfilled in the coming of Christ, who rebuilds and glorifies the true spiritual Temple."
    },
    {
      "pk": 21005018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 18,
      "text": "But if it had not happened that they were involved in many sins, this man would have been flogged and turned back from his rash act as soon as he came forward, just as Heliodorus had been, whom King Seleucus sent to inspect the treasury.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/45/11/29'>Rom. 11:29</a>",
      "comment": "God’s faithfulness endures despite temporary discipline. His mercy ultimately prevails, a mystery deepened in Christ’s fulfillment of God’s promises to His beloved people."
    },
    {
      "pk": 21005019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 19,
      "text": "But the Lord did not choose the nation for the sake of the holy place, but the place for the sake of the nation.",
      "links": "<a href='/AIV/19/137/8-9'>Ps. 137:8-9</a>",
      "comment": "The passage reveals God’s justice: those used as instruments of discipline are not exempt from His judgment if they act out of malice. This theme recurs in biblical history, teaching respect for God’s holy things."
    },
    {
      "pk": 21005020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 20,
      "text": "Therefore the place itself shared in the misfortunes that befell the nation and afterward participated in its benefits; and what was forsaken in the wrath of the Almighty was restored again in all its glory when the great Lord became reconciled.",
      "links": "<a href='/AIV/11/8/41-43'>1 Kgs. 8:41-43</a>",
      "comment": "The reverence of outsiders for Jerusalem’s Temple reflects universal awareness of God’s presence. Christ later identifies His own person as the true Temple, uniting both Jew and Gentile in worship."
    },
    {
      "pk": 21005021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 21,
      "text": "So Antiochus carried off eighteen hundred talents from the temple, and hurried away to Antioch, thinking in his arrogance that he could sail on the land and walk on the sea, because his mind was elated.",
      "links": "<a href='/AIV/19/73/18-20'>Ps. 73:18-20</a>",
      "comment": "Human power is fleeting. The rich imagery here points to the ultimate accountability of all before God. Pride goes before destruction, a wisdom echoed by Jesus and the apostles."
    },
    {
      "pk": 21005022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 22,
      "text": "He left governors to oppress the people: in Jerusalem, Philip, a Phrygian by birth, more brutal than the one who appointed him;",
      "links": "<a href='/AIV/21/1/34'>1 Macc. 1:34</a>",
      "comment": "The appointment of oppressive officials further highlights the sufferings endured. Leadership either builds up or destroys God's people—a motif that sets the stage for Christ’s promise of shepherds after His own heart.",
      "sectionHeader": "Oppression Under Foreign Governors"
    },
    {
      "pk": 21005023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 23,
      "text": "And in Gerizim, Andronicus; and besides these, Menelaus, who lorded it over his fellow citizens worse than the foreigners did.",
      "links": "<a href='/AIV/21/4/25'>1 Macc. 4:25</a>",
      "comment": "Internal betrayal can be more destructive than external oppression. Leadership’s moral quality remains a central concern, anticipating the New Testament emphasis on faithful stewardship in the household of God."
    },
    {
      "pk": 21005024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 24,
      "text": "Antiochus sent Apollonius with an army of twenty-two thousand, commanding him to slaughter the adult men and sell women and boys as slaves.",
      "links": "<a href='/AIV/02/1/22'>Ex. 1:22</a>",
      "comment": "The systematic campaign against Israel’s men, women, and children recalls Pharaoh’s attempts to destroy Israel in Egypt. Yet God’s providence repeatedly preserves His faithful remnant."
    },
    {
      "pk": 21005025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 25,
      "text": "Arriving in Jerusalem, he pretended to come in peace. But on the Sabbath, when the Jews refrained from work, he ordered his men to launch a sudden attack, killing all who had come out to see him, then rushed through the city with his armed men, slaughtering a great number.",
      "links": "<a href='/AIV/02/20/8-11'>Ex. 20:8-11</a>",
      "comment": "The Sabbath is purposefully targeted, highlighting the invader's contempt for God’s commands. Keeping the Sabbath is integral to Israel’s identity—a foreshadowing of the Lord’s Day, rooted in sacred tradition."
    },
    {
      "pk": 21005026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 26,
      "text": "He put to the sword all those who came out to see them, then rushed into the city with his armed warriors and killed great numbers of people.",
      "links": "<a href='/AIV/19/11/1'>Ps. 11:1</a>; <a href='/AIV/42/4/1-2'>Luke 4:1-2</a>",
      "comment": "Judas’s withdrawal is an act of faithfulness, reminiscent of prophets and the Messiah spending time in the wilderness. The idea of avoiding 'unclean food' connects to the importance of holiness and the discipline of fasting.",
      "sectionHeader": "Judas Maccabeus Flees to the Wilderness"
    },
    {
      "pk": 21005027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 27,
      "text": "But Judas Maccabeus, with about nine others, got away to the wilderness, and kept himself and his companions alive in the mountains as wild animals do; they continued to live on what grew wild, so that they might not share in the defilement.",
      "links": "<a href='/AIV/03/11/44-45'>Lev. 11:44-45</a>; <a href='/AIV/60/1/15-16'>1 Pet. 1:15-16</a>",
      "comment": "Faithfulness to the law, especially under trial, is seen as evidence of true devotion. The call to be 'holy as God is holy' remains central. This pursuit of holiness is fulfilled in the body of Christ, who forms a pure and holy assembly set apart for God."
    }
  ],
  "translatedAt": "2025-12-29T00:32:08.255Z",
  "sections": [
    {
      "title": "Omens and Disturbances in Jerusalem",
      "startVerse": 1,
      "endVerse": 3
    },
    {
      "title": "Jason's Violent Coup and Downfall",
      "startVerse": 4,
      "endVerse": 8
    },
    {
      "title": "Antiochus IV's Attack and Desecration of the Temple",
      "startVerse": 9,
      "endVerse": 21
    },
    {
      "title": "Oppression Under Foreign Governors",
      "startVerse": 22,
      "endVerse": 25
    },
    {
      "title": "Judas Maccabeus Flees to the Wilderness",
      "startVerse": 26,
      "endVerse": 27
    }
  ]
}