{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 13,
  "verses": [
    {
      "pk": 21013001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 1,
      "text": "In the year one hundred forty-nine, news reached Judas and his companions that Antiochus was marching against Judea with a huge army.",
      "links": "<a href='/AIV/17/1/1'>Esth. 1:1</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "This sets the historical context during the reign of Antiochus Eupator, reinforcing the persistent threats against the faithful remnant of Israel. The precision of the date grounds the narrative in real events.",
      "sectionHeader": "The Campaign of Antiochus and the Death of Menelaus"
    },
    {
      "pk": 21013002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 2,
      "text": "He brought with him Lysias, his guardian, who was also the commander-in-chief, and a large force of Greeks and mercenaries—one hundred and ten thousand infantry, five thousand three hundred cavalry, twenty-two elephants, and three hundred chariots armed with scythes.",
      "links": "<a href='/AIV/1/4/28'>1 Macc. 4:28</a>",
      "comment": "The impressive military force emphasizes the odds faced by the Jewish people. The mention of war elephants and chariots highlights the advanced technology of the period."
    },
    {
      "pk": 21013003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 3,
      "text": "Menelaus also joined them, pretending to help but only seeking to secure his position as high priest.",
      "links": "<a href='/AIV/2/4/23-25'>2 Macc. 4:23-25</a>",
      "comment": "Menelaus is portrayed as self-serving, highlighting the dangers of corrupt leadership within God's people (cf. John 10:12, 'the hired hand cares nothing for the sheep')."
    },
    {
      "pk": 21013004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 4,
      "text": "But the King of kings stirred the anger of Antiochus against this wicked man, and when Lysias filed charges against Menelaus, Antiochus ordered him to be taken to Berea and executed according to local custom.",
      "links": "<a href='/AIV/27/2/21'>Dan. 2:21</a>; <a href='/AIV/19/75/7'>Ps. 75:7</a>",
      "comment": "This shows divine justice at work within the governance of nations (see Daniel 2:21, God 'changes times and seasons; he removes kings and sets up kings')."
    },
    {
      "pk": 21013005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 5,
      "text": "For in that city the custom is that criminals are thrown from a tower full of ashes, and suffocated in the thick dust.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "The execution method underlines the severe judgment reserved for betraying God's people and office."
    },
    {
      "pk": 21013006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 6,
      "text": "In such a tower, the rim on all sides slopes sharply down into the ashes; so men guilty of sacrilege are pushed to destruction from every side and suffocate there.",
      "links": [
        "Lev 10:1-2",
        "Num 16:35",
        "Heb 10:29"
      ],
      "comment": "This refers to the Hellenistic punishment of 'ashpits,' where sacrilegious offenders were executed by being thrown into a tower-shaped pit filled with ashes, symbolizing the gravity of violating holy things (cf. Lev 10:1-2)."
    },
    {
      "pk": 21013007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 7,
      "text": "Menelaus died without even a burial in the earth, most justly; for because he had been guilty of many sins against the altar, whose fire and ashes were holy, he met his death in ashes. He was notorious as a lawbreaker.",
      "links": [
        "1 Kgs 13:34",
        "Ps 79:3",
        "Wis 3:16"
      ],
      "comment": "Menelaus's ignoble death and lack of burial reflect both his unfaithfulness as high priest and retributive justice for his defilement of the altar, reminding readers of the sanctity of God’s house (cf. Deut 21:23)."
    },
    {
      "pk": 21013008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 8,
      "text": "It was a fitting end for such a man, for he had committed many sins against the altar and its fire. His punishment in ashes suited his acts against the holy things.",
      "links": [
        "Lev 6:9-13",
        "1 Sam 2:30",
        "Heb 12:29"
      ],
      "comment": "The punishment fittingly suits the crime against sacred objects, emphasizing the principle of divine justice—those who profane holy things meet an end that mirrors their transgressions (cf. Ps 9:16)."
    },
    {
      "pk": 21013009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 9,
      "text": "With barbarous arrogance, the king was coming to show the Jews things far worse than those that had been done in his father’s time.",
      "links": [
        "Esth 3:8-9",
        "Ps 74:4",
        "Dan 11:31-35"
      ],
      "comment": "The king’s excessive pride and intent to surpass his father’s atrocities foreshadow further conflict, highlighting the arrogance of Israel’s oppressors throughout the Maccabean period."
    },
    {
      "pk": 21013010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 10,
      "text": "But when the people heard the news, they prayed to the One who made all things, not to surrender them to such a ruthless nation, but to rescue them by his mighty power.",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>; <a href='/AIV/2/1/11-12'>2 Macc. 1:11-12</a>",
      "comment": "The faithful cry to God as Creator; prayer and reliance on divine help stand at the center of God's redemptive acts (Psalm 121:2; Jonah 2:2).",
      "sectionHeader": "The Prayer of the People and Jewish Resistance"
    },
    {
      "pk": 21013011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 11,
      "text": "They also called to mind the help that God had given their ancestors, especially how he had overwhelmed Sennacherib, the king of Assyria, when he boasted in his pride and was destroyed with his mighty army.",
      "links": [
        "2 Kgs 19:35-37",
        "Isa 37:36-38",
        "Ps 124:2-3"
      ],
      "comment": "Israel’s remembrance of God’s past deliverance, specifically the defeat of Sennacherib (cf. 2 Kings 19:35-37), reflects the pattern of invoking God’s faithfulness in the face of overwhelming odds."
    },
    {
      "pk": 21013012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 12,
      "text": "After gathering for three days with fasting, prostration, and weeping, Judas urged them to stand ready. Then, stretching out their hands toward heaven, they prayed: 'O Lord, you need nothing, but it has pleased you to give us our inheritance; protect your chosen people and deliver Israel!'",
      "links": [
        "Joel 2:12-13",
        "Esth 4:16",
        "Ps 44:4"
      ],
      "comment": "Communal fasting, weeping, and prayer signify deep dependence on God, with their petition affirming both God’s sovereignty and the covenant promise of the land (cf. Exod 33:13; Neh 9:32-36)."
    },
    {
      "pk": 21013013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 13,
      "text": "Protect this city, now dedicated to your name; do not let our enemies destroy your sanctuary.'",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>; <a href='/AIV/11/8/29'>1 Kgs. 8:29</a>",
      "comment": "This prayer recalls Solomon’s prayer at the temple dedication and anticipates the New Testament understanding of the Church as God’s dwelling place on earth (1 Corinthians 3:16)."
    },
    {
      "pk": 21013014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 14,
      "text": "Judas gathered his men together, urging them to remain faithful, prepared either to die bravely or to secure victory for their nation and the holy city.",
      "links": "<a href='/AIV/2/15/17'>2 Macc. 15:17</a>; <a href='/AIV/58/11/35-39'>Heb. 11:35-39</a>",
      "comment": "Judas Maccabeus exemplifies the leader who encourages perseverance, later echoed in the faith of the martyrs (Hebrews 11)."
    },
    {
      "pk": 21013015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 15,
      "text": "Judas and his men, after praying to the Lord for help, attacked the king’s camp at night, killing about two thousand men, and they also struck down the leading elephant and its rider.",
      "links": [
        "Judg 7:19-22",
        "2 Macc 8:23",
        "Ps 18:39"
      ],
      "comment": "Judas’s night attack, preceded by prayer, illustrates the fusion of strategic action with spiritual reliance, as God grants victory against seemingly insurmountable enemies (cf. Judg 7:19-22)."
    },
    {
      "pk": 21013016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 16,
      "text": "Having caused great terror and confusion in the camp, they departed in triumph, being protected by the Lord as dawn was breaking.",
      "links": [
        "Ex 14:24-25",
        "Ps 44:6-7",
        "Wis 10:20"
      ],
      "comment": "This verse highlights the divine protection experienced by Judas Maccabeus and his men after their surprise night attack, emphasizing God's sovereignty in granting victory against the odds (cf. Psalm 44:3); the dawn motif symbolizes both literal deliverance and spiritual renewal."
    },
    {
      "pk": 21013017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 17,
      "text": "This was accomplished by the Lord’s protection, for their victory was not due to weapons, but to the power of the Almighty.",
      "links": [
        "Zech 4:6",
        "Ps 33:16-18",
        "2 Macc 8:18"
      ],
      "comment": "Emphasizing divine agency, the victory is credited not to military strength but to the sovereign power of God—a recurring theme in the Deuteronomic history (cf. 1 Sam 17:47; Zech 4:6).",
      "sectionHeader": "The Siege of Beth-zur and Peace Negotiations"
    },
    {
      "pk": 21013018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 18,
      "text": "When the king saw the boldness of the Jews and the defeat of his plans, he tried to take Beth-zur by strategy, attacked, was repulsed, tried again, and was beaten back.",
      "links": [
        "Josh 8:14-22",
        "2 Macc 11:5-7",
        "Ps 118:10-12"
      ],
      "comment": "The repeated failure of the king’s strategies at Beth-zur underscores the resolve of the Jewish defenders and the futility of opposing God’s chosen (cf. Ps 127:1)."
    },
    {
      "pk": 21013019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 19,
      "text": "But when Judas heard that Lysias was besieging Beth-zur, he and all the people prayed before the Lord, that he would not allow the city to be handed over to the enemy.",
      "links": "<a href='/AIV/19/122/6-7'>Ps. 122:6-7</a>",
      "comment": "Continual prayer for the preservation of sacred places shows the importance of set-apart spaces for worship—a principle that persists in Christian liturgy."
    },
    {
      "pk": 21013020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 20,
      "text": "But Judas sent in provisions to aid those at Beth-zur.",
      "links": [
        "Neh 4:16-23",
        "Prov 25:21",
        "Matt 25:35"
      ],
      "comment": "Judas's resupply of Beth-zur shows pragmatic leadership and concern for the community, reinforcing the Maccabean ethos of solidarity and support under siege."
    },
    {
      "pk": 21013021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 21,
      "text": "There was a certain Rhodocus, a Jew, who betrayed secrets to the enemy; he was found out, arrested, and imprisoned.",
      "links": [
        "Josh 7:1",
        "Jdt 10:10",
        "Ps 41:9"
      ],
      "comment": "The betrayal of Rhodocus and his subsequent imprisonment reflect the internal dangers faced by the community and underscore the necessity of vigilance against internal subversion (cf. Josh 7:16-26)."
    },
    {
      "pk": 21013022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 22,
      "text": "The king then negotiated with the people of Beth-zur, gave and received pledges, withdrew, and attacked Judas. He was defeated.",
      "links": [
        "1 Macc 6:61",
        "Prov 29:8",
        "Wis 1:12"
      ],
      "comment": "Repeated negotiation and conflict illustrate the ebb and flow of the struggle, with the king’s concessions and ultimate military defeat further attesting to God’s favor for Judas and his followers."
    },
    {
      "pk": 21013023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 23,
      "text": "When the king learned that Philip, who had been left in charge at Antioch, had rebelled, he was alarmed. He called for the Jews, yielded to them, swore to observe all their rights, settled with them, offered sacrifice, honored the sanctuary, and treated the place generously.",
      "links": [
        "Esth 8:11",
        "Dan 6:26",
        "Ps 51:17"
      ],
      "comment": "Political instability forced the king to accommodate the Jews, leading to public acts of goodwill such as sacrifices and honoring the sanctuary, demonstrating how God can turn political situations for his people’s benefit (cf. Ezra 6:10)."
    },
    {
      "pk": 21013024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 24,
      "text": "The king received Maccabeus, left Hegemonides as governor from Ptolemais to Gerar, and then departed to Ptolemais.",
      "links": [
        "1 Macc 5:23",
        "2 Macc 4:29",
        "1 Kgs 3:7"
      ],
      "comment": "Maccabeus’s reception by the king and the appointment of governors indicate a brief period of peace and administrative transition, reflecting ongoing Hellenistic influence in the region."
    },
    {
      "pk": 21013025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 25,
      "text": "He returned to Ptolemais, but the people there were angry and demanded that the treaty be abolished.",
      "links": "<a href='/AIV/2/4/21'>2 Macc. 4:21</a>",
      "comment": "Human opposition and instability are incapable of overturning God’s decrees and favor toward his people."
    },
    {
      "pk": 21013026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 13,
      "verse": 26,
      "text": "Lysias succeeded in calming the populace, gained their goodwill, and returned with the king to Antioch. Such was the outcome of the king’s campaign and his withdrawal.",
      "links": [
        "Prov 16:7",
        "Esth 9:27-28",
        "Sir 1:18"
      ],
      "comment": "Lysias’s efforts to calm and gain the goodwill of the populace before returning to Antioch suggest a pragmatic end to the conflict, securing temporary stability and highlighting the complex political dynamics of the Seleucid empire."
    }
  ],
  "translatedAt": "2025-12-25T13:52:52.558Z",
  "sections": [
    {
      "title": "The Campaign of Antiochus and the Death of Menelaus",
      "startVerse": 1,
      "endVerse": 9
    },
    {
      "title": "The Prayer of the People and Jewish Resistance",
      "startVerse": 10,
      "endVerse": 16
    },
    {
      "title": "The Siege of Beth-zur and Peace Negotiations",
      "startVerse": 17,
      "endVerse": 26
    }
  ]
}