{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 4,
  "verses": [
    {
      "pk": 21004001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 1,
      "text": "The previously mentioned Simon, who had informed about the money against his own country, slandered Onias, saying that it was he who had incited Heliodorus and had been the real cause of the misfortune.",
      "links": "<a href='/AIV/21/3/37'>2Macc 3:37</a>; <a href='/AIV/16/6/6'>Neh. 6:6</a>",
      "comment": "This restoration clarifies the specific slander: Simon falsely blamed Onias for Heliodorus’s intrusion and the consequent troubles, highlighting personal ambition behind the accusation.",
      "sectionHeader": "Intrigue Against Onias the High Priest"
    },
    {
      "pk": 21004002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 2,
      "text": "He accused Onias of plotting against the state, saying he was responsible for the unrest among the people and that he prevented peace through his influence.",
      "links": "<a href='/AIV/21/4/1'>2Macc 4:1</a>",
      "comment": "False accusations against godly leadership echo incidents such as those against Daniel and Jeremiah (<a href='/AIV/27/6/4'>Dan 6:4</a>; <a href='/AIV/24/38/4'>Jer. 38:4</a>). The theme of suffering for righteousness is present."
    },
    {
      "pk": 21004003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 3,
      "text": "But when Simon’s hostility persisted, murders were committed by one of Simon’s approved agents.",
      "links": "<a href='/AIV/28/27/22'>Sir. 27:22-24</a>; <a href='/AIV/23/10/8'>Ps. 10:8</a>; <a href='/AIV/20/1/24'>1Macc. 1:24</a>",
      "comment": "Simon's continuing hostility highlights the deep internal Jewish strife over control of the high priesthood, leading to violence and undermining the community's integrity (cf. Sirach 27:21 on divisiveness)."
    },
    {
      "pk": 21004004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 4,
      "text": "Onias became aware of the seriousness of the rivalry and observed that Apollonius, governor of Coele-Syria and Phoenicia, was intensifying Simon's malice.",
      "links": "<a href='/AIV/20/1/10'>1Macc. 1:10-12</a>; <a href='/AIV/34/8/25'>Dan. 8:25</a>; <a href='/AIV/28/14/25'>Sir. 14:25-27</a>",
      "comment": "Onias perceives both political and personal animosities escalating, especially with the involvement of Apollonius, a high-ranking Seleucid official, illustrating how internal disputes were manipulated by foreign governors."
    },
    {
      "pk": 21004005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 5,
      "text": "So Onias appealed to the king, not accusing his fellow citizens, but with concern for the welfare of all the people, both public and private.",
      "links": "<a href='/AIV/11/8/34'>1Kgs. 8:34-36</a>; <a href='/AIV/15/7/15'>Ezra. 7:15</a>; <a href='/AIV/20/7/6'>1Macc. 7:6</a>",
      "comment": "Onias appeals to the king not out of self-interest but for the general welfare, modeling intercessory leadership akin to Nehemiah (Neh 2:4-5), striving to safeguard public and private peace."
    },
    {
      "pk": 21004006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 6,
      "text": "For Onias saw that, without the king's intervention, public affairs could not be restored to peace, and that Simon would not stop his reckless behavior.",
      "links": "<a href='/AIV/19/3/8'>Esth. 3:8-11</a>; <a href='/AIV/24/16/18'>Prov. 16:18</a>; <a href='/AIV/20/11/23'>1Macc. 11:23</a>",
      "comment": "Understanding that only the king could restore order, Onias seeks royal intervention against Simon’s unchecked wrongdoing, emphasizing the limits of internal resolution amid Hellenistic political realities."
    },
    {
      "pk": 21004007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 7,
      "text": "After Seleucus died and Antiochus, who was called Epiphanes, took the throne, Jason, Onias’s brother, tried to seize the high priesthood through corruption.",
      "links": "<a href='/AIV/21/1/16'>2Macc 1:16</a>; <a href='/AIV/27/11/21'>Dan 11:21</a>",
      "comment": "The struggle over legitimate priestly succession points to the necessity of divinely established authority. Epiphanes (“manifest god”) foreshadows later conflicts over true worship.",
      "sectionHeader": "Jason Corruptly Attains the High Priesthood"
    },
    {
      "pk": 21004008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 8,
      "text": "Jason approached the king and promised a large sum of money if he were appointed high priest, even more than what was required, as well as extra for granting the power to set up a Greek-style gymnasium and youth center.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "Bribery for spiritual office contradicts the divine pattern of calling, establishing the danger of worldly infiltration into God’s order, a lesson for church governance."
    },
    {
      "pk": 21004009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 9,
      "text": "The king granted Jason’s request, giving him authority to train Jerusalem’s youth after the customs of the Greeks and to establish places for athletic contests.",
      "links": "<a href='/AIV/21/6/9'>2Macc 6:9</a>",
      "comment": "The introduction of foreign customs challenges God’s revealed ways, foreshadowing the tension between the holy tradition and the spirit of the age."
    },
    {
      "pk": 21004010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 10,
      "text": "Jason accepted the king’s terms and, as soon as he had authority, began transforming his compatriots by introducing foreign habits and rejecting the ancestral laws.",
      "links": "<a href='/AIV/21/4/12'>2Macc 4:12</a>",
      "comment": "Abandoning the faith of the fathers teaches the importance of continuity in doctrine and worship."
    },
    {
      "pk": 21004011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 11,
      "text": "He set aside the royal concessions granted to the Jews through Eupolemus, son of John, who went on an embassy to Rome for an agreement of friendship and alliance, and he destroyed lawful ways of living and introduced new customs contrary to the law.",
      "links": "<a href='/AIV/20/8/17'>1Macc. 8:17</a>; <a href='/AIV/30/32/35'>Jer. 32:35</a>; <a href='/AIV/34/7/25'>Dan. 7:25</a>",
      "comment": "Jason’s rejection of prior royal privileges and adoption of Greek customs marks a pivotal moment of Hellenization, eroding Jewish identity and faithfulness to the Law (cf. 1 Maccabees 1:11-15)."
    },
    {
      "pk": 21004012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 12,
      "text": "He eagerly built a gymnasium at the foot of the citadel, making the most influential youths train in Greek ways.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "The physical transformation of young people pictures the spiritual dangers of syncretism – blending sacred tradition with secular culture."
    },
    {
      "pk": 21004013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 13,
      "text": "There was such an extreme of Hellenization and increase in the adoption of foreign ways because of the surpassing wickedness of Jason, who was ungodly and no true high priest,",
      "links": "<a href='/AIV/21/6/10'>2Macc 6:10</a>; <a href='/AIV/39/2/7'>Mal. 2:7</a>",
      "comment": "This translation restores the judgment on Jason’s character and legitimacy, underscoring the crisis from having an impious, illegitimate high priest furthering Hellenization."
    },
    {
      "pk": 21004014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 14,
      "text": "They disdained the things honored by their ancestors and loved the glory granted by the Greeks, even to the point of abandoning the dignity of their own service.",
      "links": "<a href='/AIV/43/12/43'>John 12:43</a>",
      "comment": "Seeking worldly honor above God’s calls to remain faithful. Christ urges His disciples to renounce worldly glory (<a href='/AIV/40/6/1-4'>Matt 6:1-4</a>)."
    },
    {
      "pk": 21004015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 15,
      "text": "For this reason, they were not merely disregarding the Law but were living as enemies to the ancient customs.",
      "links": "<a href='/AIV/19/78/56-57'>Ps. 78:56-57</a>",
      "comment": "Rebellion against tradition is depicted as enmity to God, highlighting the sacred continuity between generations through faith."
    },
    {
      "pk": 21004016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 16,
      "text": "When they imitated foreign ways and customs, they faced the worst kinds of misery, as the One who gave them their privilege turned against them.",
      "links": "<a href='/AIV/23/1/4'>Isa. 1:4</a>",
      "comment": "Spiritual consequence follows unfaithfulness; God’s blessings are tied to covenant fidelity."
    },
    {
      "pk": 21004017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 17,
      "text": "For it is not easy to break the divine laws and escape punishment, as history has shown of those who persistently transgress them.",
      "links": "<a href='/AIV/5/11/26-28'>Deut. 11:26-28</a>",
      "comment": "The spiritual principle of retribution and mercy through covenant is demonstrated here. The seriousness of sin is precisely why the need for mediators and repentance is essential."
    },
    {
      "pk": 21004018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 18,
      "text": "When the quadrennial games were held in Tyre, in the presence of the king, some from Jerusalem were sent as delegates with gifts.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "Participation in pagan festivals by Jewish delegates underscores the dilemma of cultural assimilation versus faithfulness."
    },
    {
      "pk": 21004019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 19,
      "text": "Jason, the sponsor of the delegation, sent three men with silver to pay for a sacrifice to Hercules, but those men did not use the money for that purpose out of conscience.",
      "links": "<a href='/AIV/19/115/2-8'>Ps. 115:2-8</a>",
      "comment": "The refusal to offer to idols marks a remnant of faithfulness, bearing witness to the enduring call to avoid idolatry. Conscience guides the true believer."
    },
    {
      "pk": 21004020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 20,
      "text": "So this money was intended by the sender for the sacrifice to Hercules, but by the decision of its carriers it was applied to the construction of triremes.",
      "links": "<a href='/AIV/20/15/16'>1Macc. 15:16-18</a>; <a href='/AIV/21/5/16'>2Macc. 5:16</a>; <a href='/AIV/34/11/24'>Dan. 11:24</a>",
      "comment": "Money intended for the Jerusalem temple was instead redirected to naval armament, reflecting both the secular priorities of the Seleucid authorities and the misuse of sacred resources."
    },
    {
      "pk": 21004021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 21,
      "text": "When Apollonius, son of Menestheus, was sent to Egypt for the coronation of King Philometor, Antiochus learned the king was against his interests, and was concerned for his own safety.",
      "links": "<a href='/AIV/27/11/17'>Dan 11:17</a>",
      "comment": "Political alliances and rivalries often impacted spiritual life, influencing who would support or oppose true worship."
    },
    {
      "pk": 21004022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 22,
      "text": "So Antiochus traveled to Joppa and then to Jerusalem, welcomed splendidly by Jason and the city, with torches, processions, and cheers.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "The welcoming of foreign rule highlights the temptation to seek human approval over divine authority."
    },
    {
      "pk": 21004023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 23,
      "text": "While the king was at Tyre, Jason sent Menelaus, brother of Simon, to deliver money to the king and complete negotiations. But Menelaus, taking advantage of the opportunity, usurped the high priesthood for himself.",
      "links": "<a href='/AIV/21/4/7'>2Macc. 4:7</a>; <a href='/AIV/20/1/11'>1Macc. 1:11-15</a>; <a href='/AIV/34/8/11'>Dan. 8:11</a>",
      "comment": "Menelaus’s usurpation of the high priesthood, facilitated by Jason’s trust, exemplifies the corrupting influence of politics and money in spiritual matters, which repeatedly afflicted Israel (cf. 1 Maccabees 7:5-9).",
      "sectionHeader": "Menelaus Usurps the High Priesthood"
    },
    {
      "pk": 21004024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 24,
      "text": "But he, when presented to the king, extolled him with an air of authority, and secured the high priesthood for himself, outbidding Jason by three hundred talents of silver.",
      "links": "<a href='/AIV/4/16/1-2'>Num. 16:1-2</a>",
      "comment": "Menelaus supplants Jason through a higher bribe and persuasive flattery, signaling the growing corruption in priestly appointments under foreign rule."
    },
    {
      "pk": 21004025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 25,
      "text": "After receiving the king’s orders he returned, possessing no qualification for the high priesthood, but having the hot temper of a cruel tyrant and the rage of a savage wild beast.",
      "links": "<a href='/AIV/21/4/7'>2Macc 4:7</a>",
      "comment": "The text condemns Menelaus not for his lineage, but for his lack of qualification and tyrannical nature, highlighting the moral failings of his character."
    },
    {
      "pk": 21004026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 26,
      "text": "So Jason, who after supplanting his own brother was supplanted by another man, was driven as a fugitive into the land of Ammon.",
      "links": "<a href='/AIV/21/4/14'>2Macc 4:14</a>",
      "comment": "Jason, himself once an usurper, now suffers displacement and exile, showing the instability and peril of illicit power."
    },
    {
      "pk": 21004027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 27,
      "text": "Although Menelaus continued to hold the office, he did not pay regularly any of the money he had promised to the king.",
      "links": "<a href='/AIV/20/10/46'>1Macc. 10:46</a>; <a href='/AIV/24/13/11'>Prov. 13:11</a>; <a href='/AIV/27/14/28'>Wis. 14:28</a>",
      "comment": "Menelaus’s failure to pay the agreed tribute underscores his illegitimacy and the instability caused by purchasing religious offices, a recurring criticism in Second Temple critiques."
    },
    {
      "pk": 21004028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 28,
      "text": "When Sostratus, the captain of the citadel, kept requesting payment—for the collection of the revenue was his duty—the two men were summoned by the king regarding this matter.",
      "links": "<a href='/AIV/11/12/27'>1Kgs. 12:27-28</a>; <a href='/AIV/34/6/2'>Dan. 6:2</a>; <a href='/AIV/20/11/61'>1Macc. 11:61</a>",
      "comment": "The king personally addresses the financial irregularities, showing how Jewish religious appointments and the temple's wealth were subject to Hellenistic political-economic oversight."
    },
    {
      "pk": 21004029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 29,
      "text": "Menelaus left his own brother Lysimachus as deputy in the high priesthood, while Sostratus left Crates, the commander of the Cyprian troops.",
      "links": "<a href='/AIV/16/13/4'>Neh. 13:4-9</a>; <a href='/AIV/20/6/16'>1Macc. 6:16</a>; <a href='/AIV/51/6/3'>Acts. 6:3</a>",
      "comment": "Menelaus and Sostratus temporarily delegate authority, revealing the intertwining of religious and military power, both reliant on royal approval and vulnerable to larger imperial machinations."
    },
    {
      "pk": 21004030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 30,
      "text": "While these events were happening, the people of Tarsus and Mallus revolted because their cities had been given as a gift to Antiochis, the king’s concubine.",
      "links": "<a href='/AIV/34/11/24'>Dan. 11:24</a>; <a href='/AIV/20/11/13'>1Macc. 11:13</a>; <a href='/AIV/19/2/18'>Esth. 2:18</a>",
      "comment": "The rebellion in Tarsus and Mallus arose because Antiochus gifted these cities to his concubine, showing how royal favoritism and land grants often led to local unrest in the Seleucid empire."
    },
    {
      "pk": 21004031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 31,
      "text": "Antiochus, trying to restore order, left Andronicus in charge of Jerusalem and moved to resolve the unrest in Cilicia.",
      "links": "<a href='/AIV/21/5/22'>2Macc 5:22</a>",
      "comment": "Imperial interventions in local religious affairs threaten religious autonomy and purity."
    },
    {
      "pk": 21004032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 32,
      "text": "But Menelaus, seeing an opportunity, stole some of the gold vessels from the temple and gave them to Andronicus; other vessels he had sold to Tyre and the neighboring cities.",
      "links": "<a href='/AIV/21/4/39'>2Macc. 4:39</a>; <a href='/AIV/12/24/13'>2Kgs. 24:13</a>; <a href='/AIV/34/5/3'>Dan. 5:3</a>",
      "comment": "Menelaus’s theft and sale of temple treasures to curry favor and raise funds demonstrates sacrilege and foreshadows later desecrations (cf. 1 Maccabees 1:21-23).",
      "sectionHeader": "Murder of Onias and Retribution Against Andronicus"
    },
    {
      "pk": 21004033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 33,
      "text": "When Onias became fully aware of these acts, he publicly exposed them, having withdrawn to a place of sanctuary at Daphne near Antioch.",
      "links": "<a href='/AIV/11/1/50'>1Kgs. 1:50-51</a>; <a href='/AIV/23/55/15'>Ps. 55:15</a>; <a href='/AIV/47/21/13'>Matt. 21:13</a>",
      "comment": "Onias’s public denunciation from sanctuary highlights his commitment to righteousness despite danger, parallel to prophetic protest in exile (cf. Jer 26:21-24)."
    },
    {
      "pk": 21004034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 34,
      "text": "So Menelaus took Andronicus aside and persuaded him to kill Onias. Andronicus approached Onias, and using deceit, offered him sworn pledges and extended his right hand. Though Onias was still suspicious, Andronicus convinced him to leave the place of sanctuary; then, showing no regard for justice, he immediately murdered him.",
      "links": "<a href='/AIV/23/55/21'>Ps. 55:21</a>; <a href='/AIV/23/109/6'>Ps. 109:6-8</a>; <a href='/AIV/34/6/23'>Dan. 6:23-24</a>",
      "comment": "Andronicus, acting at Menelaus’s instigation, murders Onias by deceit, starkly illustrating the breakdown of justice and echoing the betrayal of righteous leaders (cf. Ps 55:20-21)."
    },
    {
      "pk": 21004035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 35,
      "text": "For this reason, not only Jews but also many of other nations were grieved and displeased at the unjust murder of this man.",
      "links": "<a href='/AIV/1/4/10'>Gen. 4:10</a>; <a href='/AIV/27/4/17'>Wis. 4:17-19</a>; <a href='/AIV/47/27/3'>Matt. 27:3-4</a>",
      "comment": "Onias’s unjust murder shocked both Jews and Gentiles, signaling his reputation for righteousness and the principle of universal recognition of justice and grievance."
    },
    {
      "pk": 21004036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 36,
      "text": "When the king returned from the region of Cilicia, the Jews in the city appealed to him about the unjust murder of Onias, and the Greeks also expressed their hatred of the crime.",
      "links": "<a href='/AIV/21/4/34'>2Macc 4:34</a>; <a href='/AIV/40/27/28'>Matt 27:28</a>",
      "comment": "The public nature of the punishment recalls how evil is exposed and defeated openly, a foreshadowing of Christ’s triumph over sin through visible suffering."
    },
    {
      "pk": 21004037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 37,
      "text": "Therefore Antiochus was deeply grieved and filled with pity, and he wept when he remembered the moderation and good conduct of the deceased.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "The apparent success of evil is a test of faith, yet in God’s providence judgment will come even if delayed. Compare <a href='/AIV/19/73/3'>Ps. 73:3</a>.",
      "sectionHeader": "Plundering of the Temple and the Death of Lysimachus"
    },
    {
      "pk": 21004038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 38,
      "text": "Inflamed with anger, the king immediately stripped Andronicus of his purple robe, tore off his garments, and led him around the entire city to the very spot where he had committed the crime against Onias, and there he put to death the bloodthirsty man. Thus the Lord requited him with the punishment he deserved.",
      "links": "<a href='/AIV/2/21/23'>Exod. 21:23-24</a>; <a href='/AIV/23/94/1'>Ps. 94:1-2</a>; <a href='/AIV/27/11/16'>Wis. 11:16</a>",
      "comment": "The king’s dramatic execution of Andronicus serves as divine retribution, affirming that God’s justice prevails even through Gentile instruments (cf. Deut 19:21; Ps 94:1-2)."
    },
    {
      "pk": 21004039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 39,
      "text": "When Lysimachus, through Menelaus’s orders, committed similar sacrilege, the people became outraged and a crowd formed, furious at the injustice.",
      "links": "<a href='/AIV/21/4/38'>2Macc 4:38</a>",
      "comment": "Collective resistance to sacrilege shows communal responsibility in preserving holiness."
    },
    {
      "pk": 21004040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 40,
      "text": "Lysimachus armed about three thousand men, some led by a certain Auranus, attacking the people with violence.",
      "links": "<a href='/AIV/21/4/39'>2Macc 4:39</a>",
      "comment": "Violent suppression of true worship prefigures persecutions of the faithful throughout history, a call to perseverance."
    },
    {
      "pk": 21004041,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 41,
      "text": "When the crowd realized Lysimachus’s violent intent, they armed themselves with stones and clubs found nearby, overcoming many attackers and even killing some, including Lysimachus by the treasury.",
      "links": "<a href='/AIV/21/4/40'>2Macc 4:40</a>",
      "comment": "The defense of the temple with improvised weapons recalls David’s victories by God’s strength, aligning literal and spiritual resistance (<a href='/AIV/9/17/49'>1Sam 17:49</a>)."
    },
    {
      "pk": 21004042,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 42,
      "text": "So the crowd wounded many of Lysimachus’s men, killed some, put the rest to flight, and they killed Lysimachus himself beside the treasury.",
      "links": "<a href='/AIV/14/24/20'>2Chr. 24:20-22</a>; <a href='/AIV/19/9/5'>Esth. 9:5</a>; <a href='/AIV/20/6/47'>1Macc. 6:47</a>",
      "comment": "The crowd’s violent reaction against Lysimachus for temple plundering shows communal zeal for holiness and foreshadows the rise of popular resistance central to the Maccabean narrative."
    },
    {
      "pk": 21004043,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 43,
      "text": "Charges were brought against Menelaus about this incident.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "Formal accusations are made against Menelaus connecting him directly to the violence and sacrilege near the treasury.",
      "sectionHeader": "Unjust Acquittal of Menelaus"
    },
    {
      "pk": 21004044,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 44,
      "text": "When the king came to Tyre, three men sent by the senate presented the case before him.",
      "links": "<a href='/AIV/21/4/34'>2Macc 4:34</a>",
      "comment": "The Jewish community sends official representatives to accuse Menelaus before the king, reflecting the pursuit of justice through proper legal channels."
    },
    {
      "pk": 21004045,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 45,
      "text": "But Menelaus bribed Ptolemy, son of Dorymenes, for support. As a result, the king was swayed not against Menelaus.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "Influence through bribery corrupts true justice, a continual warning about mixing spiritual authority with worldly politics."
    },
    {
      "pk": 21004046,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 46,
      "text": "Therefore Ptolemy, taking the king aside into a colonnade as if for refreshment, induced the king to change his mind.",
      "links": "<a href='/AIV/19/94/20-21'>Ps. 94:20-21</a>",
      "comment": "False acquittal of evil and condemnation of the righteous is lamented in wisdom literature, underscoring the expectation of the final Judgment."
    },
    {
      "pk": 21004047,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 47,
      "text": "Menelaus, the cause of all the trouble, he acquitted of the charges against him, while he sentenced to death those unfortunate men, who would have been freed uncondemned if they had pleaded even before Scythians.",
      "links": "<a href='/AIV/19/58/2-3'>Ps. 58:2-3</a>",
      "comment": "The narrative emphasizes the bitter irony and injustice: Menelaus is acquitted through corruption while his accusers suffer a fate harsher than even most barbaric courts would give."
    },
    {
      "pk": 21004048,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 48,
      "text": "And so those who had spoken for the city and the villages and the holy vessels quickly suffered the unjust penalty.",
      "links": "<a href='/AIV/19/82/5'>Ps. 82:5</a>; <a href='/AIV/19/119/126'>Ps. 119:126</a>",
      "comment": "Those defending sacred and communal interests are swiftly punished, underscoring the tragic consequences of corrupt leadership and judicial perversion."
    },
    {
      "pk": 21004049,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 49,
      "text": "Therefore even the Tyrians, showing their hatred of the crime, provided magnificently for their funeral.",
      "links": "<a href='/AIV/40/27/57-60'>Matt 27:57-60</a>",
      "comment": "Here, the focus is on the Tyrians’ public repudiation of the injustice by honoring the defenders of the city, villages, and holy vessels with a splendid burial."
    },
    {
      "pk": 21004050,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 50,
      "text": "But Menelaus escaped justice through bribery, continuing in his office, always plotting evil against his fellow citizens.",
      "links": "<a href='/AIV/19/36/1'>Ps. 36:1</a>",
      "comment": "Perseverance of evil for a time is permitted for the greater display of God’s future justice, encouraging humility and patient trust in divine providence."
    }
  ],
  "translatedAt": "2026-01-02T07:07:37.460Z",
  "sections": [
    {
      "title": "Intrigue Against Onias the High Priest",
      "startVerse": 1,
      "endVerse": 6
    },
    {
      "title": "Jason Corruptly Attains the High Priesthood",
      "startVerse": 7,
      "endVerse": 22
    },
    {
      "title": "Menelaus Usurps the High Priesthood",
      "startVerse": 23,
      "endVerse": 31
    },
    {
      "title": "Murder of Onias and Retribution Against Andronicus",
      "startVerse": 32,
      "endVerse": 36
    },
    {
      "title": "Plundering of the Temple and the Death of Lysimachus",
      "startVerse": 37,
      "endVerse": 42
    },
    {
      "title": "Unjust Acquittal of Menelaus",
      "startVerse": 43,
      "endVerse": 50
    }
  ]
}