{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 14,
  "sections": [
    {
      "title": "Demetrius Arrives and Alcimus Seeks Power",
      "startVerse": 1,
      "endVerse": 39
    },
    {
      "title": "The Persecution and Martyrdom of Razis",
      "startVerse": 40,
      "endVerse": 46
    }
  ],
  "verses": [
    {
      "pk": 21014001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 1,
      "text": "Three years later, word came to Judas and his men that Demetrius son of Seleucus had sailed into the harbor of Tripolis with a strong army and a fleet,",
      "links": "<a href='/AIV/12/25/1'>2 Kings 25:1</a>",
      "comment": "Historical background sets the scene for the conflict to come. Demetrius is a new force entering the region, which will have implications for the beleaguered Jewish community.",
      "sectionHeader": "Demetrius Arrives and Alcimus Seeks Power"
    },
    {
      "pk": 21014002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 2,
      "text": "and had taken possession of the country, having made away with Antiochus and his guardian Lysias.",
      "links": "<a href='/AIV/11/1/1'>1 Kings 1:1</a>",
      "comment": "The power struggle following the death of Antiochus leads to Demetrius’s ascension. Succession disputes are a frequent theme in biblical history."
    },
    {
      "pk": 21014003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 3,
      "text": "Now a certain Alcimus, who had formerly been high priest but had willfully defiled himself in the times of separation, realized that there was no way for him to be safe or to have access again to the holy altar,",
      "links": "<a href='/AIV/20/2/2'>Proverbs 2:2</a>",
      "comment": "Alcimus’ ambition echoes earlier biblical figures who sought power for personal gain, paralleling the dangers of seeking authority without divine calling."
    },
    {
      "pk": 21014004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 4,
      "text": "and went to King Demetrius in about the one hundred fifty-first year, presenting to him a crown of gold and a palm, and besides these some of the customary olive branches from the temple. During that day he kept quiet.",
      "links": "<a href='/AIV/19/34/13'>Psalm 34:13</a>",
      "comment": "The betrayal by Alcimus highlights internal divisions and the potential for strife when earthly power is prioritized over faithfulness."
    },
    {
      "pk": 21014005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 5,
      "text": "But he found an opportunity that furthered his mad purpose when he was invited by Demetrius to a meeting of the council and was asked about the attitude and intentions of the Jews. He answered:",
      "links": "<a href='/AIV/20/6/12'>Proverbs 6:12</a>",
      "comment": "Describing the people as unruly and rebellious frames Judas’s actions as a rejection of secular rule, emphasizing fidelity to God over compromise."
    },
    {
      "pk": 21014006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 6,
      "text": "“Those of the Jews who are called Hasideans, whose leader is Judas Maccabeus, are keeping up war and stirring up sedition, and will not let the kingdom attain tranquility.",
      "links": "<a href='/AIV/20/16/18'>Proverbs 16:18</a>",
      "comment": "Alcimus manipulates the king’s fears of rebellion, illustrating how worldly rulers can be swayed by political expediency."
    },
    {
      "pk": 21014007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 7,
      "text": "Therefore I have laid aside my ancestral glory — I mean the high priesthood — and have now come here,",
      "links": "<a href='/AIV/2/28/1'>Exodus 28:1</a>",
      "comment": "Alcimus appeals to his priestly lineage – a theme of legitimate succession and authority reminiscent of Old Testament priestly appointment."
    },
    {
      "pk": 21014008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 8,
      "text": "first because I am genuinely concerned for the interests of the king, and second because I have regard also for my compatriots. For through the folly of those whom I have mentioned our whole nation is now in no small misfortune.",
      "links": "<a href='/AIV/11/20/23'>1 Kings 20:23</a>",
      "comment": "Delegation of military power to Bacchides parallels God’s use of earthly rulers to fulfill divine purposes, even amid human conflict."
    },
    {
      "pk": 21014009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 9,
      "text": "Since you are acquainted, O king, with the details of this matter, may it please you to take thought for our country and our hard-pressed nation with the gracious kindness that you show to all.",
      "links": "<a href='/AIV/2/18/21'>Exodus 18:21</a>",
      "comment": "Selection of Bacchides for his qualities recalls biblical patterns for choosing leaders based on trust and knowledge."
    },
    {
      "pk": 21014010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 10,
      "text": "For as long as Judas lives, it is impossible for the government to find peace.”",
      "links": "<a href='/AIV/3/7/7'>Leviticus 7:7</a>",
      "comment": "Here the priesthood’s restoration is linked to secular intervention, a tension between divine mandate and worldly power seen throughout salvation history."
    },
    {
      "pk": 21014011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 11,
      "text": "When he had said this, the rest of the king’s Friends, who were hostile to Judas, quickly inflamed Demetrius still more.",
      "links": "<a href='/AIV/19/41/9'>Psalm 41:9</a>",
      "comment": "The desertion recalls scriptural warnings against abandoning righteous leaders, showing the persistent temptation to forsake Godly allegiance."
    },
    {
      "pk": 21014012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 12,
      "text": "He immediately chose Nicanor, who had been in command of the elephants, appointed him governor of Judea, and sent him off",
      "links": "<a href='/AIV/19/122/3'>Psalm 122:3</a>",
      "comment": "Arrival in Jerusalem – the focal point of worship – is chosen carefully, underscoring the spiritual contest as much as the military one."
    },
    {
      "pk": 21014013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 13,
      "text": "with orders to kill Judas and scatter his troops, and to install Alcimus as high priest of the great temple.",
      "links": "<a href='/AIV/19/118/8'>Psalm 118:8</a>",
      "comment": "Alcimus’s attempt to win popular support demonstrates the dangers of seeking approval at the expense of true faithfulness."
    },
    {
      "pk": 21014014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 14,
      "text": "And the Gentiles throughout Judea, who had fled before Judas, flocked to join Nicanor, thinking that the misfortunes and calamities of the Jews would mean prosperity for themselves.",
      "links": "<a href='/AIV/40/23/2-3'>Matthew 23:2-3</a>",
      "comment": "Righteous leaders seek truth over expedient power; note the early mention of scribes and Pharisees, foreshadowing later tensions found in the Gospels."
    },
    {
      "pk": 21014015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 15,
      "text": "When the Jews heard of Nicanor’s coming and the gathering of the Gentiles, they sprinkled dust on their heads and prayed to him who established his own people forever and always upholds his own heritage by manifesting himself.",
      "links": "<a href='/AIV/19/18/6'>Psalm 18:6</a>",
      "comment": "Prayer in crisis connects the remnant’s faith to God’s deliverance, echoing countless moments in salvation history."
    },
    {
      "pk": 21014016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 16,
      "text": "At the command of the leader, they set out from there immediately and engaged them in battle at a village called Dessau.",
      "links": "<a href='/AIV/7/17/47'>1 Samuel 17:47</a>",
      "comment": "Mobilizing for battle out of faithfulness echoes David’s example; not merely military, but spiritual courage is implied."
    },
    {
      "pk": 21014017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 17,
      "text": "Simon, the brother of Judas, had encountered Nicanor, but had been temporarily checked because of the sudden consternation created by the enemy.",
      "links": "<a href='/AIV/10/18/7'>2 Samuel 18:7</a>",
      "comment": "A theme of remnant faithfulness rises here, prefiguring the steadfastness required of believers despite temptations to abandon the cause."
    },
    {
      "pk": 21014018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 18,
      "text": "Nevertheless Nicanor, hearing of the valor of Judas and his troops and their courage in battle for their country, shrank from deciding the issue by bloodshed.",
      "links": "<a href='/AIV/2/20/10'>Exodus 20:10</a>",
      "comment": "Attack planned for the Sabbath underlines opposition to God’s law, drawing attention to the holiness of the seventh day and the cost of fidelity."
    },
    {
      "pk": 21014019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 19,
      "text": "Therefore he sent Posidonius, Theodotus, and Mattathias to give and receive pledges of friendship.",
      "links": "<a href='/AIV/19/120/6'>Psalm 120:6</a>",
      "comment": "Desire for peace is contrasted with the necessity of remaining faithful in the face of persecution, a theme continued into the New Testament."
    },
    {
      "pk": 21014020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 20,
      "text": "When the terms had been fully considered, and the leader had informed the people, and it had appeared that they were of one mind, they agreed to the covenant.",
      "links": "<a href='/AIV/1/21/31'>Genesis 21:31</a>",
      "comment": "Making oaths recalls patriarchal covenants. Faithfulness to one’s word is rooted in Old Testament teachings."
    },
    {
      "pk": 21014021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 21,
      "text": "The leaders set a day on which to meet by themselves. A chariot came forward from each army; seats of honor were set in place;",
      "links": "<a href='/AIV/7/7/14'>1 Samuel 7:14</a>",
      "comment": "Temporary peace foreshadows the cyclical pattern of rest and oppression found throughout salvation history."
    },
    {
      "pk": 21014022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 22,
      "text": "Judas posted armed men in readiness at key places to prevent sudden treachery on the part of the enemy; so they duly held the consultation.",
      "links": "<a href='/AIV/19/74/4'>Psalm 74:4</a>",
      "comment": "Unjust leadership causes ongoing suffering. Scriptural tradition emphasizes God’s ultimate justice even amid corrupt authority."
    },
    {
      "pk": 21014023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 23,
      "text": "Nicanor stayed on in Jerusalem and did nothing out of the way, but dismissed the flocks of people that had gathered.",
      "links": "<a href='/AIV/20/8/4'>Proverbs 8:4</a>",
      "comment": "Alcimus’s ruthless pursuit of power stands in contrast to the humility and justice meant to mark divinely appointed leaders."
    },
    {
      "pk": 21014024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 24,
      "text": "And he kept Judas always in his presence; he was warmly attached to the man.",
      "links": "<a href='/AIV/6/24/15'>Joshua 24:15</a>",
      "comment": "Gathering the faithful remnant illustrates continuity through apostolic tradition passed down by those loyal to God."
    },
    {
      "pk": 21014025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 25,
      "text": "He urged him to marry and have children; so Judas married, settled down, and shared the common life.",
      "links": "<a href='/AIV/16/6/6'>Nehemiah 6:6</a>",
      "comment": "The constant reporting to foreign rulers highlights the tension between local fidelity and outside interference, an early echo of conflicts seen in Acts."
    },
    {
      "pk": 21014026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 26,
      "text": "But when Alcimus noticed their goodwill for one another, he took the covenant that had been made and went to Demetrius. He told him that Nicanor was disloyal to the government, since he had appointed that conspirator against the kingdom, Judas, to be his successor.",
      "links": "<a href='/AIV/7/8/20'>1 Samuel 8:20</a>",
      "comment": "Nicanor’s role as the king’s agent resembles the use of secular enforcers throughout history to suppress religious renewal."
    },
    {
      "pk": 21014027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 27,
      "text": "The king became excited and, provoked by the false accusations of that depraved man, wrote to Nicanor, stating that he was displeased with the covenant and commanding him to send Maccabeus to Antioch as a prisoner without delay.",
      "links": "<a href='/AIV/1/33/4'>Genesis 33:4</a>",
      "comment": "Attempts at peace by Nicanor show the possibility, but also the limits, of reconciliation without shared values or divine truth."
    },
    {
      "pk": 21014028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 28,
      "text": "When this message came to Nicanor, he was troubled and grieved that he had to annul their agreement when the man had done no wrong.",
      "links": "<a href='/AIV/20/1/7'>Proverbs 1:7</a>",
      "comment": "Wisdom and prudence are needed when dealing with untrustworthy authorities; Judas’s discernment is praised."
    },
    {
      "pk": 21014029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 29,
      "text": "Since it was not possible to oppose the king, he watched for an opportunity to accomplish this by a stratagem.",
      "links": "<a href='/AIV/19/55/21'>Psalm 55:21</a>",
      "comment": "The duplicity displayed here echoes consistent biblical warnings about false prophets and counterfeit peace."
    },
    {
      "pk": 21014030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 30,
      "text": "But Maccabeus, noticing that Nicanor was more austere in his dealings with him and was meeting him more rudely than had been his custom, concluded that this austerity did not spring from the best motives. So he gathered not a few of his men, and went into hiding from Nicanor.",
      "links": "<a href='/AIV/20/27/12'>Proverbs 27:12</a>",
      "comment": "Faithful leaders guided by wisdom avoid danger; vigilance is a mark of spiritual maturity."
    },
    {
      "pk": 21014031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 31,
      "text": "When the latter became aware that he had been cleverly outwitted by the man, he went to the great and holy temple while the priests were offering the customary sacrifices, and commanded them to hand the man over.",
      "links": "<a href='/AIV/2/30/10'>Exodus 30:10</a>",
      "comment": "The entry into the holy place by a secular leader highlights the sanctity of worship and the gravity of intrusion, prefiguring Christ’s cleansing of the Temple."
    },
    {
      "pk": 21014032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 32,
      "text": "When they declared on oath that they did not know where the man was whom he wanted,",
      "links": "<a href='/AIV/24/7/4'>Jeremiah 7:4</a>",
      "comment": "Threat against the Temple demonstrates disregard for sacred things, which underlines the centrality of proper worship and God’s dwelling among His people."
    },
    {
      "pk": 21014033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 33,
      "text": "he stretched out his right hand toward the sanctuary, and swore this oath: “If you do not hand Judas over to me as a prisoner, I will level this shrine of God to the ground and tear down the altar, and build here a splendid temple to Dionysus.”",
      "links": "<a href='/AIV/19/51/17'>Psalm 51:17</a>",
      "comment": "Fervent prayer for the sanctity of worship shows reliance on God’s mercy and intervention, prefiguring intercessory prayers for protection of the Church."
    },
    {
      "pk": 21014034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 34,
      "text": "Having said this, he went away. Then the priests stretched out their hands toward heaven and called upon the constant Defender of our nation, in these words:",
      "links": "<a href='/AIV/23/56/7'>Isaiah 56:7</a>",
      "comment": "The dedication of the Temple as God’s dwelling foreshadows the later understanding of the spiritual house being God’s community."
    },
    {
      "pk": 21014035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 35,
      "text": "“O Lord of all, though you have need of nothing, you were pleased that there should be a temple for your habitation among us;",
      "links": "<a href='/AIV/11/16/18'>1 Kings 16:18</a>",
      "comment": "Divine judgment threatens those who would destroy what is holy; the severity of oaths shows the tension between human pride and God’s protection."
    },
    {
      "pk": 21014036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 36,
      "text": "so now, O holy One, Lord of all holiness, keep undefiled forever this house that has been so recently purified.”",
      "links": "<a href='/AIV/19/28/9'>Psalm 28:9</a>",
      "comment": "Intercessory prayer by the priests is deeply rooted in tradition; it reflects confidence in divine protection for the faithful remnant."
    },
    {
      "pk": 21014037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 37,
      "text": "A certain Razis, one of the elders of Jerusalem, was denounced to Nicanor as a man who loved his compatriots and was very well thought of and for his goodwill was called father of the Jews.",
      "links": "<a href='/AIV/19/79/1'>Psalm 79:1</a>",
      "comment": "The prayer for preservation of the holy place links to numerous psalms, showing the continuity of God’s promise of inheritance."
    },
    {
      "pk": 21014038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 38,
      "text": "In former times, when there was no mingling with the Gentiles, he had been accused of Judaism, and he had most zealously risked body and life for Judaism.",
      "links": "<a href='/AIV/16/13/14'>Nehemiah 13:14</a>",
      "comment": "Razis’s faithfulness amidst persecution calls to mind martyrs and saints who stand firm for the truth."
    },
    {
      "pk": 21014039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 39,
      "text": "Nicanor, wishing to exhibit the enmity that he had for the Jews, sent more than five hundred soldiers to arrest him;",
      "links": "<a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Sacrificial loyalty is lifted up as the highest form of faith, anticipating Christ’s sacrifice for His Church."
    },
    {
      "pk": 21014040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 40,
      "text": "for he thought that by arresting him he would do them an injury.",
      "links": "<a href='/AIV/44/12/4'>Acts 12:4</a>",
      "comment": "Persecution of Razis by overwhelming force displays the cost of testimony, prefiguring the trials faced by the early believers and martyrs.",
      "sectionHeader": "The Persecution and Martyrdom of Razis"
    },
    {
      "pk": 21014041,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 41,
      "text": "When the troops were about to capture the tower and were forcing the door of the courtyard, they ordered that fire be brought and the doors burned. Being surrounded, Razis fell upon his own sword,",
      "links": "<a href='/AIV/10/22/1-2'>2 Samuel 22:1-2</a>, <a href='/AIV/19/118/10-13'>Psalm 118:10-13</a>",
      "comment": "Razis, known for his devotion to the law, chooses to die with honor rather than fall into enemy hands, demonstrating the ancient Jewish belief in martyrdom for the sake of the Law. The reference to fire and sword parallels episodes of self-sacrifice in the Old Testament."
    },
    {
      "pk": 21014042,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 42,
      "text": "preferring to die nobly rather than to fall into the hands of sinners and suffer outrages unworthy of his noble birth.",
      "links": "<a href='/AIV/58/11/35-38'>Hebrews 11:35-38</a>, <a href='/AIV/19/31/17-18'>Psalm 31:17-18</a>",
      "comment": "This verse highlights Eleazar’s commitment to preserving his honor and the reputation of his noble lineage, a value deeply rooted in Jewish culture and Hellenistic notions of virtue. His choice to accept a dignified death rather than endure abuses at the hands of his enemies underscores the importance of upholding faithfulness and noble identity, even in the face of suffering. The language evokes broader themes of martyrdom and integrity in Jewish literature."
    },
    {
      "pk": 21014043,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 43,
      "text": "But in the heat of the struggle he did not hit exactly, and the crowd was now rushing in through the doors. He courageously ran up on the wall, and bravely threw himself down into the crowd.",
      "links": "<a href='/AIV/07/16/28-30'>Judges 16:28-30</a>, <a href='/AIV/44/7/59-60'>Acts 7:59-60</a>",
      "comment": "Razis's self-sacrifice brings to mind the courage of biblical figures like Samson and Stephen, who trusted God in their final moments. Leaping from the wall illustrates both human vulnerability and heroic resolve."
    },
    {
      "pk": 21014044,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 44,
      "text": "But as they quickly drew back, a space opened and he fell in the middle of the empty space.",
      "links": "<a href='/AIV/19/27/1-3'>Psalm 27:1-3</a>, <a href='/AIV/19/18/2'>Psalm 18:2</a>",
      "comment": "Razis's perseverance, even as he clings to life, demonstrates extraordinary zeal for faithfulness, reminiscent of other martyrs and the steadfastness celebrated in Psalms. This defense of faith at the cost of pain witnesses to the hope of the righteous."
    },
    {
      "pk": 21014045,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 45,
      "text": "Still alive and aflame with anger, he rose, and though his blood gushed forth and his wounds were severe he ran through the crowd; and standing upon a steep rock,",
      "links": "<a href='/AIV/01/02/7'>Genesis 2:7</a>, <a href='/AIV/42/23/46'>Luke 23:46</a>, <a href='/AIV/58/11/35'>Hebrews 11:35</a>",
      "comment": "Razis's prayer for resurrection reveals a belief in life after death and the restoration of the righteous, anticipating themes made clearer in later revelation. His appeal to the Lord of life connects to Old and New Testament references to God's power over life and death."
    },
    {
      "pk": 21014046,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 46,
      "text": "with his blood now completely drained from him, he tore out his entrails, took them in both hands and hurled them at the crowd, calling upon the Lord of life and spirit to give them back to him again. This was the manner of his death.",
      "links": "<a href='/AIV/07/16/30'>Judges 16:30</a>, <a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Razis’s martyrdom becomes an enduring testimony for future generations—dying rather than betraying the faith. His sacrifice foreshadows the perfection of self-giving love, which is fulfilled in Christ’s ultimate gift on the Cross. The imitation of such fidelity anticipates the high call of sanctity for all believers."
    }
  ],
  "translatedAt": "2026-01-01T21:42:41.957Z"
}