{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 1,
  "verses": [
    {
      "pk": 21001001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 1,
      "text": "To our Jewish brothers in Egypt, greetings from your brothers, the Jews in Jerusalem and in the land of Judea. May God give you peace.",
      "links": "<a href='/AIV/44/7/14-16'>Acts 7:14-16</a>",
      "comment": "This opening salutation is characteristic of ancient epistles, showing unity in faith and brotherhood among the dispersed Jews. The reference to peace connects with Old Testament greetings such as those in Nehemiah 1:2.",
      "sectionHeader": "Greeting to the Jews in Egypt"
    },
    {
      "pk": 21001002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 2,
      "text": "May God bless you and remember his covenant with Abraham, Isaac, and Jacob, his faithful servants.",
      "links": "<a href='/AIV/01/17/7-8'>Gen 17:7-8</a>; <a href='/AIV/02/02/24'>Ex 2:24</a>",
      "comment": "The emphasis on the covenant recalls the enduring relationship between God and his people established through the patriarchs, a theme that points towards God's ongoing involvement in salvation history."
    },
    {
      "pk": 21001003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 3,
      "text": "May he give you all a heart to worship him and to do his will with a generous spirit and a willing mind.",
      "links": "<a href='/AIV/19/51/10'>Ps. 51:10</a>; <a href='/AIV/05/06/5'>Deut 6:5</a>",
      "comment": "The transformation of the heart is repeated throughout Scripture as the key to faithfulness to God; cf. Ezekiel 36:26, Psalm 51. This union of heart and will with God's commands is a central theme in the spiritual life."
    },
    {
      "pk": 21001004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 4,
      "text": "May he open your hearts to his Law and his commandments and bring you peace.",
      "links": "<a href='/AIV/19/119/18'>Ps. 119:18</a>",
      "comment": "The request for an open heart toward God's Law foreshadows the emphasis in later revelation on the Law being written on the heart (Jer. 31:33, Heb. 8:10), highlighting both obedience and interior transformation."
    },
    {
      "pk": 21001005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 5,
      "text": "May he hear your prayers and be reconciled to you, and never abandon you in times of trouble.",
      "links": "<a href='/AIV/05/31/6'>Deut 31:6</a>; <a href='/AIV/58/13/5'>Heb 13:5</a>",
      "comment": "The theme of reconciliation with God is foundational for the spiritual life. The assurance that God does not abandon his people, seen consistently throughout the Scriptures, points to his faithfulness and steadfast love."
    },
    {
      "pk": 21001006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 6,
      "text": "Now we are praying for you here.",
      "links": "<a href='/AIV/01/20/7'>Gen 20:7</a>",
      "comment": "Prayer for others reflects the idea of intercessory prayer, which is found throughout Scripture and forms an important practice of the faith. See also 1 Tim 2:1 for New Testament parallels."
    },
    {
      "pk": 21001007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 7,
      "text": "In the reign of Demetrius, in the one hundred sixty-ninth year, we Jews wrote to you, in the critical distress that came upon us in those years after Jason and his company revolted from the holy land and the kingdom",
      "links": "See also 2 Macc 4:7-17",
      "comment": "This verse recalls a past plea for help during the reign of Demetrius (c. 143 BC), referencing the turmoil instigated by Jason's revolt and highlighting the Jewish community's turning back to proper worship, including sacrifices and rituals."
    },
    {
      "pk": 21001008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 8,
      "text": "and burned the gate and shed innocent blood. We prayed to the Lord and were heard, and we offered sacrifice and grain offering, and we lit the lamps and set out the loaves.",
      "links": [
        "2 Chr 7:6",
        "Lev 24:5-9",
        "Ex 40:25"
      ],
      "comment": "By reiterating the violence of Jason’s betrayal—burning the gate and shedding innocent blood—the text underscores both the gravity of apostasy and the restoration of worship through prayer, sacrifice, and temple rites reminiscent of Levitical law (Lev 24:5-9)."
    },
    {
      "pk": 21001009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 9,
      "text": "And now see that you keep the festival of booths in the month of Chislev, in the one hundred eighty-eighth year.",
      "links": [
        "Lev 23:34",
        "Ezra 6:16",
        "John 7:2"
      ],
      "comment": "The instruction to celebrate the festival of booths (Sukkot) in Chislev rather than its typical Tishrei calendar date reflects Judaism's adaptation amid persecution and the retroactive sanctification of Hanukkah in connection with Sukkot (cf. 2 Macc 10:6-8)."
    },
    {
      "pk": 21001010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 10,
      "text": "The people of Jerusalem and of Judea and the senate and Judas, To Aristobulus, who is of the family of the anointed priests, teacher of King Ptolemy, and to the Jews in Egypt, Greetings and good health.",
      "links": [
        "Ezra 5:1",
        "Acts 18:24",
        "Phil 1:2"
      ],
      "comment": "This greeting introduces the epistolary section, naming Aristobulus—a respected Jewish scholar and priestly descendant—thus indicating an appeal for unity and shared commemoration among Jews in Jerusalem and the diaspora."
    },
    {
      "pk": 21001011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 11,
      "text": "To Aristobulus, who is of the family of the anointed priests and teacher of King Ptolemy, as well as to the Jews in Egypt, greetings and good health.",
      "links": [
        "Acts 15:23",
        "2 Macc 1:1",
        "Rom 1:7"
      ],
      "comment": "The repetition of Aristobulus’ credentials highlights Jewish intellectual and spiritual leadership in the Egyptian diaspora and underscores the intent to maintain religious ties across geographic boundaries."
    },
    {
      "pk": 21001012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 12,
      "text": "Having been saved by God out of great dangers, we thank him greatly for taking our side against the king; for he drove out those who fought against the holy city.",
      "links": [
        "Ps 124:7",
        "Dan 6:27",
        "2 Macc 8:31"
      ],
      "comment": "The community's thanksgiving for God’s decisive intervention against enemies recalls the recurring biblical theme of divine deliverance (e.g., Exod 14:30) and reinforces the Maccabean conviction of God's sovereignty over Israel’s fate."
    },
    {
      "pk": 21001013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 13,
      "text": "For when the leader arrived in Persia with his seemingly invincible army, he was cut down in the temple of Nanea by a ruse made by the priests of Nanea.",
      "links": [
        "Dan 8:25",
        "Esth 7:10",
        "1 Macc 6:1-16"
      ],
      "comment": "Referencing Antiochus IV’s defeat in the temple of Nanea (a Persian goddess), the narrative attributes his downfall not to human might but to divine retribution, paralleling stories like Haman’s demise in Esther."
    },
    {
      "pk": 21001014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 14,
      "text": "For under the pretext of marrying her, Antiochus came with his friends to the place to receive money as a dowry; but when the priests of Nanea had set it out, and he had come with a few men inside the sacred precinct, they closed the temple as soon as he entered.",
      "links": [
        "Ps 37:12-13",
        "Esth 3:10",
        "Dan 5:30"
      ],
      "comment": "Antiochus’s deceitful intent to plunder the temple under the guise of marriage is met with poetic justice, echoing Old Testament narratives where pride leads to downfall (Prov 16:18).",
      "sectionHeader": "Deliverance and Dedication of the Temple"
    },
    {
      "pk": 21001015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 15,
      "text": "Then opening a secret door in the ceiling, they threw stones and struck down the leader and his men. They cut them in pieces and threw their heads to those outside.",
      "links": [
        "Ps 2:4-5",
        "Judg 9:53-54",
        "Dan 2:34"
      ],
      "comment": "The grisly fate of Antiochus and his men, orchestrated by the priests, serves as both narrative climax and theological assertion: God vindicates His sanctuary and punishes impiety."
    },
    {
      "pk": 21001016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 16,
      "text": "Blessed be our God in all things, who has delivered up the impious.",
      "links": [
        "Ps 18:46",
        "Ex 15:2",
        "Isa 25:9"
      ],
      "comment": "A doxology concludes this episode, driving home the message that the true God actively judges and delivers His people throughout history (cf. Dan 3:28-29)."
    },
    {
      "pk": 21001017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 17,
      "text": "Since we shall be celebrating the purification of the temple on the twenty-fifth of Chislev, we thought it right to notify you, so that you also may celebrate it, as the feast of the tabernacles and of the fire which was given when Nehemiah offered sacrifices after rebuilding the temple and the altar.",
      "links": [
        "1 Macc 4:36",
        "Ezra 6:16",
        "2 Chr 7:9"
      ],
      "comment": "The reference to the purification of the temple on the twenty-fifth of Chislev links the origins of Hanukkah to Sukkot traditions and Nehemiah’s post-exilic restoration (Neh 12:27, 43), emphasizing continuity in worship and divine faithfulness."
    },
    {
      "pk": 21001018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 18,
      "text": "Since on the twenty-fifth day of Chislev we shall celebrate the purification of the temple, we thought it necessary to notify you, in order that you also may celebrate the festival of booths and the festival of the fire given when Nehemiah, who built the temple and the altar, offered sacrifices.",
      "links": "<a href='/AIV/16/12/27'>Neh 12:27</a>; <a href='/AIV/03/07/12'>Lev 7:12</a>",
      "comment": "The process of purification and re-dedication of the Temple foreshadows the continual need for communal renewal and gratitude for redemption."
    },
    {
      "pk": 21001019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 19,
      "text": "For when our ancestors were being led captive to Persia, the pious priests of that time took some of the fire of the altar and secretly hid it in the hollow of a dry cistern, where they took such precautions that the place was unknown to anyone.",
      "links": "<a href='/AIV/43/10/22'>John 10:22</a>",
      "comment": "The annual celebration points to the institution of Hanukkah. Jesus himself attended this festival in John 10:22, linking Old Testament tradition with the New Testament context."
    },
    {
      "pk": 21001020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 20,
      "text": "As things happened, the priests who were then at the time of the exile sought to take the sacred fire from the altar and, having hidden it secretly in a hollow of a dry cistern, kept it safe in that place, so that the place was unknown to anyone.",
      "links": "<a href='/AIV/16/02/1'>Neh 2:1</a>",
      "comment": "The secret preservation of the altar fire shows reverence for God's commandments and the importance placed on continuity in the worship of God, mirroring later preservations of faith in times of persecution.",
      "sectionHeader": "The Miracle of the Sacred Fire"
    },
    {
      "pk": 21001021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 21,
      "text": "After many years had passed, when it pleased God, Nehemiah, having been commissioned by the king of Persia, sent the descendants of the priests who had hidden the fire to get it. But when they reported that they had not found fire, but only a thick liquid, he ordered them to dip it out and bring it.",
      "links": "<a href='/AIV/16/01/1-11'>Neh 1:1-11</a>",
      "comment": "This highlights the perseverance and safeguarding of the sacred, even when hope and memory have faded among the people."
    },
    {
      "pk": 21001022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 22,
      "text": "When the materials for the sacrifices were presented, Nehemiah ordered the priests to sprinkle the liquid on the wood and on the things laid upon it.",
      "links": "<a href='/AIV/16/02/3-7'>Neh 2:3-7</a>",
      "comment": "A miraculous transformation, suggesting that God's providence can work through ordinary means, a theme mirrored in the miracles of the New Testament (cf. John 2:1-11)."
    },
    {
      "pk": 21001023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 23,
      "text": "He told them to draw some out and bring it to him. When the sacrifices for purification were offered, Nehemiah ordered the priests to sprinkle the wood and what was laid upon it with the liquid.",
      "links": "<a href='/AIV/03/09/17'>Lev 9:17</a>",
      "comment": "The act of sprinkling connects liturgical acts with obedience to God's instructions, a principle found throughout the Law."
    },
    {
      "pk": 21001024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 24,
      "text": "After they had done this, and the time came for the sun, which had been hidden by clouds, to shine, a great fire blazed out so that everyone was amazed.",
      "links": "<a href='/AIV/03/09/24'>Lev 9:24</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>",
      "comment": "Miraculous fire from heaven signifies God's acceptance of the offering. This is paralleled in Elijah's ministry and in the original dedication ceremonies of the tabernacle and temple."
    },
    {
      "pk": 21001025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 25,
      "text": "Everyone fell on their faces and worshipped the Lord, praising him who does great wonders.",
      "links": "<a href='/AIV/41/05/42'>Mark 5:42</a>; <a href='/AIV/19/136/4'>Ps 136:4</a>",
      "comment": "The response of awe and worship at divine intervention is a constant theme in both Old and New Testaments."
    },
    {
      "pk": 21001026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 26,
      "text": "Then the priests began to sing hymns.",
      "links": "<a href='/AIV/19/135/1'>Ps 135:1</a>",
      "comment": "Liturgical singing is fundamental to the worship of God, seen from the Psalms to early Christian liturgies (Eph 5:19)."
    },
    {
      "pk": 21001027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 27,
      "text": "Nehemiah ordered that the remainder of the liquid be poured over large stones.",
      "links": [
        "Lev 8:10-11",
        "Ex 40:9",
        "Neh 13:9"
      ],
      "comment": "Continuing the ceremonial acts connects the physical with the sacred, highlighting how ordinary material things can become instruments of God’s power and grace."
    },
    {
      "pk": 21001028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 28,
      "text": "As soon as this was done, a flame flared up, which was consumed by the light from the altar.",
      "links": [
        "Lev 9:24",
        "1 Kgs 18:38",
        "2 Chr 7:1"
      ],
      "comment": "God’s action through fire is a recurring sign of his presence and approval (cf. Exodus 3:2; Acts 2:3)."
    },
    {
      "pk": 21001029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 29,
      "text": "A report of this event spread everywhere.",
      "links": "<a href='/AIV/02/34/29'>Ex 34:29</a>",
      "comment": "Miracles as signs of God's favor are often witnessed and recounted, strengthening faith in the wider community."
    },
    {
      "pk": 21001030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 30,
      "text": "When the matter was reported to the king of the Persians, he had the place investigated and made it holy.",
      "links": "<a href='/AIV/15/06/3-5'>Ezra 6:3-5</a>",
      "comment": "A foreign king recognizing the holiness there underscores the universality of God's reign and the extension of his works beyond Israel alone (Is 45:1)."
    },
    {
      "pk": 21001031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 31,
      "text": "The king verified the event and built a shrine for it.",
      "links": "<a href='/AIV/15/01/2'>Ezra 1:2</a>",
      "comment": "Secular acknowledgment of sacred events reveals how God can move the hearts of even those outside the faith to respect his works."
    },
    {
      "pk": 21001032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 32,
      "text": "Those with Nehemiah called the liquid 'nephthar,' which means purification, but most people called it 'naphta.'",
      "links": [
        "Num 19:9",
        "Heb 9:13",
        "Ezek 36:25"
      ],
      "comment": "The specific naming of the liquid ties into liturgical traditions. Purification ceremonies point toward the deeper spiritual cleansing the Messiah will later bring (Heb 9:13-14)."
    },
    {
      "pk": 21001033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 33,
      "text": "It is also called 'nephthar,' which means 'purification.'",
      "links": [
        "Ezek 36:25",
        "Ps 51:7",
        "Heb 10:22"
      ],
      "comment": "The repeated emphasis on purification prefigures the central theme of cleansing from sin, later fulfilled in Christ's ultimate sacrifice."
    },
    {
      "pk": 21001034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 34,
      "text": "Nehemiah and his companions called it 'nephthar,' which is translated as 'purification.'",
      "links": [
        "Ps 51:7",
        "Isa 1:25",
        "Heb 9:14"
      ],
      "comment": "This final naming further underscores the importance of ongoing purification for God's people and hints at a continuous tradition of visible and material acts linked to spiritual realities."
    },
    {
      "pk": 21001035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 35,
      "text": "And with those persons whom the king favored he exchanged many excellent gifts.",
      "links": [
        "Dan 1:9",
        "Esth 2:17",
        "Gen 39:4"
      ],
      "comment": "Mentioning the exchange of 'excellent gifts' highlights the diplomatic and material connections between the Jewish community and foreign powers, reflecting a common feature of Hellenistic royal courts."
    },
    {
      "pk": 21001036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 36,
      "text": "Nehemiah and his associates called this “nephthar,” which means purification, but by most people it is called naphtha.",
      "links": [
        "Ezek 36:25",
        "Ps 51:2",
        "Heb 1:3"
      ],
      "comment": "The identification of 'nephthar' (interpreted as naphtha, a flammable substance) as symbolizing purification connects the miraculous fire of Nehemiah’s era with the Hanukkah celebration, reinforcing themes of sanctity, memory, and divine provision."
    }
  ],
  "translatedAt": "2025-12-29T00:38:38.501Z",
  "sections": [
    {
      "title": "Greeting to the Jews in Egypt",
      "startVerse": 1,
      "endVerse": 13
    },
    {
      "title": "Deliverance and Dedication of the Temple",
      "startVerse": 14,
      "endVerse": 19
    },
    {
      "title": "The Miracle of the Sacred Fire",
      "startVerse": 20,
      "endVerse": 36
    }
  ]
}