{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 10,
  "sections": [
    {
      "title": "The Purification of the Temple",
      "startVerse": 1,
      "endVerse": 9
    },
    {
      "title": "Wars under Antiochus Eupator",
      "startVerse": 10,
      "endVerse": 38
    }
  ],
  "verses": [
    {
      "pk": 21010001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 1,
      "text": "Now Maccabeus and his companions, with the Lord leading them, recovered the temple and the city.",
      "links": "<a href='/AIV/14/7/1-11'>2 Chr 7:1-11</a>",
      "comment": "The restoration of the temple by faithful leaders shows God’s faithfulness to his covenant. Just as Solomon dedicated the temple, the themes of purification and reverence flow through Scripture. See also Romans 12:1.",
      "sectionHeader": "The Purification of the Temple"
    },
    {
      "pk": 21010002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 2,
      "text": "They tore down the altars that had been built by foreigners in the public square and also destroyed the sacred precincts.",
      "links": "<a href='/AIV/05/12/3'>Deut 12:3</a>; <a href='/AIV/11/18/30'>1 Kgs 18:30</a>",
      "comment": "Purging the land of idolatry demonstrates the necessity of worshiping God alone. Purity in God’s house foreshadows the call to holiness in the new covenant."
    },
    {
      "pk": 21010003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 3,
      "text": "After cleansing the temple, they made another altar. Then, they struck fire out of flint and offered sacrifices, after a lapse of two years, and they burned incense, and set forth lamps, and set out the bread of the Presence.",
      "links": "<a href='/AIV/02/25/30'>Exod 25:30</a>; <a href='/AIV/03/24/5-9'>Lev 24:5-9</a>",
      "comment": "The return to traditional worship practices reestablishes the continuity from Moses and Aaron, fulfilling the priestly office."
    },
    {
      "pk": 21010004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 4,
      "text": "When they had done this, they fell prostrate and asked the Lord to never again let such disasters come upon them, but if they should ever sin again, to discipline them with mercy and not hand them over to blasphemous and barbarous nations.",
      "links": "<a href='/AIV/19/85/4-7'>Ps 85:4-7</a>",
      "comment": "The people's prayer reflects a theology of repentance and chastening, seeking God's discipline rather than foreign oppression (cf. Leviticus 26:41-45; Hebrews 12:6), rooted in Israel's history of exile and restoration."
    },
    {
      "pk": 21010005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 5,
      "text": "It happened that on the very same day the temple was profaned by foreigners, that was the day of its purification—the twenty-fifth day of the same month, that is Chislev.",
      "links": "<a href='/AIV/03/07/9'>Lev 7:9</a>",
      "comment": "The attention to exact days reflects the importance of liturgical time. Sacred dates are always meaningful in God’s plan."
    },
    {
      "pk": 21010006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 6,
      "text": "They celebrated it for eight days with rejoicing, in the manner of the Feast of Booths, remembering how not long before, during the Feast of Booths, they had been wandering in the mountains and caves like wild animals.",
      "links": "<a href='/AIV/03/23/34-43'>Lev 23:34-43</a>",
      "comment": "The eight-day festival becomes the origin for what’s known as Hanukkah or the Dedication. The continuity between old covenant festivals and new practices is clear, showing how liturgical feasts have a lasting impact."
    },
    {
      "pk": 21010007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 7,
      "text": "So, carrying ivy-wreathed wands and beautiful branches, and also palm fronds, they offered hymns of thanksgiving to him who had given success to the purifying of his own holy place.",
      "links": "<a href='/AIV/19/118/27'>Ps 118:27</a>; <a href='/AIV/43/12/13'>John 12:13</a>",
      "comment": "The use of palm branches and hymns finds its echo in Christ’s entry into Jerusalem, where he is recognized as the Messiah."
    },
    {
      "pk": 21010008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 8,
      "text": "They decreed by public edict and vote that the whole nation of the Jews should observe these days every year.",
      "links": "<a href='/AIV/17/9/27-28'>Esther 9:27-28</a>",
      "comment": "The establishment of annual commemoration is significant for understanding why the Church continues holy traditions by common consent and custom."
    },
    {
      "pk": 21010009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 9,
      "text": "Such was the end of Antiochus called Epiphanes.",
      "links": "<a href='/AIV/27/8/25'>Dan 8:25</a>",
      "comment": "The defeat of the blasphemer Antiochus is both divine justice and vindication for the faithful. God is sovereign over history."
    },
    {
      "pk": 21010010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 10,
      "text": "Now we will make known what happened under Antiochus Eupator, the son of that ungodly man, and we will briefly summarize the distress of the wars.",
      "links": "<a href='/AIV/27/11/21-24'>Dan 11:21-24</a>",
      "comment": "The summary sets up further episodes of Israel’s perseverance and faith in adversity.",
      "sectionHeader": "Wars under Antiochus Eupator"
    },
    {
      "pk": 21010011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 11,
      "text": "This man, when he succeeded to the kingdom, appointed one Lysias to have charge of the government and to be chief governor of Coelesyria and Phoenicia.",
      "links": [
        "1 Macc 3:32",
        "2 Macc 13:2",
        "Dan 11:5"
      ],
      "comment": "The mention of Lysias' appointment situates the narrative amid the power transitions after Antiochus IV Epiphanes, highlighting the strategic importance of Coelesyria and Phoenicia in the Seleucid Empire."
    },
    {
      "pk": 21010012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 12,
      "text": "Ptolemy, who was called Macron, took the lead in showing justice to the Jews because of the wrong that had been done to them, and attempted to maintain peaceful relations with them.",
      "links": [
        "1 Macc 11:58",
        "Esth 8:16",
        "Prov 16:7"
      ],
      "comment": "Ptolemy Macron’s unusual justice toward Jews contrasts with broader Seleucid hostility, signaling complexities in the empire's administration and echoing occasional Gentile favor seen in Esther 8:15-17."
    },
    {
      "pk": 21010013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 13,
      "text": "As a result he was accused before Eupator by the king’s Friends. He heard himself called a traitor at every turn, because he had abandoned Cyprus, which Philometor had entrusted to him, and had gone over to Antiochus Epiphanes. Unable to command the respect due his office, he took poison and ended his life.",
      "links": [
        "1 Macc 15:37",
        "1 Sam 31:4",
        "2 Sam 17:23"
      ],
      "comment": "Political intrigue and shifting loyalties led to Macron’s downfall—his suicide reflects ancient perceptions of honor and shame, paralleling stories such as Ahithophel in 2 Samuel 17:23."
    },
    {
      "pk": 21010014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 14,
      "text": "But at the same time, Gorgias, who was in charge of the region, kept hiring mercenaries and continually attacked the Jews.",
      "links": [
        "2 Macc 8:9",
        "1 Macc 5:55",
        "1 Macc 12:32"
      ],
      "comment": "The persistence of enemy forces anticipates the continual spiritual warfare faced by believers (cf. Ephesians 6:12)."
    },
    {
      "pk": 21010015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 15,
      "text": "At the same time, the men of Idumea, who had some strong fortresses, were harassing the Jews. They welcomed fugitives from Jerusalem and tried to maintain their advantage in war.",
      "links": "<a href='/AIV/09/23/14'>1 Sam 23:14</a>",
      "comment": "Idumea (Edom) is a long-standing adversary of Israel (see Obadiah), showing the lingering consequences of division among God’s people."
    },
    {
      "pk": 21010016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 16,
      "text": "But Maccabeus and his men, after calling on the Lord to fight on their side, attacked the strongholds of the Idumeans with great force.",
      "links": "<a href='/AIV/19/144/1'>Ps 144:1</a>",
      "comment": "Prayer precedes victory, illustrating how battles are won by reliance on God, not merely human strength."
    },
    {
      "pk": 21010017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 17,
      "text": "Taking the fortresses at their posts, he routed those who fought within, and slaughtered as many as twenty thousand.",
      "links": [
        "Judg 15:15",
        "2 Macc 8:24",
        "1 Macc 4:35"
      ],
      "comment": "Divine aid brings total victory. The complete defeat of evil foreshadows Christ’s final triumph (see Revelation 19:19-21)."
    },
    {
      "pk": 21010018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 18,
      "text": "But a group of at least nine thousand men escaped to two strongly fortified towers, carrying all they needed for a siege.",
      "links": [
        "Judg 9:51",
        "Isa 17:9",
        "1 Macc 5:5"
      ],
      "comment": "Even in victory, pockets of resistance remain, showing the ongoing nature of the spiritual battle."
    },
    {
      "pk": 21010019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 19,
      "text": "Maccabeus left Simon and Joseph, and also Zacchaeus and his men, in sufficient numbers to besiege the fortresses. Meanwhile, he went on to more urgent tasks elsewhere.",
      "links": [
        "1 Macc 6:17",
        "2 Macc 8:22",
        "Neh 4:14"
      ],
      "comment": "Division of leadership for multiple fronts points to the gift of wise governance, anticipating later patterns of church leadership."
    },
    {
      "pk": 21010020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 20,
      "text": "But the men with Simon, motivated by greed, were bribed with silver and allowed some of the besieged to escape.",
      "links": "<a href='/AIV/09/12/3'>1 Sam 12:3</a>; <a href='/AIV/40/26/15'>Matt 26:15</a>",
      "comment": "Greed undermines the mission, echoing the betrayal of Christ for silver—reminding us how purity of heart is essential for spiritual victory."
    },
    {
      "pk": 21010021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 21,
      "text": "When Maccabeus was told what had happened, he gathered together the leaders and accused those men of betraying their brothers for money and set them to be executed as traitors.",
      "links": [
        "Josh 7:19-25",
        "2 Macc 4:38",
        "1 Macc 16:15-17"
      ],
      "comment": "Strong corrective discipline is necessary to preserve unity and purity within the community, a theme continued by St. Paul (1 Cor 5:5)."
    },
    {
      "pk": 21010022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 22,
      "text": "He immediately took the two towers by force, and he met with success in all things, with weapons in hand, killing more than twenty thousand in the fortresses.",
      "links": [
        "2 Macc 8:30",
        "1 Sam 18:14",
        "Ps 44:3"
      ],
      "comment": "God’s vindication of just action is evident here, reminiscent of God fighting for Israel in Joshua’s day."
    },
    {
      "pk": 21010023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 23,
      "text": "Having success at arms in everything he undertook, he destroyed more than twenty thousand in the two strongholds.",
      "links": [
        "2 Macc 8:34",
        "1 Macc 3:19",
        "1 Macc 4:34"
      ],
      "comment": "Maccabeus’ military successes are recounted to reinforce God's support and the heroic stature of the Jewish leaders during the Maccabean revolt."
    },
    {
      "pk": 21010024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 24,
      "text": "Now Timothy, who had been defeated by the Jews before, gathered a tremendous force of mercenaries and collected the cavalry from Asia in no small number. He came on, intending to take Judea by storm.",
      "links": [
        "2 Macc 8:8",
        "1 Macc 5:37",
        "Isa 8:9-10"
      ],
      "comment": "Timothy's renewed aggression with mercenaries reveals ongoing threats to Judean autonomy and the widespread opposition faced by the Maccabees."
    },
    {
      "pk": 21010025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 25,
      "text": "As he drew near, Maccabeus and his men sprinkled dust on their heads and girded their loins with sackcloth, in supplication to God.",
      "links": [
        "Judg 20:26",
        "1 Sam 7:6",
        "Joel 2:12"
      ],
      "comment": "Before battle, the ritual acts of dust and sackcloth (cf. Joshua 7:6; Joel 1:13) signal humility, penitence, and dependence on God's deliverance."
    },
    {
      "pk": 21010026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 26,
      "text": "Falling upon the steps before the altar, they implored him to be gracious to them and to be an enemy to their enemies and an adversary to their adversaries, as the law declares.",
      "links": [
        "Ex 23:22",
        "Deut 28:7",
        "Ps 35:1"
      ],
      "comment": "Their prayer for God to be an adversary to their enemies recalls Exodus 23:22 and underscores solidarity with the biblical tradition of divine warfare."
    },
    {
      "pk": 21010027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 27,
      "text": "And rising from their prayer they took up their arms and advanced a considerable distance from the city; and when they came near the enemy they halted.",
      "links": [
        "1 Macc 4:30",
        "Josh 6:16",
        "Phil 4:6-7"
      ],
      "comment": "Prayer precedes action—a consistent pattern in Jewish tradition—displaying both human effort and reliance on God (cf. Nehemiah 4:9, 20)."
    },
    {
      "pk": 21010028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 28,
      "text": "Just as dawn was breaking, the two armies joined battle, the one having as pledge of success and victory not only their valor but also their reliance on the Lord, while the other made rage their leader in the fight.",
      "links": [
        "1 Sam 17:45-47",
        "2 Chr 20:20",
        "Ps 20:7"
      ],
      "comment": "The clear contrast between reliance on God and reliance on rage underlines a central theme: true victory comes by faith, not mere power (see Psalm 20:7)."
    },
    {
      "pk": 21010029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 29,
      "text": "When the battle became fierce, there appeared to the enemy from heaven five resplendent men on horses with golden bridles, and they were leading the Jews.",
      "links": [
        "2 Macc 3:24-26",
        "Ex 14:19-20",
        "Dan 3:25"
      ],
      "comment": "Theophany—divine or angelic helpers appear, reminiscent of angelic intervention in Joshua 5:13-15 and 2 Maccabees 3:24–26, signaling divine support for Israel's cause."
    },
    {
      "pk": 21010030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 30,
      "text": "Two of them took Maccabeus between them, and shielding him with their own armor and weapons, they kept him from being wounded. They showered arrows and thunderbolts on the enemy, so that, confused and blinded, they were thrown into disorder and cut to pieces.",
      "links": [
        "Ps 91:11",
        "Dan 6:22",
        "2 Kgs 6:17"
      ],
      "comment": "Supernatural protection of Maccabeus echoes biblical examples of deliverance (e.g., Daniel 6:22); miraculous intervention intensifies the narrative’s emphasis on God's active role."
    },
    {
      "pk": 21010031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 31,
      "text": "Twenty thousand five hundred were slaughtered, besides six hundred cavalry.",
      "links": [
        "2 Macc 8:30",
        "1 Sam 14:14",
        "Isa 37:36"
      ],
      "comment": "The enormous enemy casualty figures serve to underscore the scale of the victory and God’s supremacy in battle, following a common motif in holy war accounts (cf. Joshua 10:10-11)."
    },
    {
      "pk": 21010032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 32,
      "text": "Timothy himself fled to a stronghold called Gazara, especially well garrisoned, where Chaereas was commander.",
      "links": [
        "1 Macc 13:43",
        "1 Macc 5:8",
        "2 Sam 17:9"
      ],
      "comment": "Timothy’s flight to Gazara reflects the military realities of the period, where fortified cities served as last refuges for defeated commanders."
    },
    {
      "pk": 21010033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 33,
      "text": "Then Maccabeus and his men were glad, and they besieged the fort for four days.",
      "links": [
        "Josh 6:3-5",
        "Judg 7:15",
        "1 Macc 5:35"
      ],
      "comment": "The besieging of the fort and subsequent joy point to the restoration of Jewish control over the land and divine vindication."
    },
    {
      "pk": 21010034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 34,
      "text": "The men within, relying on the strength of the place, kept blaspheming terribly and uttering wicked words.",
      "links": [
        "2 Kgs 19:22",
        "Neh 9:18",
        "Rev 13:6"
      ],
      "comment": "The defenders’ blasphemies amplify their moral guilt, mirroring biblical themes where arrogance against God precedes judgment (cf. Isaiah 37:23-29)."
    },
    {
      "pk": 21010035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 35,
      "text": "But at dawn of the fifth day, twenty young men in the army of Maccabeus, fired with anger because of the blasphemies, bravely stormed the wall and with savage fury cut down everyone they met.",
      "links": [
        "Judg 7:19-22",
        "Ps 69:9",
        "1 Macc 5:34"
      ],
      "comment": "The zeal of the young warriors, provoked by blasphemy, aligns with narratives like Phinehas (Numbers 25:6-13) where righteous indignation leads to decisive judgment."
    },
    {
      "pk": 21010036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 36,
      "text": "Others who came up in the same way wheeled around against the defenders and set fire to the towers; they kindled fires and burned the blasphemers alive. Others broke open the gates and let in the rest of the force, and they occupied the city.",
      "links": [
        "Josh 6:24",
        "Num 16:35",
        "1 Macc 5:44"
      ],
      "comment": "The conquest is finalized with divine retribution against blasphemers, reinforcing the narrative theme that holiness necessitates the removal of profanation from the land (cf. Deuteronomy 9:5)."
    },
    {
      "pk": 21010037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 37,
      "text": "They killed Timothy, who was hiding in a cistern, and his brother Chaereas, and Apollophanes.",
      "links": [
        "Judg 7:25",
        "2 Macc 8:30",
        "Ps 92:7"
      ],
      "comment": "The deaths of Timothy and his commanders epitomize the fulfillment of judgment and signal the end of a major threat, affirming divine justice."
    },
    {
      "pk": 21010038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 10,
      "verse": 38,
      "text": "When they had accomplished these things, with hymns and thanksgivings they blessed the Lord who shows great kindness to Israel and gives them the victory.",
      "links": [
        "2 Macc 1:11",
        "Judg 5:1-3",
        "Ps 98:1"
      ],
      "comment": "Final thanksgiving and hymns reflect the liturgical response to God’s faithfulness in victory, paralleling Exodus 15 and Psalm 136."
    }
  ],
  "translatedAt": "2025-12-28T06:56:05.879Z"
}