{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 9,
  "sections": [
    {
      "title": "Jonathan Succeeds Judas",
      "startVerse": 30,
      "endVerse": 52
    },
    {
      "title": "The Persecution Intensifies and Jonathan is Raised Up",
      "startVerse": 53,
      "endVerse": 73
    }
  ],
  "verses": [
    {
      "pk": 20009001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 1,
      "text": "When Demetrius heard that Nicanor and his army had fallen in battle, he sent Bacchides and Alcimus again into the land of Judah, leading with them the right wing of his army.",
      "links": "<a href='/AIV/10/3/1-7'>2 Maccabees 14:1-2</a>",
      "comment": "Demetrius, king of the Seleucids, aims to complete the suppression of the Jewish revolt by sending two leaders—Bacchides, a military general, and Alcimus, a high priest aligned with foreign authorities. Their repeated intrusion reflects the persistent external threats to God's people."
    },
    {
      "pk": 20009002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 2,
      "text": "They traveled by the road that leads to Gilgal and set up camp against Mesaloth in Arbela. They seized it and killed many people.",
      "links": "<a href='/AIV/6/4/19'>Joshua 4:19</a>",
      "comment": "The violence at Mesaloth highlights the severity of the occupation, reminiscent of earlier times when the land faced invasions. Notice the persistent theme of testing and purification of Israel through trial."
    },
    {
      "pk": 20009003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 3,
      "text": "In the first month of the one hundred and fifty-second year, they pitched their camp near Jerusalem.",
      "links": "<a href='/AIV/17/1/1'>Esther 1:1</a>",
      "comment": "The reference to the 'first month' echoes important feasts like Passover; timing often reveals spiritual meaning in scripture."
    },
    {
      "pk": 20009004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 4,
      "text": "Then they marched out and went to Berea with twenty thousand foot soldiers and two thousand cavalry.",
      "links": "<a href='/AIV/9/13/1'>1 Samuel 13:1-2</a>",
      "comment": "The scale of this military force underscores the overwhelming physical danger facing the small faithful remnant."
    },
    {
      "pk": 20009005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 5,
      "text": "Judas camped at Elasa with three thousand men. But there were not enough provisions for them.",
      "links": "<a href='/AIV/7/7/6-8'>Judges 7:6-8</a>",
      "comment": "Judas Maccabeus, facing impossible odds, mirrors Israel’s previous experiences where faith must replace purely human strength (<a href='/AIV/7/7/6-8'>Judges 7:6-8</a>). Trust in God’s provision reappears as a theme."
    },
    {
      "pk": 20009006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 6,
      "text": "When they saw the great size of their enemy’s army, many were terrified and slipped away from the camp; only eight hundred men remained.",
      "links": "<a href='/AIV/7/7/3'>Judges 7:3</a>",
      "comment": "Fear and abandonment reduce the number further, echoing the remnant motif: only a small, faithful group stands with God's leader."
    },
    {
      "pk": 20009007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 7,
      "text": "When Judas saw that his army had slipped away and that the battle pressed upon him, he was greatly distressed for he had no strength to withstand them.",
      "links": "<a href='/AIV/19/142/6'>Psalm 142:6</a>",
      "comment": "Judas' distress is an honest picture of true leadership facing defeat. The psalms often describe such moments that call for reliance on divine help."
    },
    {
      "pk": 20009008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 8,
      "text": "But he said to those who remained, 'Let us get up and go up against our enemies. Perhaps we will be able to fight against them.'",
      "links": "<a href='/AIV/6/10/25'>Joshua 10:25</a>",
      "comment": "Judas chooses courage even when success seems impossible, exemplifying hope and valor that inspire spiritual leadership."
    },
    {
      "pk": 20009009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 9,
      "text": "But they tried to dissuade him, saying, 'We do not have the strength; let us rather save our lives now and come back with our brothers to fight later. But now we are too few.'",
      "links": "<a href='/AIV/11/19/3'>1 Kings 19:3</a>",
      "comment": "The disciples' hesitation mirrors the tendency to rely on numbers over faith. There are times for withdrawal, but also times when God calls for sacrificial action—even to the point of laying down one's life, echoing the pattern Christ will fulfill."
    },
    {
      "pk": 20009010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 10,
      "text": "But Judas replied, 'Far be it from us to do such a thing as to flee from them! If our time has come, let us die bravely for our kindred and not leave a cause for reproach against our glory.'",
      "links": "<a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Judas' willingness to die for his people prefigures the greatest expression of love: to lay down one's life for others, as later revealed perfectly in Christ (<a href='/AIV/43/15/13'>John 15:13</a>)."
    },
    {
      "pk": 20009011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 11,
      "text": "Then the army marched out from the camp and formed ranks to meet them. The cavalry was divided into two divisions, and the slingers and archers went ahead of the army, followed by all the mighty warriors.",
      "links": "<a href='/AIV/9/17/47-50'>1 Samuel 17:47-50</a>",
      "comment": "An organized enemy with archers and cavalry. The contrast between the sizes and equipment of the two sides brings to mind David and Goliath: true victory depends on God, not human power."
    },
    {
      "pk": 20009012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 12,
      "text": "Bacchides was on the right wing. The phalanx advanced in both directions, and they sounded the trumpets.",
      "links": "<a href='/AIV/4/10/9'>Numbers 10:9</a>",
      "comment": "Trumpets signal battle but were also God’s call for His people in the Torah. The faithfulness of the remnant is underlined, contrasted with the powerful army led by Bacchides."
    },
    {
      "pk": 20009013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 13,
      "text": "The men with Judas also sounded their trumpets, and the earth shook with the noise of the armies. The battle raged from morning till evening.",
      "links": "<a href='/AIV/2/19/18'>Exodus 19:18</a>",
      "comment": "The shaking earth and battle noise recall God’s presence at Sinai. Dramatic spiritual realities often accompany Israel’s decisive moments."
    },
    {
      "pk": 20009014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 14,
      "text": "Judas saw that Bacchides and the strongest force was on the right. With his heart fully brave, he gathered together all the bravest men",
      "links": "<a href='/AIV/6/1/6'>Joshua 1:6</a>",
      "comment": "Judas rallies his best men for a decisive clash, reminiscent of Joshua’s courage in leading Israel."
    },
    {
      "pk": 20009015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 15,
      "text": "and they attacked the right flank, and broke it. They pursued them as far as Mount Azotus.",
      "links": "<a href='/AIV/9/14/45'>1 Samuel 14:45</a>",
      "comment": "A surprising victory in a single sector shows the effect a small faithful group, trusting in God, can have."
    },
    {
      "pk": 20009016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 16,
      "text": "But those on the left wing saw that the right wing was shattered, and they turned around to follow behind Judas and his men.",
      "links": "<a href='/AIV/7/20/42-43'>Judges 20:42-43</a>",
      "comment": "Being surrounded is a deadly military position—often a consequence when courage breaks the enemy but full escape is not possible."
    },
    {
      "pk": 20009017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 17,
      "text": "So the battle intensified, and many fell on both sides.",
      "links": "<a href='/AIV/13/20/4'>2 Samuel 20:4-10</a>",
      "comment": "The high human cost demonstrates the tragic results of division and warfare within God's people. Peace is always to be desired, but faithfulness to the covenant may at times require resistance."
    },
    {
      "pk": 20009018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 18,
      "text": "Judas also fell, and the rest fled.",
      "links": "<a href='/AIV/10/1/19'>2 Samuel 1:19</a>",
      "comment": "The death of Judas is an end to an era. Like other great deliverers of Israel, his death shows that earthly leaders ultimately pass on, prefiguring the need for a greater, eternal deliverer."
    },
    {
      "pk": 20009019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 19,
      "text": "Jonathan and Simon took up the body of their brother Judas and buried him in the tomb of their ancestors at Modein.",
      "links": "<a href='/AIV/1/23/20'>Genesis 23:20</a>",
      "comment": "Burying the dead with honor is a hallmark of biblical piety, reminiscent of Sarah’s burial in Genesis. The continuity of the faith of the fathers is seen here."
    },
    {
      "pk": 20009020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 20,
      "text": "And all Israel mourned for him with great lamentation; they mourned for him many days, saying,",
      "links": "<a href='/AIV/10/1/12'>2 Samuel 1:12</a>",
      "comment": "Public mourning for a righteous leader continues an Old Testament pattern, showing the importance of leadership and the communal nature of grief."
    },
    {
      "pk": 20009021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 21,
      "text": "'How is the champion of Israel fallen!'",
      "links": "<a href='/AIV/10/1/19'>2 Samuel 1:19</a>",
      "comment": "Echoes David’s lament over Saul and Jonathan, showing that God’s people recognize the price of sacrifice and the pain of loss."
    },
    {
      "pk": 20009022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 22,
      "text": "The rest of the acts of Judas, his wars, the brave deeds he performed, and his greatness are not written, because they were very many.",
      "links": "<a href='/AIV/11/14/19-20'>1 Kings 14:19-20</a>",
      "comment": "A literary formula common in the Old Testament closes the hero’s story, hinting at a vast legacy. Only the most significant works can be recorded, but the fuller story is hidden, as is often true with the saints."
    },
    {
      "pk": 20009023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 23,
      "text": "After Judas died, those who broke the law began to emerge everywhere in Israel, and all those who did injustice raised their heads.",
      "links": "<a href='/AIV/19/12/8'>Psalm 12:8</a>",
      "comment": "With the loss of righteous leadership, wickedness increases—a clear spiritual lesson: the people need constant, visible leadership to keep the faith."
    },
    {
      "pk": 20009024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 24,
      "text": "At that time, there was a great famine, and the country went over to their side.",
      "links": "<a href='/AIV/8/1/1'>Ruth 1:1</a>",
      "comment": "Famine often accompanies covenant unfaithfulness in the Old Testament, serving as a sign of God’s call to repentance."
    },
    {
      "pk": 20009025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 25,
      "text": "Then Bacchides chose the ungodly men and made them lords of the land.",
      "links": "<a href='/AIV/19/12/8'>Psalm 12:8</a>",
      "comment": "Those who do evil are raised in authority, fulfilling the principle that society reflects the kind of leaders it chooses to follow."
    },
    {
      "pk": 20009026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 26,
      "text": "These men searched for and hunted the friends of Judas, bringing them to Bacchides, who took vengeance on them and mocked them.",
      "links": "<a href='/AIV/42/22/63-65'>Luke 22:63-65</a>",
      "comment": "The persecution of Judas’ followers parallels later persecutions of Jesus and his disciples. Faithful endurance in suffering is a key theme in both Old and New Testament witness."
    },
    {
      "pk": 20009027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 27,
      "text": "There was great tribulation in Israel such as had not been since the time when prophets ceased to appear among them.",
      "links": "<a href='/AIV/30/8/11'>Amos 8:11</a>",
      "comment": "The loss of prophecy marks a spiritually dark period. The people mourn the silence from God—the longing for prophetic, authoritative direction is clear, foreshadowing the hunger for the coming Anointed One."
    },
    {
      "pk": 20009028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 28,
      "text": "Then all of the friends of Judas gathered together and said to Jonathan,",
      "links": "<a href='/AIV/10/20/17'>2 Samuel 20:17</a>",
      "comment": "Jonathan steps into leadership as the Maccabean succession continues, affirming the biblical model of visible and continuous headship among God's people."
    },
    {
      "pk": 20009029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 29,
      "text": "'Since your brother Judas died, there is no one like him to go out against our enemies—against Bacchides and those hostile to our nation.'",
      "links": "<a href='/AIV/7/2/7-8'>Judges 2:7-8</a>",
      "comment": "Israel’s need for an enduring leader is clear. The spiritual and practical need for united, visible leadership is affirmed."
    },
    {
      "pk": 20009030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 30,
      "text": "'Now therefore we have chosen you today to be our leader and ruler in place of Judas your brother, to fight our battle.'",
      "links": "<a href='/AIV/4/27/18-23'>Numbers 27:18-23</a>",
      "comment": "The election of Jonathan echoes the appointment of Joshua after Moses, reinforcing the biblical principle of authoritative succession and collective assent under God’s guidance.",
      "sectionHeader": "Jonathan Succeeds Judas"
    },
    {
      "pk": 20009031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 31,
      "text": "So Jonathan accepted the leadership at that time and rose to take his brother’s place.",
      "links": "<a href='/AIV/4/27/22'>Numbers 27:22</a>",
      "comment": "The theme of legitimate succession continues, a persistent mark of the people of God."
    },
    {
      "pk": 20009032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 32,
      "text": "Bacchides learned that Jonathan had become leader and was preparing to fight him.",
      "links": "<a href='/AIV/9/18/6-9'>1 Samuel 18:6-9</a>",
      "comment": "Threats to faithful leadership always arise, as Satan seeks to destroy the line from which the Messiah will come and the order of the community entrusted with God's promises."
    },
    {
      "pk": 20009033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 33,
      "text": "Jonathan, his brother Simon, and all who were with him established themselves in the desert of Tekoa and camped by the water of the pool of Asphar.",
      "links": "<a href='/AIV/10/23/14'>2 Samuel 23:14</a>",
      "comment": "Retreating to the wilderness is a time-honored Biblical theme, often the place where God prepares leaders and manifests His will (see <a href='/AIV/40/4/1'>Matthew 4:1</a> and Moses in Exodus)."
    },
    {
      "pk": 20009034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 34,
      "text": "Bacchides heard of it on the Sabbath, and he came with all his army across the Jordan.",
      "links": "<a href='/AIV/6/3/15-17'>Joshua 3:15-17</a>",
      "comment": "The enemy attacking on the Sabbath demonstrates the disregard for the holiness of God's law, intensifying the meaning of the conflict."
    },
    {
      "pk": 20009035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 35,
      "text": "Jonathan sent his brother as leader of the multitude, and he begged the Nabateans, his friends, for permission to leave their baggage with them.",
      "links": "<a href='/AIV/1/37/25'>Genesis 37:25-28</a>",
      "comment": "Jonathan shows diplomatic wisdom, reminding readers of the necessity of prudent alliances in the service of God’s mission."
    },
    {
      "pk": 20009036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 36,
      "text": "But the descendants of Jambri from Medeba came out and seized John and all that he had, and went away with it.",
      "links": "<a href='/AIV/7/18/22'>Judges 18:22</a>",
      "comment": "Even trusted neighbors can fail; watchfulness is necessary for those entrusted with the people and goods of God."
    },
    {
      "pk": 20009037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 37,
      "text": "After these things it was reported to Jonathan and Simon, 'The descendants of Jambri are celebrating a grand wedding, and bringing the bride, a daughter of one of the great nobles of Canaan, from Nadabath with a large procession.'",
      "links": "<a href='/AIV/1/34/25'>Genesis 34:25</a>",
      "comment": "A traditional wedding becomes an occasion for retribution in response to injustice."
    },
    {
      "pk": 20009038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 38,
      "text": "They remembered the blood of their brother John and went up and hid themselves under the cover of the mountain.",
      "links": "<a href='/AIV/1/34/25-27'>Genesis 34:25-27</a>",
      "comment": "Justice is pursued for the sake of blood wrongly shed, in harmony with the ancient law, though it always anticipates the higher justice and mercy brought with Christ."
    },
    {
      "pk": 20009039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 39,
      "text": "As they looked up, they saw a great crowd with much baggage; the bridegroom and his friends were coming out to meet them with drums, musicians, and many weapons.",
      "links": "<a href='/AIV/19/45/14-15'>Psalm 45:14-15</a>",
      "comment": "The combination of festivity and weapons demonstrates both the celebration of life and the tension of a land at war."
    },
    {
      "pk": 20009040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 40,
      "text": "They rushed down upon them from their hiding places and struck them down. Many were killed, and the rest fled into the mountains. They took all the spoils.",
      "links": "<a href='/AIV/6/8/24-25'>Joshua 8:24-25</a>",
      "comment": "Divinely-allowed retribution at a wedding feast is a reminder of Old Testament justice. However, the turning of mourning into joy or joy into mourning often acts as a sign for deeper spiritual realities completed in the coming Kingdom."
    },
    {
      "pk": 20009041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 41,
      "text": "So the wedding was turned into mourning and the voice of their musicians into a funeral dirge.",
      "links": "<a href='/AIV/19/79/8'>Psalm 79:8</a>",
      "comment": "The text highlights national sorrow after military defeat, echoing lament psalms for Israel’s suffering."
    },
    {
      "pk": 20009042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 42,
      "text": "After they had fully avenged the blood of their brother, they returned to the marshes of the Jordan.",
      "links": "<a href='/AIV/10/1/11-12'>2 Samuel 1:11-12</a>",
      "comment": "National mourning for fallen leaders shows the unity of God's people in suffering, prefiguring later Christian concern for the suffering members of Christ’s Body (<a href='/AIV/46/12/26'>1 Corinthians 12:26</a>)."
    },
    {
      "pk": 20009043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 43,
      "text": "When Bacchides heard of this, he came with a large force on the sabbath day to the banks of the Jordan.",
      "links": "<a href='/AIV/19/83/4'>Psalm 83:4</a>",
      "comment": "The enemies' desire to erase Israel echoes Psalm 83:4, reflecting the age-old spiritual battle against God’s chosen people."
    },
    {
      "pk": 20009044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 44,
      "text": "And Jonathan said to those with him, “Let us get up now and fight for our lives, for today things are not as they were before.”",
      "links": "<a href='/AIV/1/50/13'>Genesis 50:13</a>",
      "comment": "The gathering and burial of the dead at Modin reflect the Jewish emphasis on honoring the departed, a practice later to be seen in Christian tradition respecting the saints’ remains."
    },
    {
      "pk": 20009045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 45,
      "text": "For look! the battle is in front of us and behind us; the water of the Jordan is on this side and on that, with marsh and thicket; there is no place to turn.",
      "links": "<a href='/AIV/10/1/17'>2 Samuel 1:17</a>",
      "comment": "Extended mourning was a traditional expression of grief, also pointing ahead to communal prayers for the dead in later Christian customs."
    },
    {
      "pk": 20009046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 46,
      "text": "Cry out now to Heaven that you may be delivered from the hands of our enemies.”",
      "links": "<a href='/AIV/10/1/19'>2 Samuel 1:19</a>",
      "comment": "Echoes the lament for Saul and Jonathan, highlighting the theme of fallen deliverers, paralleling Christ’s seeming defeat on the cross, which later became victory."
    },
    {
      "pk": 20009047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 47,
      "text": "So the battle began, and Jonathan stretched out his hand to strike Bacchides, but he eluded him and went to the rear.",
      "links": "<a href='/AIV/9/4/1'>1 Samuel 4:1-10</a>",
      "comment": "Israel seeking refuge among the Philistines recalls ancient migrations in time of defeat, yet God preserves a remnant for His purposes."
    },
    {
      "pk": 20009048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 48,
      "text": "Then Jonathan and the men with him leaped into the Jordan and swam across to the other side, and the enemy did not cross the Jordan to attack them.",
      "links": "<a href='/AIV/2/20/10'>Exodus 20:10</a>",
      "comment": "Killing on the Sabbath violated the sanctity of the day, intensifying the grief. This attack on a holy day would fuel deeper resolve to guard God’s commandments."
    },
    {
      "pk": 20009049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 49,
      "text": "And about one thousand of Bacchides’ men fell that day.",
      "links": "<a href='/AIV/19/74/3-7'>Psalm 74:3-7</a>",
      "comment": "Defilement and fortifying the land against the Jews showed opposition to God's people; spiritually, it foreshadows attacks on the sanctity of God’s dwelling among His people."
    },
    {
      "pk": 20009050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 50,
      "text": "Then Bacchides returned to Jerusalem and built strong cities in Judea: the fortress in Jericho, and Emmaus, and Beth-horon, and Bethel, and Timnath, and Pharathon, and Tephon, with high walls and gates and bars.",
      "links": "<a href='/AIV/6/15/60'>Joshua 15:60</a>",
      "comment": "The occupation of key Judean cities was meant to subjugate Israel; symbolically, these attacks anticipate later trials on the Church, necessitating perseverance."
    },
    {
      "pk": 20009051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 51,
      "text": "And he placed garrisons in them to harass Israel.",
      "links": "<a href='/AIV/19/94/20'>Psalm 94:20</a>",
      "comment": "The phrase 'sons of lawless men' points to those who betray their people for personal gain—a warning against those who divide the faithful from within."
    },
    {
      "pk": 20009052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 52,
      "text": "He also fortified the town of Beth-zur, and Gazara, and the citadel, and in them he put troops and stores of food.",
      "links": "<a href='/AIV/19/79/11'>Psalm 79:11</a>",
      "comment": "Taking the leaders captive is a tactic to break the spirit of the people, yet God often raises unexpected leaders to restore hope, as He would do with Jonathan."
    },
    {
      "pk": 20009053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 53,
      "text": "And he took the sons of the leading men of the land as hostages and put them under guard in the citadel at Jerusalem.",
      "links": "<a href='/AIV/15/5/8'>Ezra 5:8</a>",
      "comment": "Attempts to destroy the sanctuary’s walls attack not just a building, but the continuity of worship and prophecy—parallels the spiritual assaults on the practice and purity of worship in the Church era.",
      "sectionHeader": "The Persecution Intensifies and Jonathan is Raised Up"
    },
    {
      "pk": 20009054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 54,
      "text": "Then Alcimus was stricken, and his work was hindered. He was paralyzed, his mouth was stopped, and he could no longer speak, nor could he give orders about his house.",
      "links": "<a href='/AIV/4/12/10'>Numbers 12:10</a>",
      "comment": "Divine judgment befalls Alcimus, reminiscent of Old Testament examples where God strikes leaders who oppose His people, affirming God’s direct intervention in history."
    },
    {
      "pk": 20009055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 55,
      "text": "Alcimus died in great agony.",
      "links": "<a href='/AIV/4/16/35'>Numbers 16:35</a>",
      "comment": "The death of Alcimus is a sign of God's judgment on those who destroy His sanctuary; spiritual readiness for death remains a key theme in Christian piety."
    },
    {
      "pk": 20009056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 56,
      "text": "When Bacchides saw that Alcimus was dead, he returned to the king. And Judea was peaceful for two years.",
      "links": "<a href='/AIV/7/3/11'>Judges 3:11</a>",
      "comment": "Short periods of peace often follow judgment, giving God's people a time for restoration—foreshadowing Sabbath rests amid tribulation."
    },
    {
      "pk": 20009057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 57,
      "text": "But the lawless plotted together, saying, “See, Jonathan and his followers live at ease and are secure. Let us bring Bacchides back so he will capture them all in one night.”",
      "links": "<a href='/AIV/19/2/1'>Psalm 2:1</a>",
      "comment": "Plots against God’s anointed servants continue, recalling messianic opposition throughout Scripture; God’s ultimate plan prevails despite human schemes."
    },
    {
      "pk": 20009058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 58,
      "text": "So they went and consulted with him. And he moved with his army and camped near Bethbasi in the plain.",
      "links": "<a href='/AIV/19/3/1-2'>Psalm 3:1-2</a>",
      "comment": "Surrounding army foreshadows the ever-present temptation and attack against the faithful; dependence on God’s deliverance is vital."
    },
    {
      "pk": 20009059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 59,
      "text": "Jonathan sent his brother as leader of the multitude and asked the Nabateans, his friends, if they would store his equipment, which was many.",
      "links": "<a href='/AIV/1/14/1'>Genesis 14:1-7</a>",
      "comment": "Seeking allies and safe-keeping of resources emphasizes prudent leadership, the wisdom of seeking relationships for mutual support—prefiguring intercession and reliance on the broader family of faith."
    },
    {
      "pk": 20009060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 60,
      "text": "Yet the sons of Jambri came out from Medeba and captured John and everything he had, and departed with it.",
      "links": "<a href='/AIV/6/13/9'>Joshua 13:9</a>",
      "comment": "Loss and betrayal even by those nearby; such adversity refines faith and builds perseverance (see <a href='/AIV/59/1/2-4'>James 1:2-4</a>)."
    },
    {
      "pk": 20009061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 61,
      "text": "After these events it was reported to Jonathan and his brother Simon that the sons of Jambri were holding a great wedding, and were bringing the bride, the daughter of one of the great princes of Canaan, with much procession from Nadabath.",
      "links": "<a href='/AIV/1/34/29'>Genesis 34:29</a>",
      "comment": "The gathering for a wedding becomes an opportunity for retribution, but also hints at the theme of the bride—echoing nuptial images present throughout the Old and New Testaments (see <a href='/AIV/66/19/7-9'>Revelation 19:7-9</a>)."
    },
    {
      "pk": 20009062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 62,
      "text": "So they remembered the blood of John their brother, and went up and hid themselves under the cover of the mountain.",
      "links": "<a href='/AIV/1/27/41'>Genesis 27:41</a>",
      "comment": "Blood vengeance—while characteristic of the Old Testament—later finds its fulfillment in Christ’s teaching on mercy and forgiveness (see <a href='/AIV/40/5/44'>Matthew 5:44</a>)."
    },
    {
      "pk": 20009063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 63,
      "text": "They raised their eyes and saw a noisy procession, with much baggage; the bridegroom and his friends and brothers coming with drums and musicians and many weapons.",
      "links": "<a href='/AIV/19/45/8-15'>Psalm 45:8-15</a>",
      "comment": "The wedding journey showcases celebration amid enmity, evoking contrasting themes of festivity and impending justice."
    },
    {
      "pk": 20009064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 64,
      "text": "Then Jonathan and those in ambush rose up against them, and killed many. The rest fled into the mountains, and they took all their spoils.",
      "links": "<a href='/AIV/7/18/27'>Judges 18:27</a>",
      "comment": "Divine justice is executed, but deeper spiritual sense points to God defending His people when they are wronged."
    },
    {
      "pk": 20009065,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 65,
      "text": "So the wedding ended in mourning and the music turned into lamentation.",
      "links": "<a href='/AIV/24/7/34'>Jeremiah 7:34</a>",
      "comment": "The reversal of joy into sorrow illustrates how sin and violence corrupt what should be good, underscoring the biblical theme that only God ultimately turns mourning into joy (<a href='/AIV/19/30/11'>Psalm 30:11</a>)."
    },
    {
      "pk": 20009066,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 66,
      "text": "Afterwards, they avenged the blood of their brother, and returned to the river Jordan.",
      "links": "<a href='/AIV/6/4/19'>Joshua 4:19</a>",
      "comment": "Justice sought by Jonathan and Simon demonstrates both the ancient customs and the longing for ultimate divine justice fulfilled in the coming Messiah."
    },
    {
      "pk": 20009067,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 67,
      "text": "But Bacchides heard of it, and he assembled a large army and gathered his allies from across the Jordan.",
      "links": "<a href='/AIV/7/6/33'>Judges 6:33</a>",
      "comment": "Enemies regroup after setbacks; the pattern of opposition and counter-moves recurs, but God's providence governs the outcome."
    },
    {
      "pk": 20009068,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 68,
      "text": "Jonathan sent his brother Simon to the people who live in the country of the Nabateans, to ask for their help for the defense of his friends.",
      "links": "<a href='/AIV/1/14/13'>Genesis 14:13</a>",
      "comment": "Seeking alliances shows prudent stewardship and themes of fraternity, later found in the workings of the universal Church."
    },
    {
      "pk": 20009069,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 69,
      "text": "But Bacchides left a detachment at Bethbasi. They fought against Jonathan several days.",
      "links": "<a href='/AIV/7/20/15-17'>Judges 20:15-17</a>",
      "comment": "Enduring hostility requires perseverance in the faith, a virtue highly esteemed in Christian tradition."
    },
    {
      "pk": 20009070,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 70,
      "text": "He secretly sent word to his allies, asking them to seize Jonathan and his companions. But they failed, because their plan was discovered.",
      "links": "<a href='/AIV/16/6/12'>Nehemiah 6:12-14</a>",
      "comment": "God’s providence thwarts the plots of the cunning, echoing the Psalmist’s confidence in deliverance from schemes (<a href='/AIV/19/33/10'>Psalm 33:10</a>)."
    },
    {
      "pk": 20009071,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 71,
      "text": "Instead, they even caught some leaders of the plot and killed them.",
      "links": "<a href='/AIV/16/6/16'>Nehemiah 6:16</a>",
      "comment": "Those who plot against the righteous ultimately face the consequences; justice is a recurring aspect of both Old Testament and Christian ethics."
    },
    {
      "pk": 20009072,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 72,
      "text": "Then Jonathan, Simon, and their men took up residence in Bethbasi in the desert; they repaired the breaches in that place and fortified it.",
      "links": "<a href='/AIV/16/4/7'>Nehemiah 4:7</a>",
      "comment": "Rebuilding and fortifying points to the faithfulness in adversity; repairing breaches is both a physical and spiritual metaphor for restoring unity and integrity."
    },
    {
      "pk": 20009073,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 9,
      "verse": 73,
      "text": "Bacchides, seeing that his plans had failed, withdrew to his own land. He did not return again to Judea.",
      "links": "<a href='/AIV/2/14/30'>Exodus 14:30'>Exodus 14:30</a>",
      "comment": "God’s providence delivers His people, just as He delivered Israel at the Red Sea. Implicitly, this points toward Christ’s ultimate victory over evil and the security of His Church, infallibly protected through adversity."
    }
  ],
  "translatedAt": "2025-12-29T00:38:21.125Z"
}