{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 5,
  "sections": [
    {
      "title": "Wars Against Hostile Neighbors",
      "startVerse": 1,
      "endVerse": 57
    },
    {
      "title": "Cleansing and Rededication of the Sanctuary",
      "startVerse": 58,
      "endVerse": 66
    },
    {
      "title": "Return in Triumph and Thanksgiving",
      "startVerse": 67,
      "endVerse": 67
    },
    {
      "title": "Israel’s Peace and Restoration",
      "startVerse": 68,
      "endVerse": 68
    }
  ],
  "verses": [
    {
      "pk": 20005001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 1,
      "text": "When the surrounding nations heard that the altar had been rebuilt and the sanctuary dedicated as it was before, they were greatly angered.",
      "links": "<a href='/AIV/20/4/46-59'>1 Maccabees 4:46-59</a>",
      "comment": "The re-dedication of the altar is a focal point showing how acts of public worship can provoke hostility among those opposed to God's people. This theme recurs throughout salvation history, as seen with opposition during the time of Ezra and Nehemiah (<a href='/AIV/15/4/1-5'>Ezra 4:1-5</a>).",
      "sectionHeader": "Wars Against Hostile Neighbors"
    },
    {
      "pk": 20005002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 2,
      "text": "They plotted together to destroy the descendants of Jacob who lived among them; so they began to kill and expel the people.",
      "links": "<a href='/AIV/1/27/41-46'>Genesis 27:41-46</a>",
      "comment": "The language recalls ancient hostility against the descendants of Jacob (Israel), emphasizing the continual struggle experienced by the chosen people."
    },
    {
      "pk": 20005003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 3,
      "text": "Then Judas fought against the descendants of Esau in Idumea, at Akrabattene, because they were besieging Israel. He defeated them greatly, humbled them, and took their spoils.",
      "links": "<a href='/AIV/13/21/12-15'>1 Chronicles 21:12-15</a> <a href='/AIV/1/36/8'>Genesis 36:8</a>",
      "comment": "Here, Judas' victory over the Edomites (descendants of Esau) echoes earlier victories of Israel over perennial enemies. Spoils taken from battle also resemble the practice after the conquest of Jericho (<a href='/AIV/6/6/20-21'>Joshua 6:20-21</a>)."
    },
    {
      "pk": 20005004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 4,
      "text": "He also remembered the wickedness of the sons of Baean, who had become a snare and trap to the people by ambushing them along the roads.",
      "links": "<a href='/AIV/19/140/1'>Psalm 140:1</a>",
      "comment": "The term 'snare' is commonly used in the Psalms to describe spiritual danger and the allure of evil. Here, it describes literal ambush, but also hints at the persistent reality of threat from within and without."
    },
    {
      "pk": 20005005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 5,
      "text": "He forced them to take refuge in towers and besieged them; he destroyed them all and burned down their towers with fire, along with everyone inside.",
      "links": "<a href='/AIV/7/9/46-49'>Judges 9:46-49</a>",
      "comment": "Judas' actions are reminiscent of past judgments where refuge in towers could not save the wicked, symbolizing the futility of seeking security apart from God."
    },
    {
      "pk": 20005006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 6,
      "text": "Then he moved against the Ammonites, and found a strong army and many people led by Timotheus.",
      "links": "<a href='/AIV/7/10/7-9'>Judges 10:7-9</a>",
      "comment": "The Ammonites were another traditional enemy of Israel. The reference to Timotheus here is likely to the Seleucid general, reflecting Hellenistic opposition."
    },
    {
      "pk": 20005007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 7,
      "text": "He fought many battles with them, defeated them, and struck them down.",
      "links": "<a href='/AIV/11/18/40'>1 Kings 18:40</a>",
      "comment": "The summary nature of this victory echoes scriptural patterns where God's servants gain victory over humanly impossible odds, encouraging believers in the power of God's assistance."
    },
    {
      "pk": 20005008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 8,
      "text": "He captured Jazer and its surrounding villages, and returned to Judea.",
      "links": "<a href='/AIV/6/21/39'>Joshua 21:39</a>",
      "comment": "The places mentioned are ancient, indicating continuous connection to earlier biblical stories and lines."
    },
    {
      "pk": 20005009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 9,
      "text": "Now the Gentiles in Gilead gathered together against the Israelites who lived in their territory, planning to destroy them. But the Israelites fled to the stronghold of Dathema.",
      "links": [
        "Judg 10:8",
        "Josh 13:31",
        "2 Macc 12:17"
      ],
      "comment": "The Israelites in Gilead faced existential threat from their Gentile neighbors, reflecting the pattern of persecution and flight seen throughout Jewish history (cf. Judges 10:8-9); Dathema served as a fortified refuge in times of crisis."
    },
    {
      "pk": 20005010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 10,
      "text": "They sent a letter to Judas and his brothers, saying, \"The Gentiles around us have gathered together to destroy us.\"",
      "links": [
        "Neh 4:9",
        "Esth 3:6",
        "1 Sam 11:3"
      ],
      "comment": "The urgent appeal to Judas and his brothers highlights the nascent leadership role of the Hasmoneans and the unity required among Jewish communities in the diaspora during the Maccabean revolt."
    },
    {
      "pk": 20005011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 11,
      "text": "\"They are preparing to come and capture the stronghold to which we have fled, and Timothy is leading their forces.\"",
      "links": [
        "2 Macc 8:32",
        "2 Macc 10:24",
        "Judg 3:15"
      ],
      "comment": "Timothy, a Seleucid military leader, orchestrates a coordinated attack, underlining the organized opposition faced by the Jews and the recurring motif of foreign commanders in the Maccabean narrative."
    },
    {
      "pk": 20005012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 12,
      "text": "\"Now then, come and rescue us from their hands, for many of us have fallen,\"",
      "links": [
        "Ps 18:17",
        "2 Cor 1:10",
        "Deut 22:27"
      ],
      "comment": "The plea for rescue underscores the desperate situation of Jewish enclaves outside Judah and reveals early reliance on Judas as a deliverer figure."
    },
    {
      "pk": 20005013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 13,
      "text": "\"and all our kindred who were in the land of Tob have been killed; the enemy have captured their wives and children and goods, and have destroyed about a thousand persons there.\"",
      "links": [
        "Judg 11:3",
        "2 Kgs 15:29",
        "Ps 44:22"
      ],
      "comment": "This lament over the destruction in Tob invokes collective mourning, emphasizing the cost of conflict and the vulnerability of scattered Jewish kin, echoing Deuteronomy 28:32-33."
    },
    {
      "pk": 20005014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 14,
      "text": "While the letter was still being read, other messengers, with their garments torn, arrived from Galilee, bringing a similar report of distress.",
      "links": "<a href='/AIV/9/20/1-3'>1 Samuel 20:1-3</a>",
      "comment": "Judas delegates responsibility according to ability, paralleling Biblical leadership structures and early Christian models of shared ministry."
    },
    {
      "pk": 20005015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 15,
      "text": "They said that the people of Ptolemais, Tyre, and Sidon, and all Galilee of the Gentiles had gathered together against them, saying, 'They are set to annihilate us.'",
      "links": "<a href='/AIV/16/7/2'>Nehemiah 7:2</a>",
      "comment": "Appointing leaders to specific roles for protection and governance is a mark of wise stewardship and anticipates organizational structures in later times."
    },
    {
      "pk": 20005016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 16,
      "text": "When Judas and the people heard these reports, a great assembly was called to consider what should be done for their kindred who were in trouble and being attacked by enemies.",
      "links": "<a href='/AIV/4/31/6'>Numbers 31:6</a>",
      "comment": "Note Judas' caution and reliance on authority; obedience to recognized leadership is vital for the unity and preservation of God's people."
    },
    {
      "pk": 20005017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 17,
      "text": "Then Judas said to his brother Simon, 'Choose your men and go and rescue your kindred in Galilee; my brother Jonathan and I will go to Gilead.'",
      "links": "<a href='/AIV/1/14/14'>Genesis 14:14</a>",
      "comment": "The small number prevailing over many is a recurring biblical motif, showing God's strength through faithfulness."
    },
    {
      "pk": 20005018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 18,
      "text": "He left Joseph, son of Zechariah, and Azariah, a leader of the people, with the rest of the forces in Judea to guard it;",
      "links": "<a href='/AIV/6/10/20'>Joshua 10:20</a>",
      "comment": "Taking spoils is often presented as reward for holy zeal, yet with important boundaries as later Christian tradition emphasizes charity and just conduct."
    },
    {
      "pk": 20005019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 19,
      "text": "and he gave them this command, 'Take charge of this people, but do not engage in battle with the Gentiles until we return.'",
      "links": "<a href='/AIV/2/12/35-36'>Exodus 12:35-36</a>",
      "comment": "The rescue of families and goods reflects deliverance traditions, echoing the Exodus, and foreshadowing rescue and restoration as spiritual realities."
    },
    {
      "pk": 20005020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 20,
      "text": "Three thousand men were assigned to Simon for the campaign in Galilee, and eight thousand to Judas for Gilead.",
      "links": "<a href='/AIV/6/3/1'>Joshua 3:1</a>",
      "comment": "Crossing rivers and passing through wilderness connects with biblical images of purification and preparation, seen both in Israel's journey and in the New Testament with John the Baptist (<a href='/AIV/40/3/1-6'>Matthew 3:1-6</a>)."
    },
    {
      "pk": 20005021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 21,
      "text": "Simon went to Galilee and fought many battles against the Gentiles, and the Gentiles were crushed before him.",
      "links": "<a href='/AIV/1/25/13-18'>Genesis 25:13-18</a>",
      "comment": "The mention of the Nabateans—descendants of Ishmael—shows that some Gentiles are not always enemies but sometimes serve as helpers, foreshadowing the universal mission to all nations."
    },
    {
      "pk": 20005022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 22,
      "text": "He pursued them to the gate of Ptolemais; about three thousand of the Gentiles fell, and he took their spoils.",
      "links": "<a href='/AIV/23/34/6'>Isaiah 34:6</a>",
      "comment": "Lists of towns emphasize the scope of opposition but also highlight God's power to deliver His people collectively."
    },
    {
      "pk": 20005023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 23,
      "text": "Then he brought the Jews of Galilee and Arbatta, along with their wives and children and all their possessions, and led them to Judea with great rejoicing.",
      "links": "<a href='/AIV/23/10/6-7'>Isaiah 10:6-7</a>",
      "comment": "The notion of destruction in a 'single day' underlines both the urgency and the miraculous deliverances God can provide, making room for spiritual interpretations of divine intervention."
    },
    {
      "pk": 20005024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 24,
      "text": "Judas and his army suddenly turned back into the wilderness, toward Bozrah, and captured the city. He killed every male by the sword, took all their spoils, and set fire to the city.",
      "links": "<a href='/AIV/6/6/24'>Joshua 6:24</a>",
      "comment": "These actions mirror Old Testament conquest accounts, reminding the reader of the severity of judgment upon those obstinately opposed to God's will."
    },
    {
      "pk": 20005025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 25,
      "text": "He left, by night, from there and headed toward the fortress. At dawn they looked up and saw a great multitude, unable to be counted, setting up ladders, engines, and scaling the fortress to destroy the people within.",
      "links": "<a href='/AIV/23/29/7-8'>Isaiah 29:7-8</a>",
      "comment": "Siege warfare and the imagery of countless multitudes draw the mind to spiritual battles faced by the faithful."
    },
    {
      "pk": 20005026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 26,
      "text": "Judas saw that the battle had begun and the outcry rose to the heavens. With trumpets and great shouting, he called upon heaven to help the people:",
      "links": "<a href='/AIV/2/14/15-16'>Exodus 14:15-16</a>",
      "comment": "Calling upon heaven in the midst of battle reminds us of the role of prayer and faith, especially when worldly strategies seem insufficient."
    },
    {
      "pk": 20005027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 27,
      "text": "'Blessed are You, our Savior, who crushed the armies by the hand of Your servant David and delivered the Philistine camp into the power of Jonathan, the son of Saul. Grant us also now deliverance by Your mighty hand.'",
      "links": "<a href='/AIV/9/17/49-50'>1 Samuel 17:49-50</a> <a href='/AIV/9/14/13-15'>1 Samuel 14:13-15</a>",
      "comment": "The prayer recalls past deliverances, connecting their present plight to the enduring faithfulness of God through history."
    },
    {
      "pk": 20005028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 28,
      "text": "Then those with Judas launched an attack from outside, and as the trumpets sounded, the armies of Timotheus were routed, and he fled towards the direction of the temple at Carnaim.",
      "links": "<a href='/AIV/7/7/19-21'>Judges 7:19-21</a>",
      "comment": "Retreat to a pagan temple in time of crisis highlights the ultimate impotence of idols, a frequent motif in both Old and New Testaments."
    },
    {
      "pk": 20005029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 29,
      "text": "But the Jews captured the city and burned the temple with all inside. Thus Carnaim was subdued, and they could no longer withstand Judas.",
      "links": "<a href='/AIV/7/6/25-28'>Judges 6:25-28</a>",
      "comment": "Destruction of idolatrous centers reinforces the exclusive worship owed to the one God, setting a prototype for later Christian insistence on the true Temple."
    },
    {
      "pk": 20005030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 30,
      "text": "Judas gathered all the Israelites who were in Gilead, from the smallest to the greatest, with their wives and children, and a great army to escort them to Judea.",
      "links": "<a href='/AIV/13/15/25-28'>1 Chronicles 15:25-28</a>",
      "comment": "The gathering ‘from the smallest to the greatest’ foreshadows Christ’s call to all, and the Church’s inclusivity, as foretold in the prophets."
    },
    {
      "pk": 20005031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 31,
      "text": "They reached Ephron, a large and strongly fortified city on their way. There was no way to turn aside either to the right or the left, but they had to go through.",
      "links": "<a href='/AIV/4/20/21'>Numbers 20:21</a>",
      "comment": "The necessity of passing through Ephron recalls Israel’s travels in Exodus and the need for perseverance when faced with obstacles."
    },
    {
      "pk": 20005032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 32,
      "text": "The inhabitants refused to let them pass, and blocked the gates with stones.",
      "links": "<a href='/AIV/6/6/1'>Joshua 6:1</a>",
      "comment": "Hostility and closed gates symbolize resistance to God’s people, a recurring theme culminating in Christ’s promise that the gates of hell would not prevail against His Church (<a href='/AIV/40/16/18'>Matthew 16:18</a>)."
    },
    {
      "pk": 20005033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 33,
      "text": "Judas sent them a peaceful request, but they refused.",
      "links": "<a href='/AIV/4/21/22-24'>Numbers 21:22-24</a>",
      "comment": "The attempt to negotiate peace before war models a just and merciful approach, paralleling Christian just war tradition."
    },
    {
      "pk": 20005034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 34,
      "text": "So Judas ordered a proclamation to be made throughout the army that everyone should lodge where they were.",
      "links": "<a href='/AIV/6/8/10'>Joshua 8:10</a>",
      "comment": "Organizational care and discipline in the camp were essential, reflecting the importance of order within God’s people."
    },
    {
      "pk": 20005035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 35,
      "text": "The soldiers prepared for battle, and Judas prayed and attacked the city by night. He captured it, killing every male by sword, destroyed it, took the spoils, and led all his people safely through.",
      "links": "<a href='/AIV/6/8/1-29'>Joshua 8:1-29</a>",
      "comment": "Judas' night attack and prayer prior to battle highlight a blending of faith and action that is continuously recommended throughout the Scriptures."
    },
    {
      "pk": 20005036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 36,
      "text": "They crossed the Jordan into the great plain opposite Beth-shan.",
      "links": "<a href='/AIV/9/31/10-12'>1 Samuel 31:10-12</a>",
      "comment": "Beth-shan is a site of both triumph and tragedy in Israel’s story—a reminder that God’s people are called to remember and redeem all that history holds."
    },
    {
      "pk": 20005037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 37,
      "text": "Judas was gathering the stragglers and encouraging the people all the way as they came to Judea.",
      "links": "<a href='/AIV/10/19/11-15'>2 Samuel 19:11-15</a>",
      "comment": "The image of a leader shepherding and encouraging the people reflects biblical shepherd imagery fulfilled in Christ, the Good Shepherd."
    },
    {
      "pk": 20005038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 38,
      "text": "They went up to Mount Zion with joy and gladness, offering burnt offerings because not one of them was lost in the journey.",
      "links": "<a href='/AIV/19/122/1-4'>Psalm 122:1-4</a> <a href='/AIV/43/17/12'>John 17:12</a>",
      "comment": "Rejoicing at not losing any matches Jesus’ words in John 17:12, 'none of those You gave me have I lost,' hinting at both preservation in faith and Christ’s care."
    },
    {
      "pk": 20005039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 39,
      "text": "They have also hired Arabs to help them, and they are encamped across the stream, ready to come and fight against you.\" So Judas went to meet them.",
      "links": "<a href='/AIV/9/14/47'>1 Samuel 14:47</a>",
      "comment": "The actions of leaders in the absence of the main army foreshadow later ecclesiastical tradition, where cooperation and humility among leaders are vital."
    },
    {
      "pk": 20005040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 40,
      "text": "Now as Judas and his army drew near to the stream of water, Timothy said to the officers of his forces, 'If he crosses over to us first, we will not be able to withstand him, for he will surely defeat us.'",
      "links": "<a href='/AIV/1/11/4'>Genesis 11:4</a>",
      "comment": "The motivation 'to make a name' is reminiscent of Babel (Genesis 11:4) and can be read as a warning against prideful ambition, pointing to God’s desire for faithfully humble leaders."
    },
    {
      "pk": 20005041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 41,
      "text": "\"But if he shows fear and camps on the other side of the river, we will cross over to him and defeat him.\"",
      "links": [
        "Josh 2:9",
        "Judg 7:10-11",
        "Deut 20:8"
      ],
      "comment": "The strategic assessment reflects ancient military tactics; the confidence expressed suggests reliance on courage and faith over numbers, a theme found in Judges 7 with Gideon's victory."
    },
    {
      "pk": 20005042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 42,
      "text": "When Judas approached the stream of water, he stationed the officers of the army at the stream and gave them this command: \"Permit no one to encamp, but make them all enter the battle.\"",
      "links": [
        "Ex 14:13",
        "Judg 7:18",
        "1 Sam 17:47"
      ],
      "comment": "Judas’s command for immediate engagement rather than encampment demonstrates both his bold leadership and the necessity of decisiveness for victory."
    },
    {
      "pk": 20005043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 43,
      "text": "Then he crossed over against them first, and the whole army followed him. All the Gentiles were defeated before him, and they threw away their arms and fled into the sacred precincts at Carnaim.",
      "links": [
        "Josh 10:10",
        "1 Sam 7:10-11",
        "2 Macc 12:21"
      ],
      "comment": "The rout of the Gentiles and Judas's personal lead into battle recall earlier Israelite victories attributed to divine favor and leader initiative, such as Joshua at Jericho."
    },
    {
      "pk": 20005044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 44,
      "text": "But he took the town and burned the sacred precincts with fire, together with all who were in them. Thus Carnaim was conquered; they could stand before Judas no longer.",
      "links": [
        "Deut 7:5",
        "Judg 6:25-28",
        "2 Kgs 10:27"
      ],
      "comment": "The burning of Carnaim’s sacred precincts signifies not only military triumph but also the symbolic destruction of idolatry, paralleling Deuteronomy 12:3's instructions to destroy pagan shrines."
    },
    {
      "pk": 20005045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 45,
      "text": "But the citizens of Ephron shut them out and blocked the gates with stones.",
      "links": "<a href='/AIV/19/118/19'>Psalm 118:19</a>",
      "comment": "The closed gates represent opposition to God's people, reminiscent of the siege of Jericho and Psalmist prayer for open gates of righteousness."
    },
    {
      "pk": 20005046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 46,
      "text": "Judas sent word to them with peaceable intentions, saying, 'Let us cross through your land to reach our own. No one will do you harm; we only want to pass through on foot.' But they would not open to him.",
      "links": "<a href='/AIV/4/20/17-18'>Numbers 20:17-18</a>",
      "comment": "Judas echoes Moses' request of Edom. The refusal is a historical motif of opposition to God's chosen, emphasizing both justice and patience."
    },
    {
      "pk": 20005047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 47,
      "text": "So Judas commanded it to be proclaimed throughout the army that each man should encamp where he was.",
      "links": "<a href='/AIV/7/6/11'>Judges 6:11</a>",
      "comment": "Judas shows restraint, seeking order before escalation. Obedience to the leader here is vital for their survival and unity."
    },
    {
      "pk": 20005048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 48,
      "text": "The men of the army took their positions, and Judas fought against the city all day and night, and it was delivered into his hands.",
      "links": "<a href='/AIV/6/6/20'>Joshua 6:20</a>",
      "comment": "The victory after patient striving mirrors Joshua’s conquest at Jericho—faith leading to decisive outcome."
    },
    {
      "pk": 20005049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 49,
      "text": "He destroyed all the males with the sword, razed the city, and took all its spoils. Then he passed through the city over the slain.",
      "links": "<a href='/AIV/7/15/33-34'>Judges 15:33-34</a>",
      "comment": "The destruction underscores total judgment, a recurring motif of God's justice, while the passage over the fallen is symbolic of victory and triumph."
    },
    {
      "pk": 20005050,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 50,
      "text": "Then they crossed the Jordan into the great plain near Beth-shan.",
      "links": "<a href='/AIV/6/17/11'>Joshua 17:11</a>",
      "comment": "Passing the Jordan is tied to Israel’s entry into promise, echoing themes of journey and restoration for the faithful."
    },
    {
      "pk": 20005051,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 51,
      "text": "Judas began gathering together all the stragglers, encouraging them and strengthening them, until they came to Judea rejoicing.",
      "links": "<a href='/AIV/23/35/10'>Isaiah 35:10</a>",
      "comment": "Encouragement and rejoicing upon return foreshadow messianic restoration and ultimate joy for the redeemed."
    },
    {
      "pk": 20005052,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 52,
      "text": "The journey home was blessed; no one fell or was lost among all the people whom he gathered out of Gilead and the territory of Israel.",
      "links": "<a href='/AIV/19/121/7-8'>Psalm 121:7-8</a>",
      "comment": "Not one lost reflects divine protection, echoing the Good Shepherd theme (cf. John 10:28) and spiritual security under faithful leadership."
    },
    {
      "pk": 20005053,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 53,
      "text": "Now Judas and Jonathan were in Galilee, and Simon his brother was in Galilee before them, fighting to deliver their people.",
      "links": "<a href='/AIV/43/2/1'>John 2:1</a>",
      "comment": "The involvement of multiple brothers in rescue is reminiscent of Christ’s sending of apostles throughout Israel, preparing for the fullness of deliverance."
    },
    {
      "pk": 20005054,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 54,
      "text": "Simon fought against the inhabitants of Ptolemais, and the citizens came out of the city against him with a great force.",
      "links": "<a href='/AIV/6/10/1'>Joshua 10:1</a>",
      "comment": "Opposition to the righteous by a ‘great force’ emphasizes the spiritual reality of conflict and the necessity of steadfast courage."
    },
    {
      "pk": 20005055,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 55,
      "text": "Simon and his men fought them, and he struck them with many wounds and pursued them to the gates.",
      "links": "<a href='/AIV/19/118/19-20'>Psalm 118:19-20</a>",
      "comment": "Pursuing to the gates again recalls the repeated Scripture theme of siege and salvation. Gates symbolize the threshold between oppression and freedom."
    },
    {
      "pk": 20005056,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 56,
      "text": "Many of them fell on that day, and Simon took the spoils from them.",
      "links": "<a href='/AIV/6/11/14'>Joshua 11:14</a>",
      "comment": "The spoils taken represent both material reward and the restoration of what was lost to God’s people."
    },
    {
      "pk": 20005057,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 57,
      "text": "So they said, \"Let us also make a name for ourselves; let us go and make war on the Gentiles around us.\"",
      "links": [
        "Gen 11:4",
        "2 Sam 8:13",
        "1 Macc 3:43"
      ],
      "comment": "This desire for renown reflects both human ambition and a lapse into self-reliance, contrasting with earlier reliance on God's deliverance."
    },
    {
      "pk": 20005058,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 58,
      "text": "So they issued orders to the men of the forces that were with them and marched against Jamnia.",
      "links": [
        "1 Sam 23:1-2",
        "2 Macc 12:8",
        "Josh 15:56"
      ],
      "comment": "The campaign against Jamnia signals a proactive phase in the revolt, extending the conflict into Gentile-held territories and invoking the conquest motif from Israel’s earlier history.",
      "sectionHeader": "Cleansing and Rededication of the Sanctuary"
    },
    {
      "pk": 20005059,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 59,
      "text": "Gorgias and his men came out of the town to meet them in battle.",
      "links": [
        "1 Macc 3:38",
        "2 Macc 12:32",
        "1 Sam 17:4"
      ],
      "comment": "Gorgias, a recurring figure opposing the Maccabees, represents ongoing Greek resistance to Jewish autonomy."
    },
    {
      "pk": 20005060,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 60,
      "text": "Then Joseph and Azariah were routed, and were pursued to the borders of Judea; as many as two thousand of the people of Israel fell that day.",
      "links": [
        "Lev 26:17",
        "Deut 28:25",
        "Josh 7:5"
      ],
      "comment": "The defeat and heavy losses suffered by Joseph and Azariah warn against presumptuous action and underline the importance of legitimate leadership."
    },
    {
      "pk": 20005061,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 61,
      "text": "Thus the people suffered a great rout because, thinking to do a brave deed, they did not listen to Judas and his brothers.",
      "links": [
        "Prov 21:30",
        "Num 14:41-45",
        "Judg 20:21"
      ],
      "comment": "Failure is attributed to acting apart from the guidance of Judas, identifying obedience and communal unity as vital to Israel’s preservation, echoing themes from Numbers 14."
    },
    {
      "pk": 20005062,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 62,
      "text": "But they did not belong to the family of those men through whom deliverance was given to Israel.",
      "links": [
        "Judg 7:2",
        "Ps 44:3",
        "1 Cor 1:27-29"
      ],
      "comment": "The distinction drawn here locates deliverance through divinely-appointed leaders, reflecting a theology of vocation and God's sovereignty in raising deliverers (cf. Judges 2:16)."
    },
    {
      "pk": 20005063,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 63,
      "text": "Then he turned toward the land of the Philistines and passed through Marisa.",
      "links": "<a href='/AIV/9/13/17'>Judges 13:17</a>",
      "comment": "Passing through Philistine territory ties Judas’ exploits to Israel’s historic battles, showing continuity in the struggle for the promised land."
    },
    {
      "pk": 20005064,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 64,
      "text": "People gathered to them and praised them.",
      "links": [
        "1 Sam 18:6-7",
        "2 Chr 13:12",
        "Ps 44:8"
      ],
      "comment": "Popular acclaim gathers around Judas and his brothers, affirming them as God’s instruments, a dynamic seen with other biblical leaders such as David (1 Samuel 18:7)."
    },
    {
      "pk": 20005065,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 65,
      "text": "Judas marched for Azotus, in the land of the Philistines, and destroyed their altars, idols, and burned their carved images. He captured the city and returned into Judea.",
      "links": "<a href='/AIV/7/6/25'>Judges 6:25</a>, <a href='/AIV/23/2/18'>Isaiah 2:18</a>",
      "comment": "Destroying idols and altars is an echo of Gideon's actions, and points toward the spiritual call for purity in worship and the removal of false gods."
    },
    {
      "pk": 20005066,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 66,
      "text": "Then he marched off to go into the land of the Philistines, and passed through Marisa.",
      "links": [
        "Josh 15:44",
        "Judg 14:1",
        "1 Sam 6:17"
      ],
      "comment": "Judas's incursion into Philistine territory recalls ancient Israelite-Philistine conflict and the expansion of Jewish resistance beyond traditional borders."
    },
    {
      "pk": 20005067,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 67,
      "text": "On that day some priests, who wished to do a brave deed, fell in battle, for they went out to battle unwisely.",
      "links": [
        "Num 14:44-45",
        "Judg 20:21",
        "1 Chr 5:18-22"
      ],
      "comment": "The fall of zealous priests in battle suggests that bravery must be coupled with wisdom and proper authorization, resonant with the fate of unauthorized actors in Numbers 16.",
      "sectionHeader": "Return in Triumph and Thanksgiving"
    },
    {
      "pk": 20005068,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 5,
      "verse": 68,
      "text": "But Judas turned aside to Azotus in the land of the Philistines; he tore down their altars, and the carved images of their gods he burned with fire; he plundered the towns and returned to the land of Judah.",
      "links": [
        "Ex 23:24",
        "Deut 12:3",
        "2 Chr 14:3"
      ],
      "comment": "Judas’s destruction of Philistine idols and altars reaffirms the theme of exclusive fidelity to the God of Israel and the eradication of idolatry, recurring throughout the Deuteronomistic history.",
      "sectionHeader": "Israel’s Peace and Restoration"
    }
  ],
  "translatedAt": "2025-12-28T23:41:43.301Z"
}