{
  "book": 20,
  "bookName": "1 Maccabees",
  "bookAbbreviation": "1Macc",
  "chapter": 14,
  "sections": [
    {
      "title": "Simon’s Leadership and the Era of Peace",
      "startVerse": 1,
      "endVerse": 49
    }
  ],
  "verses": [
    {
      "pk": 20014001,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 1,
      "text": "In the one hundred and seventy-second year, King Demetrius assembled his army and marched into Media to seek assistance in fighting Trypho.",
      "links": "<a href='/AIV/20/13/31'>1Macc 13:31</a>",
      "comment": "This date refers to the Seleucid era, roughly 140 BC. Demetrius II’s campaign sets the stage for later political developments.",
      "sectionHeader": "Simon’s Leadership and the Era of Peace"
    },
    {
      "pk": 20014002,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 2,
      "text": "But when Arsaces, king of Persia and Media, heard that Demetrius had entered his territory, he sent one of his commanders to capture him alive.",
      "links": "<a href='/AIV/20/13/32'>1Macc 13:32</a>",
      "comment": "Arsaces refers to the Parthian king. The capture of Demetrius II by the Parthians had major implications for Judea's independence."
    },
    {
      "pk": 20014003,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 3,
      "text": "He went, defeated the army of Demetrius, captured him, and brought him to Arsaces, who threw him into prison.",
      "links": "<a href='/AIV/17/10/13'>Esther 10:13</a>",
      "comment": "Demetrius’s defeat shifts the power dynamic in the region, increasing Jewish autonomy under the Hasmoneans."
    },
    {
      "pk": 20014004,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 4,
      "text": "The land of Judea was at peace all the days of Simon. He sought the good of his nation; his power and honor delighted them throughout all his time.",
      "links": "<a href='/AIV/19/72/7'>Psalm 72:7</a> <a href='/AIV/23/9/6-7'>Isaiah 9:6-7</a>",
      "comment": "Simon's reign is depicted as a time of peace, reminiscent of ideal kingship and messianic expectations (cf. Isaiah 9)."
    },
    {
      "pk": 20014005,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 5,
      "text": "To crown all his honors he took Joppa for a harbor, and opened a way to the isles of the sea.",
      "links": [
        "Josh 19:46",
        "Judg 1:18",
        "2 Chr 8:17"
      ],
      "comment": "By capturing Joppa, a key seaport, Simon secured Jewish access to Mediterranean trade routes, fulfilling God’s promise of prosperity (cf. Deut 28:12) and increasing Israel’s strategic and economic influence."
    },
    {
      "pk": 20014006,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 6,
      "text": "He extended the borders of his nation, and gained full control of the country.",
      "links": [
        "Deut 19:8",
        "Josh 24:13",
        "1 Macc 13:34"
      ],
      "comment": "Simon’s expansion of Israel’s borders symbolizes the restoration of national sovereignty after Seleucid domination, evoking Joshua’s conquest of the land."
    },
    {
      "pk": 20014007,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 7,
      "text": "He gathered a host of captives; he ruled over Gazara and Beth-zur and the citadel, and he removed its uncleanness from it; and there was none to oppose him.",
      "links": [
        "1 Macc 13:43-47",
        "2 Chr 16:6",
        "2 Macc 10:1-8"
      ],
      "comment": "Simon’s successful campaigns yielded captives and reclaimed strategic cities like Gazara and Beth-zur, purging them of foreign idolatry—a priority reminiscent of Nehemiah’s reforms (Neh 13:23-30)."
    },
    {
      "pk": 20014008,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 8,
      "text": "They tilled their land in peace; the ground gave its increase, and the trees of the plains their fruit.",
      "links": [
        "Lev 26:4-5",
        "Ps 67:6",
        "Amos 9:13-15"
      ],
      "comment": "The land’s peaceful cultivation highlights the blessings of faithful leadership, echoing prophetic visions of restored abundance (Amos 9:13-15)."
    },
    {
      "pk": 20014009,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 9,
      "text": "Old men sat in the streets; they all talked together of good things, and the youths put on splendid military attire.",
      "links": [
        "Zech 8:4-5",
        "Prov 16:31",
        "Joel 2:28"
      ],
      "comment": "Social stability is depicted through images of elders conversing and youths in military attire, reflecting both the joy of peace and the vigilance required to maintain it (cf. Zech 8:4-5)."
    },
    {
      "pk": 20014010,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 10,
      "text": "He supplied the towns with food, and furnished them with the means of defense, until his renown spread to the ends of the earth.",
      "links": [
        "Prov 31:21",
        "2 Chr 32:5",
        "1 Kgs 10:24"
      ],
      "comment": "Simon’s provision for towns’ sustenance and defense led to widespread fame, fulfilling ideals of wise kingship (2 Chron 9:14) and God-given security."
    },
    {
      "pk": 20014011,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 11,
      "text": "He established peace in the land, and Israel rejoiced with great joy.",
      "links": [
        "1 Kgs 4:20",
        "Ps 53:6",
        "Isa 66:10"
      ],
      "comment": "A period of national peace brought communal rejoicing in Israel, showing the fruit of godly leadership (Ps 126:2-3)."
    },
    {
      "pk": 20014012,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 12,
      "text": "All the people sat under their own vines and fig trees, and there was none to make them afraid.",
      "links": [
        "Mic 4:4",
        "1 Kgs 4:25",
        "Isa 36:16"
      ],
      "comment": "The imagery of ‘sitting under one’s own vine and fig tree’ alludes to the promise of safety and prosperity (Mic 4:4; 1 Kings 4:25), embodying Shalom—a state of divinely granted peace."
    },
    {
      "pk": 20014013,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 13,
      "text": "No one was left in the land to fight them, and the kings were crushed in those days.",
      "links": [
        "Josh 21:44",
        "2 Chr 20:29",
        "1 Macc 13:42"
      ],
      "comment": "With adversaries subdued and neighboring kings defeated, Israel experienced unprecedented security, recalling God’s victories for Israel under the judges and kings."
    },
    {
      "pk": 20014014,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 14,
      "text": "He gave help to all the humble among his people; he sought out the law, and did away with all the renegades and outlaws.",
      "links": [
        "Ps 72:12-14",
        "Dan 11:32",
        "2 Macc 10:21-23"
      ],
      "comment": "Simon’s care for the humble and his loyalty to the Law underscore the twin priorities of justice and piety (cf. Deut 17:18-20), while purging lawbreakers restores covenant faithfulness."
    },
    {
      "pk": 20014015,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 15,
      "text": "He made the sanctuary glorious, and added to the vessels of the sanctuary.",
      "links": [
        "1 Macc 13:49-50",
        "2 Chr 29:18",
        "2 Macc 2:18"
      ],
      "comment": "Beautifying the sanctuary and increasing its vessels displays Simon’s commitment to temple worship, resonating with the reforms of Hezekiah and Josiah (2 Chron 29, 34)."
    },
    {
      "pk": 20014016,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 16,
      "text": "It was heard in Rome, and as far away as Sparta, that Jonathan had died, and they were deeply grieved.",
      "links": [
        "1 Macc 12:1",
        "Rom 1:8",
        "2 Macc 4:11"
      ],
      "comment": "Jonathan’s death reverberated even in Rome and Sparta, showing Israel’s growing international stature and the Maccabees’ diplomatic ties with major Mediterranean powers."
    },
    {
      "pk": 20014017,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 17,
      "text": "When they heard that his brother Simon had become high priest in his stead, and that he was ruling over the country and the towns in it,",
      "links": [
        "1 Macc 13:42",
        "1 Macc 13:53",
        "2 Chr 23:3"
      ],
      "comment": "Simon’s succession as high priest and national leader reassured allies and maintained Israel’s political and religious continuity."
    },
    {
      "pk": 20014018,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 18,
      "text": "they wrote to him on bronze tablets to renew with him the friendship and alliance that they had established with his brothers Judas and Jonathan.",
      "links": [
        "1 Macc 12:2-23",
        "2 Macc 11:34",
        "2 Sam 10:2"
      ],
      "comment": "Renewing official alliances upon changes in leadership follows ancient diplomatic customs, while passing alliances on to Simon legitimizes his rule and continues vital foreign relationships."
    },
    {
      "pk": 20014019,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 19,
      "text": "And these were read before the assembly in Jerusalem.",
      "links": [
        "Ezra 4:18",
        "Neh 8:3",
        "1 Macc 12:6"
      ],
      "comment": "Publicly reading diplomatic correspondence in Jerusalem underscored transparency and reinforced communal identity amid external recognition."
    },
    {
      "pk": 20014020,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 20,
      "text": "This is a copy of the letter that the Spartans sent: “The rulers and the city of the Spartans to the high priest Simon and to the elders and the priests and the rest of the Jewish people, our brothers, greetings.",
      "links": [
        "1 Macc 12:19",
        "2 Macc 5:9",
        "1 Macc 15:16"
      ],
      "comment": "The formal greeting from Sparta affirms recognition of Jewish leadership and solidarity, with the language of kinship (“brothers”) highlighting perceived ancient ties (cf. 1 Macc 12:5-23)."
    },
    {
      "pk": 20014021,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 21,
      "text": "The envoys who were sent to our people have told us about your glory and honor, and we rejoiced at their coming.",
      "links": [
        "1 Macc 5:9",
        "Ps 48:2",
        "1 Macc 12:22"
      ],
      "comment": "The Spartan envoys’ report of Simon’s glory and the Jewish people’s honor testifies to the esteem in which the Hasmoneans were held abroad."
    },
    {
      "pk": 20014022,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 22,
      "text": "We have recorded what they said in our public decrees, as follows, ‘Numenius son of Antiochus and Antipater son of Jason, envoys of the Jews, have come to us to renew their friendship with us.’",
      "links": [
        "1 Macc 8:17",
        "Acts 14:27",
        "2 Macc 11:1"
      ],
      "comment": "Recording the details of the alliance in official decrees ensured a lasting relationship and publicized the Jews’ diplomatic stature."
    },
    {
      "pk": 20014023,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 23,
      "text": "It has pleased our people to receive these men with honor and to put a copy of their words in the public archives, so that the people of the Spartans may have a record of them. And they have sent a copy of this to the high priest Simon.’”",
      "links": [
        "Esth 6:1",
        "1 Macc 12:15",
        "Ezra 6:2"
      ],
      "comment": "Honoring envoys and archiving treaties in Spartan records reflected the gravity of such alliances and cemented enduring friendship with Israel."
    },
    {
      "pk": 20014024,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 24,
      "text": "After this Simon sent Numenius to Rome with a large gold shield weighing one thousand minas, to confirm the alliance with the Romans.",
      "links": [
        "1 Macc 8:1,23",
        "1 Macc 13:37",
        "2 Macc 4:11"
      ],
      "comment": "Simon’s gift of a massive gold shield to Rome symbolized gratitude and a desire to strengthen the alliance, emphasizing the Maccabean policy of seeking powerful international partners (cf. 1 Macc 8:1-32)."
    },
    {
      "pk": 20014025,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 25,
      "text": "When the people heard these things they said, “How shall we thank Simon and his sons?",
      "links": "<a href='/AIV/20/2/42'>1Macc 2:42</a>",
      "comment": "Recalls the origin of the Hasmonean revolt, emphasizing continuity in defending both nation and the sacred law."
    },
    {
      "pk": 20014026,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 26,
      "text": "For he and his brothers and the house of his father have stood firm; they have fought and repulsed Israel’s enemies and established its freedom.”",
      "links": "<a href='/AIV/20/12/35'>1Macc 12:35</a>",
      "comment": "Simon’s civic achievements are celebrated, underscoring the integration of faith and national defense."
    },
    {
      "pk": 20014027,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 27,
      "text": "So they made a record on bronze tablets and put it on pillars on Mount Zion. This is a copy of what they wrote: “On the eighteenth day of Elul, in the one hundred seventy-second year, which is the third year of the great high priest Simon,",
      "links": "<a href='/AIV/06/13/6'>Joshua 13:6</a>",
      "comment": "Expanding borders recalls Israel’s ancient inheritance, with implication of divine approval."
    },
    {
      "pk": 20014028,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 28,
      "text": "in Asaramel, in the great assembly of the priests and the people and the rulers of the nation and the elders of the country, the following was proclaimed to us:",
      "links": "<a href='/AIV/23/11/12'>Isaiah 11:12</a>",
      "comment": "The regathering theme is messianic, echoing prophetic restoration (Isaiah 11) later realized in the Christian gathering of all peoples."
    },
    {
      "pk": 20014029,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 29,
      "text": "“Since wars often occurred in the country, Simon son of Mattathias, a priest of the sons of Joarib, and his brothers, exposed themselves to danger and resisted the enemies of their nation, in order that their sanctuary and the law might be preserved; and they brought great glory to their nation.",
      "links": "<a href='/AIV/20/2/48'>1Macc 2:48</a>",
      "comment": "Deliverance echoes God’s intervention through appointed leaders—an anticipation of ultimate deliverance through Christ."
    },
    {
      "pk": 20014030,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 30,
      "text": "Jonathan rallied the nation, became their high priest, and was gathered to his people.",
      "links": "<a href='/AIV/20/13/23'>1Macc 13:23</a>",
      "comment": "'Gathered to his ancestors' is a Semitic phrase for death, and echoes similar formulae (see Genesis 25:8)."
    },
    {
      "pk": 20014031,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 31,
      "text": "When their enemies decided to invade their country and lay hands on their sanctuary,",
      "links": "<a href='/AIV/20/13/15'>1Macc 13:15</a>",
      "comment": "Simon’s personal sacrifice for the people models true shepherd leadership, foreshadowing Christ’s self-giving."
    },
    {
      "pk": 20014032,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 32,
      "text": "then Simon rose up and fought for his nation. He spent great sums of his own money; he armed the soldiers of his nation and paid them wages.",
      "links": "<a href='/AIV/14/11/7'>2 Chronicles 11:7</a>",
      "comment": "Details of fortifications parallel those built in David’s and Solomon’s reigns—wise stewardship for the common good."
    },
    {
      "pk": 20014033,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 33,
      "text": "He fortified the towns of Judea, and Beth-zur on the borders of Judea, where formerly the arms of the enemy had been stored, and he placed there a garrison of Jews.",
      "links": "<a href='/AIV/15/6/21'>Ezra 6:21</a>",
      "comment": "The cleansing of the city echoes previous temple and city renewals, anticipating the restoration and purity championed in later Christian ecclesiology."
    },
    {
      "pk": 20014034,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 34,
      "text": "'He settled Jews in it, fortified it for the safety of the land, and built up Joppa as a harbor, providing access to the islands of the sea.'",
      "links": "<a href='/AIV/14/2/16'>2 Chronicles 2:16</a>",
      "comment": "Control over a seaport increased Israel’s prosperity and opened the way for broader influence—preparing the land for the Gospel’s spread."
    },
    {
      "pk": 20014035,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 35,
      "text": "'When the people saw Simon’s fidelity and how he aimed to increase the glory of his nation, they made him their leader and high priest because of all he had done and the justice and loyalty he had shown to his nation.'",
      "links": "<a href='/AIV/20/13/42'>1Macc 13:42</a>",
      "comment": "Simon’s moral stature is praised along with his authority over temporal and spiritual matters—a foreshadowing of unified leadership later seen in apostolic governance."
    },
    {
      "pk": 20014036,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 36,
      "text": "'In his days successful enterprises prospered by his hand, and he removed those who tried to invade their country.'",
      "links": "<a href='/AIV/19/18/43'>Psalm 18:43</a>",
      "comment": "Simon’s victories demonstrate how faithfulness to God leads to practical blessings; a theme completed in New Testament promises of spiritual victory (Romans 8:37)."
    },
    {
      "pk": 20014037,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 37,
      "text": "'They wrote that Simon should be high priest forever, and leader and governor of the Jews and priests, with authority to decide and to appoint officials, that he may protect them all.'",
      "links": "<a href='/AIV/02/28/41'>Exodus 28:41</a>",
      "comment": "A unique conferral of both religious and civil power upon Simon; hints at enduring spiritual structures and roles, later seen in Christian leadership."
    },
    {
      "pk": 20014038,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 38,
      "text": "'It was decreed that such records should be preserved for all time in the temple, so that Simon and his descendants may have this office.'",
      "links": "<a href='/AIV/04/17/10'>Numbers 17:10</a>",
      "comment": "Perpetual records and hereditary leadership recall the Old Testament priesthood; note continuity and visible succession within sacred tradition."
    },
    {
      "pk": 20014039,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 39,
      "text": "'Then the people consented that Simon should act accordingly.'",
      "links": "<a href='/AIV/11/1/39'>1 Kings 1:39</a>",
      "comment": "Popular consent mirrors Old Testament anointings and endorsement ceremonies, showing the communal foundation of legitimate authority."
    },
    {
      "pk": 20014040,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 40,
      "text": "Simon accepted and was pleased to act as high priest, governor, and ethnarch of the people of God.",
      "links": "<a href='/AIV/20/13/41-42'>1Macc 13:41-42</a>",
      "comment": "Simon's acceptance of this triple office—spiritual, civic, and national—prefigures the fullness of kingship, priesthood, and prophetic ministry united in Christ."
    },
    {
      "pk": 20014041,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 41,
      "text": "The people of Israel and their priests agreed that Simon should be their leader and high priest forever, until a trustworthy prophet should arise.",
      "links": "<a href='/AIV/7/2/16-18'>Judges 2:16-18</a>; <a href='/AIV/9/3/20-21'>1 Samuel 3:20-21</a>",
      "comment": "This verse highlights the dual leadership role—both political and spiritual—of Simon. The mention of a 'trustworthy prophet' suggests that the final authority remains with God’s future revelation, foreshadowing the expectation of a Messianic figure (see <a href='/AIV/5/18/15'>Deuteronomy 18:15</a>)."
    },
    {
      "pk": 20014042,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 42,
      "text": "He was granted power to appoint officials for the service, to care for the land and the arms, and to rule over the strongholds.",
      "links": "<a href='/AIV/13/29/12'>1 Chronicles 29:12</a>; <a href='/AIV/2/18/13'>Exodus 18:13</a>",
      "comment": "Simon's authority includes appointing rulers and taking care of the temple and the nation, showing both administrative and sacred responsibility—foreshadowing the way later leaders would bear both spiritual and worldly authority."
    },
    {
      "pk": 20014043,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 43,
      "text": "All were to obey him, and every document in the country was to be written in his name. He was clothed in purple and wore gold.",
      "links": "<a href='/AIV/10/24/16'>2 Samuel 24:16</a>; <a href='/AIV/17/8/15'>Esther 8:15</a>",
      "comment": "The color purple and the use of gold are signs of royal and priestly authority. Writing documents in Simon’s name is reminiscent of later ecclesiastical authority and apostolic governance (see <a href='/AIV/40/16/19'>Matthew 16:19</a>)."
    },
    {
      "pk": 20014044,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 44,
      "text": "No one was to oppose his orders or call an assembly in the country without his permission, or wear purple or a gold clasp.",
      "links": "<a href='/AIV/4/16/40'>Numbers 16:40</a>; <a href='/AIV/9/15/23'>1 Samuel 15:23</a>",
      "comment": "Centralized authority is established for the sake of unity and order among God’s people. Wearing purple or gold was reserved for those chosen, prefiguring distinctions in office within the Church."
    },
    {
      "pk": 20014045,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 45,
      "text": "Anyone found acting against these decrees or resisting what Simon commanded would be subject to punishment.",
      "links": "<a href='/AIV/2/32/25-29'>Exodus 32:25-29</a>; <a href='/AIV/45/13/2'>Romans 13:2</a>",
      "comment": "Enforcing obedience to divinely chosen authorities ensures the people remain faithful and unified—a principle later applied in Christian doctrine concerning church leadership."
    },
    {
      "pk": 20014046,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 46,
      "text": "All the people agreed to appoint Simon as their leader and high priest, and to obey his commands.",
      "links": "<a href='/AIV/2/19/8-9'>Exodus 19:8-9</a>; <a href='/AIV/5/17/12'>Deuteronomy 17:12</a>",
      "comment": "This consensus mirrors Israel's earlier covenants, where the people collectively affirm their leadership, similar to the early acceptance of apostolic authority in the New Testament."
    },
    {
      "pk": 20014047,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 47,
      "text": "Simon accepted this office and agreed to act as high priest, governor, and leader of Israel and its priests, to defend all.",
      "links": "<a href='/AIV/9/10/1'>1 Samuel 10:1</a>; <a href='/AIV/38/6/13'>Zechariah 6:13</a>",
      "comment": "Simon’s acceptance of both spiritual and secular roles recalls figures like Melchizedek and foreshadows the way Christ fulfills both kingly and priestly offices (<a href='/AIV/58/7/17'>Hebrews 7:17</a>)."
    },
    {
      "pk": 20014048,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 48,
      "text": "The elders and the entire people decreed that this record should be inscribed on bronze tablets and set up in a prominent place in the sanctuary.",
      "links": "<a href='/AIV/6/24/26'>Joshua 24:26</a>; <a href='/AIV/16/8/1'>Nehemiah 8:1</a>",
      "comment": "Recording Simon's appointment on bronze tablets not only legitimized his office, but reflects the tradition of preserving important religious decrees for generations, similar to the establishment of enduring institutions."
    },
    {
      "pk": 20014049,
      "translation": "AIV",
      "book": 20,
      "bookName": "1 Maccabees",
      "bookAbbreviation": "1Macc",
      "chapter": 14,
      "verse": 49,
      "text": "They also placed copies in the treasury, so Simon and his descendants might have access to them.",
      "links": "<a href='/AIV/11/22/50'>1 Kings 22:50</a>; <a href='/AIV/40/16/18-19'>Matthew 16:18-19</a>",
      "comment": "By placing copies in the treasury, the people preserved legitimacy and continuity of leadership for generations. This practice foreshadows the importance of apostolic succession and the guardianship of sacred tradition."
    }
  ],
  "translatedAt": "2025-12-29T00:38:34.014Z"
}