{
  "book": 34,
  "bookName": "Daniel",
  "bookAbbreviation": "Dan",
  "chapter": 3,
  "verses": [
    {
      "pk": 34003001,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 1,
      "text": "King Nebuchadnezzar made an image of gold, sixty cubits high and six cubits wide, and set it up on the plain of Dura, in the province of Babylon.",
      "links": "<a href='/AIV/27/2/31-32'>Dan. 2:31-32</a>",
      "comment": "Nebuchadnezzar's statue may reflect the dream interpretation in chapter 2. The image's dimensions emphasize its splendor and dominance, foreshadowing the test that follows.",
      "sectionHeader": "The Golden Image and the King's Decree"
    },
    {
      "pk": 34003002,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 2,
      "text": "Then King Nebuchadnezzar summoned the satraps, prefects, governors, counselors, treasurers, judges, magistrates, and all the officials of the provinces to come to the dedication of the image which he had set up.",
      "links": "<a href='/AIV/27/6/1-2'>Dan. 6:1-2</a>",
      "comment": "The gathering of all political authorities shows the total demand for allegiance to the empire's authority, symbolized by the image."
    },
    {
      "pk": 34003003,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 3,
      "text": "So the satraps, prefects, governors, counselors, treasurers, judges, magistrates, and all the officials of the provinces gathered for the dedication of the image that King Nebuchadnezzar had set up. They stood before the image that Nebuchadnezzar had set up.",
      "links": "<a href='/AIV/27/2/48-49'>Dan. 2:48-49</a>",
      "comment": "Every term is repeated for solemnity and to stress completeness. The universal authority of Nebuchadnezzar is on display."
    },
    {
      "pk": 34003004,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 4,
      "text": "Then the herald loudly proclaimed, 'To you it is commanded, O peoples, nations, and languages,'",
      "links": "<a href='/AIV/27/4/1'>Dan. 4:1</a>",
      "comment": "This address to all peoples, languages and nations shows imperial universality, foreshadowing the eschatological vision of peoples worshipping God (see Rev. 7:9)."
    },
    {
      "pk": 34003005,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 5,
      "text": "'At the moment you hear the sound of the horn, flute, lyre, harp, pipes, and every kind of music, you are to fall down and worship the golden image that King Nebuchadnezzar has set up.'",
      "links": "<a href='/AIV/27/6/7'>Dan. 6:7</a>",
      "comment": "The religious ritual is enforced on all, echoing later images in Revelation, which warns against idolatrous worship (Rev. 13:15)."
    },
    {
      "pk": 34003006,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 6,
      "text": "'And whoever does not fall down and worship shall immediately be thrown into the midst of a burning fiery furnace.'",
      "links": "<a href='/AIV/27/6/16'>Dan. 6:16</a>",
      "comment": "A threat of execution for noncompliance. True worship of the one God often comes with a cost, as Christ promises (Matt. 10:22; John 15:18-19)."
    },
    {
      "pk": 34003007,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 7,
      "text": "Therefore, as soon as all the peoples heard the sound of the horn, flute, lyre, harp, and every kind of music, all the peoples, nations, and languages fell down and worshipped the golden image that King Nebuchadnezzar had set up.",
      "links": "<a href='/AIV/27/3/4'>Dan. 3:4</a>",
      "comment": "The immediate obedience of the masses is contrasted with the faithful resistance of God's people."
    },
    {
      "pk": 34003008,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 8,
      "text": "At that time certain Chaldeans came forward and accused the Jews.",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>",
      "comment": "Hostility toward the chosen people is a recurring scriptural theme, foreshadowing later persecutions (Acts 4:1-3).",
      "sectionHeader": "The Refusal of Shadrach, Meshach, and Abednego"
    },
    {
      "pk": 34003009,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 9,
      "text": "They spoke and said to King Nebuchadnezzar, 'O king, live forever!'",
      "links": "<a href='/AIV/27/2/4'>Dan. 2:4</a>",
      "comment": "The formulaic court greeting displays their allegiance to earthly kingship over true worship."
    },
    {
      "pk": 34003010,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 10,
      "text": "'You, O king, have made a decree, that every man who hears the sound of the horn, flute, lyre, harp, pipe, and every kind of music, shall fall down and worship the golden image,'",
      "links": "<a href='/AIV/27/3/5'>Dan. 3:5</a>",
      "comment": "The accusers, with subtle flattery, remind the king of his absolute law to set the trap for the faithful."
    },
    {
      "pk": 34003011,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 11,
      "text": "'and whoever does not fall down and worship shall be cast into the midst of a burning fiery furnace.'",
      "links": "<a href='/AIV/27/3/6'>Dan. 3:6</a>",
      "comment": "They stress the king's enforced worship, paralleling later challenges to the faith faced by the Apostles (Acts 5:29)."
    },
    {
      "pk": 34003012,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 12,
      "text": "'There are certain Jews, whom you have appointed over the affairs of the province of Babylon: Shadrach, Meshach, and Abednego. These men, O king, do not pay due regard to you. They do not serve your gods or worship the golden image you have set up.'",
      "links": "<a href='/AIV/27/1/7'>Dan. 1:7</a>; <a href='/AIV/27/2/49'>Dan. 2:49</a>",
      "comment": "The faithfulness of Shadrach, Meshach, and Abednego points to steadfastness even under pressure from earthly authorities—an important scriptural principle."
    },
    {
      "pk": 34003013,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 13,
      "text": "Then Nebuchadnezzar, in rage and fury, commanded that Shadrach, Meshach, and Abednego be brought. So they brought these men before the king.",
      "links": "<a href='/AIV/27/2/12'>Dan. 2:12</a>",
      "comment": "Rage and fury reflect Nebuchadnezzar’s pride and intolerance for dissent—contrasted with God’s patience and justice."
    },
    {
      "pk": 34003014,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 14,
      "text": "Nebuchadnezzar spoke and said to them, 'Is it true, Shadrach, Meshach, and Abednego, that you do not serve my gods or worship the golden image I have set up?'",
      "links": "<a href='/AIV/27/6/13'>Dan. 6:13</a>",
      "comment": "The king offers them a chance to recant, implying he is aware of their faithfulness."
    },
    {
      "pk": 34003015,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 15,
      "text": "'Now if you are ready, when you hear the sound of the horn, flute, lyre, harp, pipes, and every kind of music to fall down and worship the image I have made, well and good; but if you do not worship, you shall immediately be thrown into the midst of a burning fiery furnace. And who is the god that will deliver you out of my hands?'",
      "links": "<a href='/AIV/2/5/2'>Ex. 5:2</a>",
      "comment": "Nebuchadnezzar’s challenge, 'who is the god,' echoes Pharaoh’s pride in Exodus. In context, the question will point to a demonstration of the true God’s power."
    },
    {
      "pk": 34003016,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 16,
      "text": "Shadrach, Meshach, and Abednego answered and said to the king, 'O Nebuchadnezzar, we have no need to answer you in this matter.'",
      "links": "<a href='/AIV/27/6/10'>Dan. 6:10</a>",
      "comment": "They show unwavering trust, not even requiring to defend themselves—recalling Jesus' words not to worry about what to say under persecution (Matt. 10:19-20)."
    },
    {
      "pk": 34003017,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 17,
      "text": "If it be so, our God whom we serve is able to deliver us from the burning fiery furnace, and He will deliver us out of your hand, O king.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/27/6/22'>Dan. 6:22</a>",
      "comment": "The confidence of God’s saving power has a typological connection to Christian martyrdom and the hope in resurrection (2 Macc. 7)."
    },
    {
      "pk": 34003018,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 18,
      "text": "'But even if He does not, be it known to you, O king, that we will not serve your gods or worship the golden image that you have set up.'",
      "links": "<a href='/AIV/27/6/10'>Dan. 6:10</a>",
      "comment": "Here, love and fear of God transcend fear of death—a preview of the Church’s teaching on steadfastness under trial."
    },
    {
      "pk": 34003019,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 19,
      "text": "Then Nebuchadnezzar was filled with fury, and the expression on his face changed against Shadrach, Meshach, and Abednego. He commanded that the furnace be heated seven times more than it was usually heated.",
      "links": "<a href='/AIV/19/21/9'>Ps. 21:9</a>",
      "comment": "The excessive wrath of the king highlights the extremity of the trial, and ‘seven times’ underscores totality and perfection (see Lev. 26:18).",
      "sectionHeader": "The Fiery Furnace"
    },
    {
      "pk": 34003020,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 20,
      "text": "He ordered some of the strongest men in his army to bind Shadrach, Meshach, and Abednego and throw them into the burning fiery furnace.",
      "links": "<a href='/AIV/27/6/16'>Dan. 6:16</a>",
      "comment": "The drama is intensified by highlighting the futility of human strength against divine salvation."
    },
    {
      "pk": 34003021,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 21,
      "text": "So they were bound in their cloaks, tunics, head coverings, and other garments, and were thrown into the burning fiery furnace.",
      "links": "<a href='/AIV/34/3/15'>Dan. 3:15</a>; <a href='/AIV/51/7/58'>Acts. 7:58</a>; <a href='/AIV/23/66/12'>Ps. 66:12</a>",
      "comment": "Meticulous listing emphasizes the completeness and immediacy of the action and would have made their survival more conspicuous."
    },
    {
      "pk": 34003022,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 22,
      "text": "Because the king’s order was urgent, and the furnace extremely hot, the flame killed those men who took up Shadrach, Meshach, and Abednego.",
      "links": "<a href='/AIV/27/6/24'>Dan. 6:24</a>",
      "comment": "The irony is that those who obeyed the king’s command perished, contrasting earthly authority with God’s saving power."
    },
    {
      "pk": 34003023,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 23,
      "text": "But these three men, Shadrach, Meshach, and Abednego, fell bound into the midst of the burning fiery furnace.",
      "links": "<a href='/AIV/34/3/6'>Dan. 3:6</a>; <a href='/AIV/29/43/2'>Isa. 43:2</a>; <a href='/AIV/65/11/34'>Heb. 11:34</a>",
      "comment": "The scene sets up the miracle by emphasizing that they fell in fully bound and clothed."
    },
    {
      "pk": 34003024,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 24,
      "text": "They walked about in the midst of the flames, singing hymns to God and blessing the Lord.",
      "links": "<a href='/AIV/51/16/25'>Acts. 16:25</a>; <a href='/AIV/23/34/1'>Ps. 34:1</a>; <a href='/AIV/23/148/1'>Ps. 148:1-2</a>",
      "comment": "The faithfulness of the three in the fire leads them to worship despite persecution, recalling the Psalms' association of praise amid suffering (cf. Ps 34:1; Acts 16:25)."
    },
    {
      "pk": 34003025,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 25,
      "text": "Then Azariah stood still in the fire and prayed aloud:",
      "links": "<a href='/AIV/39/2/1'>Jonah. 2:1</a>; <a href='/AIV/23/50/15'>Ps. 50:15</a>; <a href='/AIV/34/6/10'>Dan. 6:10</a>",
      "comment": "Azariah’s prayer from the midst of flames models intercessory prayer under duress, emphasizing dependence on God even in mortal danger."
    },
    {
      "pk": 34003026,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 26,
      "text": "Blessed are you, O Lord, God of our ancestors, and worthy of praise; and glorious is your name forever!",
      "links": "<a href='/AIV/13/29/10'>1Chr. 29:10-13</a>; <a href='/AIV/23/113/2'>Ps. 113:2-3</a>; <a href='/AIV/73/15/3'>Rev. 15:3-4</a>",
      "comment": "This doxology reflects Jewish patterns of blessing God’s name, affirming God’s eternal glory—key themes also seen in Psalms and Jewish liturgy (cf. Ps 103:1, Neh 9:5)."
    },
    {
      "pk": 34003027,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 27,
      "text": "For you are just in all you have done; all your works are true and your ways right, and all your judgments are true.",
      "links": "<a href='/AIV/5/32/4'>Deut. 32:4</a>; <a href='/AIV/23/145/17'>Ps. 145:17</a>; <a href='/AIV/52/3/4'>Rom. 3:4</a>",
      "comment": "A complete deliverance. Similar miracles prefigure Christian resurrection, when the faithful will be protected and glorified beyond natural expectation (cf. 1 Cor. 15:42-44)."
    },
    {
      "pk": 34003028,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 28,
      "text": "You have executed true judgments in all you have brought upon us and upon Jerusalem, the holy city of our ancestors; by a true judgment you have brought all this upon us because of our sins.",
      "links": "<a href='/AIV/27/6/22'>Dan. 6:22</a>; <a href='/AIV/45/12/1'>Rom. 12:1</a>",
      "comment": "Offering one’s body for faith, as these men did, is echoed in the New Testament as a living sacrifice (Rom. 12:1)."
    },
    {
      "pk": 34003029,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 29,
      "text": "For we have sinned and broken your law in turning away from you; in all matters we have sinned grievously.",
      "links": "<a href='/AIV/23/106/6'>Ps. 106:6</a>; <a href='/AIV/11/8/47'>1Kgs. 8:47</a>; <a href='/AIV/34/9/5'>Dan. 9:5</a>",
      "comment": "Nebuchadnezzar’s decree, though harsh by modern standards, underscores the uniqueness and power of Israel’s God."
    },
    {
      "pk": 34003030,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 30,
      "text": "We have not obeyed your commandments, we have not kept them or done what you have commanded us for our own good.",
      "links": "<a href='/AIV/27/2/48-49'>Dan. 2:48-49</a>",
      "comment": "Through faithfulness under trial comes exaltation, a foreshadowing of the Christian teaching that those who humble themselves for God will be exalted (Matt. 23:12; Phil. 2:8-9)."
    },
    {
      "pk": 34003031,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 31,
      "text": "So all that you have brought upon us, and all that you have done to us, you have done by a true judgment.",
      "links": "<a href='/AIV/27/3/23-25'>Dan. 3:23-25 (Hebrew text)</a>; <a href='/AIV/19/22/3'>Ps. 22:3</a>",
      "comment": "This verse and the following ‘Song of the Three’ are found in the Septuagint and Latin Bible traditions, emphasizing the spiritual response of prayer and praise in adversity."
    },
    {
      "pk": 34003032,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 32,
      "text": "You have handed us over to our enemies, lawless and hateful rebels, and to an unjust king, the most wicked in all the world.",
      "links": "<a href='/AIV/23/44/12'>Ps. 44:12</a>; <a href='/AIV/30/21/7'>Jer. 21:7</a>; <a href='/AIV/15/9/7'>Ezra. 9:7</a>",
      "comment": "Azariah is the Hebrew name for Abednego, reflecting the continuity with his Jewish identity in prayer.",
      "sectionHeader": "The Prayer of Azariah"
    },
    {
      "pk": 34003033,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 33,
      "text": "And now we cannot open our mouths; we, your servants who worship you, have become a shame and a reproach.",
      "links": "<a href='/AIV/19/113/2'>Ps. 113:2</a>",
      "comment": "Commences a liturgical prayer, reflecting the pattern of confession, praise, and trust in divine mercy—models for Christian worship."
    },
    {
      "pk": 34003034,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 34,
      "text": "For your name’s sake do not give us up forever, and do not annul your covenant.",
      "links": "<a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "Proclaims God’s perfect justice—a foundational theme in Scripture."
    },
    {
      "pk": 34003035,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 35,
      "text": "Do not withdraw your mercy from us, for the sake of Abraham your beloved and for the sake of your servant Isaac and Israel your holy one,",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Acknowledges sin and the justice of exile—significant for understanding both the Old Covenant curses (Deut. 28) and God’s mercy."
    },
    {
      "pk": 34003036,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 36,
      "text": "to whom you promised to multiply their descendants like the stars of heaven and like the sand on the shore of the sea.",
      "links": "<a href='/AIV/19/106/6'>Ps. 106:6</a>",
      "comment": "Evokes the biblical tradition of corporate confession, anticipating elements of the penitential rites in Christian worship."
    },
    {
      "pk": 34003037,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 37,
      "text": "For we, O Lord, have become fewer than any other nation, and are brought low this day in all the world because of our sins.",
      "links": "<a href='/AIV/16/9/33'>Neh. 9:33</a>",
      "comment": "Recognition that God’s chastisements are just foreshadows the New Testament call to self-examination and repentance (1 Cor. 11:31)."
    },
    {
      "pk": 34003038,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 38,
      "text": "In our day we have no ruler, or prophet, or leader, no burnt offering, or sacrifice, or oblation, or incense, no place to make an offering before you and to find mercy.",
      "links": "<a href='/AIV/5/30/2'>Deut. 30:2</a>",
      "comment": "Sin is identified with disobedience, and the commands of God are revealed as given for humankind’s own benefit."
    },
    {
      "pk": 34003039,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 39,
      "text": "Yet with a contrite heart and a humble spirit may we be accepted,",
      "links": "<a href='/AIV/23/51/17'>Ps. 51:17</a>",
      "comment": "The exile to Babylon is seen as both just discipline and a cry for Divine deliverance."
    },
    {
      "pk": 34003040,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 40,
      "text": "as though it were with burnt offerings of rams and bulls, or with tens of thousands of fat lambs; such may our sacrifice be in your sight today, and may we unreservedly follow you, for no shame will come to those who trust in you.",
      "links": "<a href='/AIV/23/51/16'>Ps. 51:16-17</a>; <a href='/AIV/35/6/6'>Hos. 6:6</a>; <a href='/AIV/65/13/15'>Heb. 13:15</a>",
      "comment": "A classic posture of humility and repentance before God, preparing for restoration."
    },
    {
      "pk": 34003041,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 41,
      "text": "And now with all our heart we follow you; we fear you and seek your presence.",
      "links": "<a href='/AIV/3/26/44'>Lev. 26:44-45</a>",
      "comment": "Appeal to God’s faithfulness to His covenant, a motif that underlies Christian trust in the new and everlasting covenant."
    },
    {
      "pk": 34003042,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 42,
      "text": "Do not put us to shame, but deal with us in your patience and in your abundant mercy.",
      "links": "<a href='/AIV/1/13/15'>Gen. 13:15</a>",
      "comment": "Confirms the power of intercessory prayer and the continuity of God’s promises through the patriarchs—a major biblical theme."
    },
    {
      "pk": 34003043,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 43,
      "text": "Deliver us in accordance with your marvelous works, and bring glory to your name, O Lord.",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>",
      "comment": "Restates Abrahamic covenant with metaphors used by both Old and New Testaments."
    },
    {
      "pk": 34003044,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 44,
      "text": "Let all who do harm to your servants be put to shame; let them be disgraced and deprived of all power, and let their strength be broken.",
      "links": "<a href='/AIV/19/44/11'>Ps. 44:11</a>",
      "comment": "The litany of humility is reminiscent of Israel’s repeated exile and a pattern of spiritual exile and restoration."
    },
    {
      "pk": 34003045,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 45,
      "text": "Let them know that you alone are the Lord God, glorious over the whole world.",
      "links": "<a href='/AIV/28/3/4'>Hos. 3:4</a>",
      "comment": "Absence of sacrificial worship is keenly felt. This verse foreshadows hope for a new and spiritual offering, as fulfilled in the Christian age (Heb. 10:14)."
    },
    {
      "pk": 34003046,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 46,
      "text": "So the king's servants who cast them in did not cease kindling the furnace with naphtha, pitch, tow, and brushwood.",
      "links": "<a href='/AIV/34/3/22'>Dan. 3:22</a>; <a href='/AIV/7/16/29'>Judg. 16:29-30</a>; <a href='/AIV/23/7/16'>Ps. 7:16</a>",
      "comment": "The relentless stoking of the furnace demonstrates the king’s intent to ensure total destruction, highlighting the intensity of opposition to the young men’s faith."
    },
    {
      "pk": 34003047,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 47,
      "text": "And the flame streamed out above the furnace forty-nine cubits,",
      "links": "<a href='/AIV/34/3/19'>Dan. 3:19</a>; <a href='/AIV/23/124/2'>Ps. 124:2-3</a>; <a href='/AIV/29/5/24'>Isa. 5:24</a>",
      "comment": "The exaggerated height of the flames (forty-nine cubits) underscores the miraculous nature of the deliverance, a literary device common in biblical storytelling."
    },
    {
      "pk": 34003048,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 48,
      "text": "and it broke through and burned those of the Chaldeans whom it caught about the furnace.",
      "links": "<a href='/AIV/34/3/22'>Dan. 3:22</a>; <a href='/AIV/23/37/20'>Ps. 37:20</a>; <a href='/AIV/19/7/10'>Esth. 7:10</a>",
      "comment": "The fire miraculously reverses targets, consuming the Chaldeans instead and echoing the biblical motif of divine retribution (cf. Esther 7:10)."
    },
    {
      "pk": 34003049,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 49,
      "text": "But the angel of the Lord came down into the furnace to be with Azariah and his companions, and drove the fiery flame out of the furnace,",
      "links": "<a href='/AIV/34/6/22'>Dan. 6:22</a>; <a href='/AIV/23/91/11'>Ps. 91:11-12</a>; <a href='/AIV/51/12/7'>Acts. 12:7</a>",
      "comment": "The angel of the Lord’s presence signifies God’s immediate intervention, aligning with appearances of divine deliverance elsewhere (cf. Exod 14:19; Dan 6:22)."
    },
    {
      "pk": 34003050,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 50,
      "text": "and made the inside of the furnace as though a moist wind were whistling through it. The fire did not touch them at all and caused them no pain or distress.",
      "links": "<a href='/AIV/29/43/2'>Isa. 43:2</a>; <a href='/AIV/65/11/34'>Heb. 11:34</a>; <a href='/AIV/23/91/4'>Ps. 91:4</a>",
      "comment": "A moist wind replaces destructive fire, signifying God’s complete power over nature and recalling His protection of His people (cf. Isa 43:2)."
    },
    {
      "pk": 34003051,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 51,
      "text": "Then the three, as with one voice, praised, glorified, and blessed God within the furnace:",
      "links": "<a href='/AIV/23/34/1'>Ps. 34:1</a>; <a href='/AIV/51/16/25'>Acts. 16:25</a>; <a href='/AIV/23/148/1'>Ps. 148:1-2</a>",
      "comment": "This utterly miraculous rescinding of natural law is a strong biblical sign of God’s authority over creation."
    },
    {
      "pk": 34003052,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 52,
      "text": "Blessed are you, O Lord, God of our ancestors, and to be praised and highly exalted forever; And blessed is your glorious, holy name, and to be highly praised and highly exalted forever.",
      "links": "<a href='/AIV/23/103/1'>Ps. 103:1</a>; <a href='/AIV/23/33/1'>Ps. 33:1</a>; <a href='/AIV/73/19/6'>Rev. 19:6</a>",
      "comment": "This verse opens the Song of the Three with an invocation that links the God of the present with Israel’s ancestors, emphasizing both continuity with the covenant and the transcendence of God’s holy name. The poetic doubling and intensification (“praised and highly exalted forever”) reflect the Hebrew approach to parallelism in worship.",
      "sectionHeader": "The Song of the Three Young Men"
    },
    {
      "pk": 34003053,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 53,
      "text": "'Blessed are you, O Lord, God of our fathers, and to be praised and highly exalted forever. And blessed is your glorious, holy name and to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/72/19'>Ps. 72:19</a>",
      "comment": "Begins the 'Benedicite', a hymn of universal praise used in liturgical tradition."
    },
    {
      "pk": 34003054,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 54,
      "text": "'Blessed are you in the temple of your holy glory and to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/138/2'>Ps. 138:2</a>",
      "comment": "God’s presence in the Temple is remembered, while their location in exile points forward to God's presence with the worshiping assembly everywhere."
    },
    {
      "pk": 34003055,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 55,
      "text": "'Blessed are you who look into the depths and sit upon the cherubim, to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/2/25/22'>Ex. 25:22</a>",
      "comment": "References God’s unique glory between the cherubim, recalling the Ark and the Temple. This imagery appears in Christian understanding of heavenly worship (Rev. 4:6-8)."
    },
    {
      "pk": 34003056,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 56,
      "text": "'Blessed are you on the throne of your kingdom, to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/47/8'>Ps. 47:8</a>",
      "comment": "The throne and kingdom evoke both the sovereignty of God and messianic expectation."
    },
    {
      "pk": 34003057,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 57,
      "text": "'Blessed are you in the firmament of heaven, to be praised and highly exalted forever.'",
      "links": "<a href='/AIV/19/150/1'>Ps. 150:1</a>",
      "comment": "Universal sovereignty over all creation is asserted—a theme picked up throughout the New Testament."
    },
    {
      "pk": 34003058,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 58,
      "text": "'Bless the Lord, all you works of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/104/1'>Ps. 104:1-2</a>; <a href='/AIV/23/148/1'>Ps. 148:1-6</a>; <a href='/AIV/73/5/13'>Rev. 5:13</a>",
      "comment": "All of creation is called to bless God, anticipating the cosmic worship in the New Testament (Rev. 5:13)."
    },
    {
      "pk": 34003059,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 59,
      "text": "'Bless the Lord, you heavens, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/19/1'>Ps. 19:1</a>; <a href='/AIV/23/148/4'>Ps. 148:4</a>; <a href='/AIV/73/21/23'>Rev. 21:23</a>",
      "comment": "The litany continues to summon all creation to praise, showing an all-encompassing vision of worship."
    },
    {
      "pk": 34003060,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 60,
      "text": "'Bless the Lord, you angels of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/19/103/20'>Ps. 103:20</a>",
      "comment": "Even the angels are included, representing the unity of heaven and earth in worship (see Heb. 12:22)."
    },
    {
      "pk": 34003061,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 61,
      "text": "'Bless the Lord, all you waters above the heavens; sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/1/1/7'>Gen. 1:7</a>",
      "comment": "This call for the waters above the heavens to bless God reflects ancient Hebrew cosmology (Gen 1:6–7) and the unity of all creation in praise."
    },
    {
      "pk": 34003062,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 62,
      "text": "'Bless the Lord, all you powers of the Lord, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/103/20'>Ps. 103:20-21</a>; <a href='/AIV/23/148/2'>Ps. 148:2</a>; <a href='/AIV/73/5/11'>Rev. 5:11</a>",
      "comment": "Addressing the 'powers' (heavenly hosts), the hymn recognizes that even spiritual beings are summoned to worship the Lord (cf. Ps 103:20–21)."
    },
    {
      "pk": 34003063,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 63,
      "text": "'Bless the Lord, sun and moon, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/1/1/16'>Gen. 1:16</a>",
      "comment": "The sun and moon, prominent symbols of pagan worship, are called to direct their praise to the true God, asserting monotheistic supremacy."
    },
    {
      "pk": 34003064,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 64,
      "text": "'Bless the Lord, stars of heaven, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/148/3'>Ps. 148:3</a>; <a href='/AIV/1/1/16'>Gen. 1:16</a>; <a href='/AIV/22/38/7'>Job. 38:7</a>",
      "comment": "The stars, often worshiped in Babylonian religion, are depicted as praising the Lord, subverting idolatry through their true purpose."
    },
    {
      "pk": 34003065,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 65,
      "text": "'Bless the Lord, every shower and dew, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/147/8'>Ps. 147:8</a>; <a href='/AIV/5/32/2'>Deut. 32:2</a>; <a href='/AIV/22/38/28'>Job. 38:28</a>",
      "comment": "Natural phenomena like showers and dew bless God, reflecting the comprehensive praise of all creation found in Psalms (cf. Ps 148:8)."
    },
    {
      "pk": 34003066,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 66,
      "text": "'Bless the Lord, all winds, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/148/8'>Ps. 148:8</a>; <a href='/AIV/50/3/8'>John. 3:8</a>; <a href='/AIV/25/1/6'>Eccl. 1:6</a>",
      "comment": "Even the winds—commonly perceived as powerful but unpredictable—submit to and glorify their Creator."
    },
    {
      "pk": 34003067,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 67,
      "text": "'Bless the Lord, fire and heat, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/2/3/2'>Exod. 3:2</a>; <a href='/AIV/5/4/24'>Deut. 4:24</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "Fire and heat, the instruments of attempted destruction, themselves praise the Lord, highlighting God’s sovereignty over elements."
    },
    {
      "pk": 34003068,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 68,
      "text": "'Bless the Lord, dews and falling snow; sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/147/16'>Ps. 147:16-17</a>; <a href='/AIV/22/37/10'>Job. 37:10</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "Cold and chill serve as further witnesses to God's greatness, emphasizing the breadth of creation’s call to worship."
    },
    {
      "pk": 34003069,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 69,
      "text": "'Bless the Lord, ice and cold; sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/22/38/22'>Job. 38:22-23</a>; <a href='/AIV/23/147/16'>Ps. 147:16</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "Even dew and snow, familiar elements in the ancient Near East, are summoned to participate in the cosmic praise."
    },
    {
      "pk": 34003070,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 70,
      "text": "'Bless the Lord, nights and days, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/1/1/5'>Gen. 1:5</a>; <a href='/AIV/23/74/16'>Ps. 74:16</a>; <a href='/AIV/23/104/19'>Ps. 104:19-20</a>",
      "comment": "Nights and days, fundamental markers of time, are personified in giving continuous praise to God."
    },
    {
      "pk": 34003071,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 71,
      "text": "'Bless the Lord, light and darkness, sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/1/1/4'>Gen. 1:4</a>; <a href='/AIV/29/45/7'>Isa. 45:7</a>; <a href='/AIV/23/74/16'>Ps. 74:16</a>",
      "comment": "Light and darkness, often symbolic of good and evil, together acknowledge God’s lordship over all reality (cf. Isa 45:7)."
    },
    {
      "pk": 34003072,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 72,
      "text": "'Bless the Lord, light and darkness; sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/147/17'>Ps. 147:17</a>; <a href='/AIV/22/38/29'>Job. 38:29</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "Ice and frost, adverse and sometimes dangerous phenomena, are included, indicating nothing in creation is outside God’s dominion."
    },
    {
      "pk": 34003073,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 73,
      "text": "'Bless the Lord, lightnings and clouds; sing praise to him and highly exalt him forever.'",
      "links": "<a href='/AIV/23/147/17'>Ps. 147:17</a>; <a href='/AIV/22/38/29'>Job. 38:29</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "Corrected to 'lightnings and clouds' from Greek 'ἀστραπαὶ καὶ νεφέλαι,' matching canonical versions."
    },
    {
      "pk": 34003074,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 74,
      "text": "Let the earth bless the Lord; let it sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/147/16'>Ps. 147:16</a>; <a href='/AIV/22/38/29'>Job. 38:29</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "This verse shifts to a direct imperative, inviting all of creation—the earth itself—to join in the unending praise of the Lord, emphasizing the universal scope of worship."
    },
    {
      "pk": 34003075,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 75,
      "text": "Bless the Lord, mountains and hills; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/74/16'>Ps. 74:16</a>; <a href='/AIV/1/1/5'>Gen. 1:5</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "The invocation shifts from cosmic elements to topographical features, inviting mountains and hills—symbols of grandeur—to join the litany of creation’s praise."
    },
    {
      "pk": 34003076,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 76,
      "text": "Bless the Lord, all that grows in the ground; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/1/1/4'>Gen. 1:4</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "Vegetation—plants and crops—that cover the earth are summoned, acknowledging the breadth of God’s creative act and provision."
    },
    {
      "pk": 34003077,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 77,
      "text": "Bless the Lord, you springs; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/148/8'>Ps. 148:8</a>; <a href='/AIV/2/19/16'>Exod. 19:16</a>; <a href='/AIV/33/1/13'>Ezek. 1:13-14</a>",
      "comment": "Vital sources of water in ancient life, springs are personified as giving continual praise, emphasizing their life-sustaining role and God’s generosity."
    },
    {
      "pk": 34003078,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 78,
      "text": "Bless the Lord, seas and rivers; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "Bodies of water, diverse and powerful, are called to worship, illustrating the totality of creation’s participation in exalting God."
    },
    {
      "pk": 34003079,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 79,
      "text": "Bless the Lord, you whales and all that swim in the waters; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/148/9'>Ps. 148:9</a>; <a href='/AIV/23/65/6'>Ps. 65:6</a>; <a href='/AIV/23/104/32'>Ps. 104:32</a>",
      "comment": "Sea creatures—whales as archetypes of the depths—are invoked to join the universal chorus, affirming God’s dominion over all living things."
    },
    {
      "pk": 34003080,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 80,
      "text": "Bless the Lord, all birds of the air; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/1/1/11'>Gen. 1:11-12</a>; <a href='/AIV/23/104/14'>Ps. 104:14</a>; <a href='/AIV/23/148/9'>Ps. 148:9</a>",
      "comment": "Birds, omnipresent and symbolic of freedom, are gathered in the hymn, representing the worship of all flying creatures."
    },
    {
      "pk": 34003081,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 81,
      "text": "Bless the Lord, all wild animals and cattle; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/104/10'>Ps. 104:10</a>; <a href='/AIV/23/147/18'>Ps. 147:18</a>; <a href='/AIV/23/148/8'>Ps. 148:8</a>",
      "comment": "The scope includes all terrestrial animals, both untamed and domesticated, recognizing the entirety of animate creation."
    },
    {
      "pk": 34003082,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 82,
      "text": "Bless the Lord, all people on earth; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/104/25'>Ps. 104:25</a>; <a href='/AIV/22/38/16'>Job. 38:16</a>; <a href='/AIV/23/148/7'>Ps. 148:7</a>",
      "comment": "The focus shifts to humanity, calling every person to unite in praise of God, showing creation’s climax in human worship."
    },
    {
      "pk": 34003083,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 83,
      "text": "Bless the Lord, O Israel; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/23/148/7'>Ps. 148:7</a>; <a href='/AIV/1/1/20'>Gen. 1:20-21</a>; <a href='/AIV/23/104/26'>Ps. 104:26</a>",
      "comment": "Israel, God’s chosen people, are singled out with a distinct call to worship, highlighting their covenantal role in salvation history."
    },
    {
      "pk": 34003084,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 84,
      "text": "Bless the Lord, you priests of the Lord; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/1/1/20'>Gen. 1:20</a>; <a href='/AIV/23/104/12'>Ps. 104:12</a>; <a href='/AIV/23/148/10'>Ps. 148:10</a>",
      "comment": "Priests—spiritual leaders—are addressed, emphasizing their special duty in offering worship and exemplifying praise for all."
    },
    {
      "pk": 34003085,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 85,
      "text": "Bless the Lord, you servants of the Lord; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/1/1/24'>Gen. 1:24</a>; <a href='/AIV/23/104/14'>Ps. 104:14</a>; <a href='/AIV/23/148/10'>Ps. 148:10</a>",
      "comment": "The focus turns to the Lord’s servants, broadening the call to faithful ministry and obedience in honoring God."
    },
    {
      "pk": 34003086,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 86,
      "text": "Bless the Lord, spirits and souls of the righteous; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/23/148/11'>Ps. 148:11-12</a>; <a href='/AIV/23/8/4'>Ps. 8:4-6</a>",
      "comment": "By singling out the 'spirits and souls of the righteous,' the hymn acknowledges not just mortal bodies or all humanity, but the living and departed who belong to God in righteousness, thus anticipating later Jewish and Christian understandings of the communion of saints."
    },
    {
      "pk": 34003087,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 87,
      "text": "Bless the Lord, you who are holy and humble in heart; sing praise to him and highly exalt him forever.",
      "links": "<a href='/AIV/29/44/1'>Isa. 44:1</a>; <a href='/AIV/23/148/14'>Ps. 148:14</a>; <a href='/AIV/52/9/4'>Rom. 9:4</a>",
      "comment": "The reference to 'holy and humble in heart' underscores the ethical and spiritual requirements for true worship, resonating with prophetic calls to humility and holiness (cf. Micah 6:8), and influencing later Christian spirituality regarding the disposition of worshippers."
    },
    {
      "pk": 34003088,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 88,
      "text": "Bless the Lord, Hananiah, Azariah, and Mishael; sing praise to him and highly exalt him forever. For he has rescued us from Hades and saved us from the power of death, and delivered us from the midst of the burning fiery furnace; from the midst of the fire he has delivered us.",
      "links": "<a href='/AIV/19/134/1'>Ps. 134:1</a>",
      "comment": "This verse functions as both a doxology and narrative aside, identifying the three faithful men by their Hebrew names and linking their deliverance to motifs of resurrection and salvation from death, themes prominent in later Jewish apocalyptic and Christian resurrection theology."
    },
    {
      "pk": 34003089,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 89,
      "text": "Give thanks to the Lord, for he is good, for his mercy endures forever.",
      "links": "<a href='/AIV/23/134/1'>Ps. 134:1</a>; <a href='/AIV/23/135/1'>Ps. 135:1-2</a>; <a href='/AIV/73/7/15'>Rev. 7:15</a>",
      "comment": "The servants of the Lord—likely priests and worshippers—are summoned as leaders of communal worship."
    },
    {
      "pk": 34003090,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 90,
      "text": "All who worship the Lord, bless the God of gods, sing praise to him and give thanks to him, for his mercy endures forever.",
      "links": "<a href='/AIV/19/16/3'>Ps. 16:3</a>",
      "comment": "Acknowledges the spiritual communion of the faithful—anticipates teaching on the communion of saints."
    },
    {
      "pk": 34003091,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 91,
      "text": "Hearing them singing, and amazed at seeing them alive, King Nebuchadnezzar quickly rose up. He said to his counselors, \"Was it not three men that we threw bound into the fire?\" They answered the king, \"True, O king.\"",
      "links": "<a href='/AIV/34/3/24'>Dan. 3:24</a>; <a href='/AIV/51/26/8'>Acts. 26:8</a>; <a href='/AIV/48/16/6'>Mark. 16:6</a>",
      "comment": "Nebuchadnezzar’s astonishment affirms the miraculous deliverance and sets the stage for recognition of God’s supremacy."
    },
    {
      "pk": 34003092,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 92,
      "text": "He replied, \"But I see four men, unbound, walking in the middle of the fire, and they are not hurt; and the fourth has the appearance of a god.\"",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>; <a href='/AIV/34/6/22'>Dan. 6:22</a>; <a href='/AIV/73/1/13'>Rev. 1:13-15</a>",
      "comment": "The presence of a fourth figure 'like a god' (angelic or divine) reveals God’s intimate protection—paralleling angelic deliverances elsewhere (cf. Dan 6:22)."
    },
    {
      "pk": 34003093,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 93,
      "text": "Nebuchadnezzar then approached the door of the furnace of blazing fire and said, \"Shadrach, Meshach, and Abednego, servants of the Most High God, come out! Come here!\" So Shadrach, Meshach, and Abednego came out from the fire.",
      "links": "<a href='/AIV/34/6/20'>Dan. 6:20</a>; <a href='/AIV/51/16/39'>Acts. 16:39</a>; <a href='/AIV/47/8/28'>Matt. 8:28-32</a>",
      "comment": "The king’s acknowledgment and command reflects a transformative moment, recognizing the unique authority of Israel’s God."
    },
    {
      "pk": 34003094,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 94,
      "text": "And the satraps, the prefects, the governors, and the king’s counselors gathered together and saw that the fire had no power over the bodies of those men; the hair of their heads was not singed, their garments were not harmed, and no smell of fire had come upon them.",
      "links": "<a href='/AIV/34/6/23'>Dan. 6:23</a>; <a href='/AIV/29/43/2'>Isa. 43:2</a>; <a href='/AIV/65/11/34'>Heb. 11:34</a>",
      "comment": "The officials witness the total preservation of the Hebrews—an unmistakable sign by which God’s power is made visible to all."
    },
    {
      "pk": 34003095,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 95,
      "text": "Nebuchadnezzar said, \"Blessed be the God of Shadrach, Meshach, and Abednego, who has sent his angel and delivered his servants who trusted in him. They disobeyed the king's command and yielded up their bodies rather than serve and worship any god except their own God.\"",
      "links": "<a href='/AIV/23/34/7'>Ps. 34:7</a>; <a href='/AIV/65/11/34'>Heb. 11:34</a>; <a href='/AIV/51/5/29'>Acts. 5:29</a>",
      "comment": "Nebuchadnezzar blesses the God of the three, declaring their loyalty and God’s deliverance—a powerful testimony against idolatry.",
      "sectionHeader": "The Deliverance from the Furnace"
    },
    {
      "pk": 34003096,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 96,
      "text": "Therefore I make a decree: Any people, nation, or language that speaks against the God of Shadrach, Meshach, and Abednego shall be torn limb from limb, and their houses laid in ruins; for there is no other god who is able to deliver in this way.\"",
      "links": "<a href='/AIV/29/43/11'>Isa. 43:11</a>; <a href='/AIV/51/4/12'>Acts. 4:12</a>; <a href='/AIV/34/6/26'>Dan. 6:26</a>",
      "comment": "Nebuchadnezzar's decree, following the miraculous deliverance of Shadrach, Meshach, and Abednego (cf. Dan 3:28-29), recognizes the unique power of their God; his violent language reflects ancient Near Eastern customs of enforcing royal authority, highlighting the theme that God’s sovereignty surpasses all earthly rulers (cf. Daniel 6:26-27)."
    },
    {
      "pk": 34003097,
      "translation": "AIV",
      "book": 34,
      "bookName": "Daniel",
      "bookAbbreviation": "Dan",
      "chapter": 3,
      "verse": 97,
      "text": "Then the king promoted Shadrach, Meshach, and Abednego in the province of Babylon.",
      "links": "<a href='/AIV/34/2/48'>Dan. 2:48-49</a>; <a href='/AIV/1/41/41'>Gen. 41:41-43</a>; <a href='/AIV/19/6/10'>Esth. 6:10-11</a>",
      "comment": "The promotion is both a reward for faithfulness and evidence of God’s ability to elevate His servants even in exile."
    }
  ],
  "translatedAt": "2026-01-03T03:35:34.290Z",
  "sections": [
    {
      "title": "The Golden Image and the King's Decree",
      "startVerse": 1,
      "endVerse": 7
    },
    {
      "title": "The Refusal of Shadrach, Meshach, and Abednego",
      "startVerse": 8,
      "endVerse": 18
    },
    {
      "title": "The Fiery Furnace",
      "startVerse": 19,
      "endVerse": 31
    },
    {
      "title": "The Prayer of Azariah",
      "startVerse": 32,
      "endVerse": 51
    },
    {
      "title": "The Song of the Three Young Men",
      "startVerse": 52,
      "endVerse": 94
    },
    {
      "title": "The Deliverance from the Furnace",
      "startVerse": 95,
      "endVerse": 100
    }
  ]
}