{
  "book": 27,
  "bookName": "Wisdom",
  "bookAbbreviation": "Wis",
  "chapter": 19,
  "verses": [
    {
      "pk": 27019001,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 1,
      "text": "But the wicked were merciless until the very end, for God knew beforehand even their future actions.",
      "links": "<a href='/AIV/02/14/4'>Ex. 14:4</a>; <a href='/AIV/19/94/11'>Ps. 94:11</a>",
      "comment": "Here, the text emphasizes God's foreknowledge, a key attribute also seen in Psalm 94:11. The persistence of the wicked's hard hearts points to the justice of their ultimate punishment.",
      "sectionHeader": "The Pursuit of the Israelites by the Egyptians"
    },
    {
      "pk": 27019002,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 2,
      "text": "When they allowed Your people to depart and hurried them away, they quickly changed their minds and pursued them.",
      "links": "<a href='/AIV/02/14/5-9'>Ex. 14:5-9</a>",
      "comment": "This recalls Pharaoh's swift reversal after letting Israel go, demonstrating the instability of those opposed to God's will. The Exodus imagery is a prefiguration of liberation from sin."
    },
    {
      "pk": 27019003,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 3,
      "text": "Indeed, while they were still mourning at the graves and lamenting the burial of the dead, they undertook another foolish plan—driven by madness, they pursued as fugitives those whom they had begged to leave.",
      "links": "<a href='/AIV/02/12/30-34'>Ex. 12:30-34</a>",
      "comment": "The verse highlights their irrational behavior, caused by stubbornness and spiritual blindness. This illustrates the dangers of continually rejecting God's invitations to conversion."
    },
    {
      "pk": 27019004,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 4,
      "text": "For the fate they deserved drew them on to this end, and made them forget what had happened, in order that they might fill up the punishment that their torments still lacked,",
      "links": "<a href='/AIV/02/9/16'>Ex. 9:16</a>",
      "comment": "God's sovereignty is underlined, as even the intentions of the wicked are used to fulfill divine purpose. This shows how God's providence governs history."
    },
    {
      "pk": 27019005,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 5,
      "text": "and that your people might experience an incredible journey, but they themselves might meet a strange death.",
      "links": "<a href='/AIV/02/14/17-18'>Ex. 14:17-18</a>",
      "comment": "Their forced pursuit reflects divine justice: refusing free cooperation leads to judgment. There is a spiritual lesson about the importance of responding freely to God's grace."
    },
    {
      "pk": 27019006,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 6,
      "text": "For the whole creation, in its own nature, was fashioned anew, obeying Your commands, so that Your servants could be unharmed.",
      "links": "<a href='/AIV/02/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/19/114/3-7'>Ps. 114:3-7</a>",
      "comment": "Creation responds to God’s command for the sake of His chosen. This echoes the miraculous events at the Red Sea and prefigures Christ’s authority over creation (compare Mark 4:39).",
      "sectionHeader": "God's Protection and Wonders at the Red Sea"
    },
    {
      "pk": 27019007,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 7,
      "text": "A cloud overshadowed the camp, and dry land appeared where before was water; a safe road opened amid the waves, and a green plain sprang out from the surging sea.",
      "links": "<a href='/AIV/02/13/21-22'>Ex. 13:21-22</a>; <a href='/AIV/19/77/19-20'>Ps. 77:19-20</a>",
      "comment": "This poetic retelling of the crossing of the Red Sea accentuates the miraculous care for God’s people—a prefiguration of baptism, passing safely from death to new life."
    },
    {
      "pk": 27019008,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 8,
      "text": "Through which an entire nation passed, protected by Your hand, seeing marvelous wonders.",
      "links": "<a href='/AIV/02/14/29-31'>Ex. 14:29-31</a>",
      "comment": "The nation represents the whole people of God, not just individuals, highlighting the communal aspect of salvation—a theme foundational to a visible, organized church."
    },
    {
      "pk": 27019009,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 9,
      "text": "They were nourished like horses in a pasture, leaped like lambs, giving You praise, O Lord, their Deliverer.",
      "links": "<a href='/AIV/19/114/1-2'>Ps. 114:1-2</a>",
      "comment": "Images of pasture and joy tie to the biblical shepherd imagery and Christ as the Good Shepherd (John 10:11), fostering unity and not isolated individualism."
    },
    {
      "pk": 27019010,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 10,
      "text": "For they still remembered what had happened during their stay: how the earth itself gave birth to swarms of insects instead of cattle, and how the river spewed forth multitudes of frogs instead of fish.",
      "links": "<a href='/AIV/02/8/5-6'>Ex. 8:5-6</a>; <a href='/AIV/02/8/17-18'>Ex. 8:17-18</a>",
      "comment": "A reference to the plagues of Egypt, showing God’s power over nature and judgment on idolatry. The miraculous transformations indicate divine authority over all creation.",
      "sectionHeader": "Remembrance of the Plagues and God's Provision"
    },
    {
      "pk": 27019011,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 11,
      "text": "Later, they saw a new kind of bird, when, led by desire, birds rose up out of the sea to meet their need.",
      "links": "<a href='/AIV/02/16/13'>Ex. 16:13</a>; <a href='/AIV/19/78/27-28'>Ps. 78:27-28</a>",
      "comment": "God provides miraculously in the wilderness, foreshadowing the Eucharist, where bread from heaven sustains the faithful (see John 6:31-35)."
    },
    {
      "pk": 27019012,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 12,
      "text": "for, to give them relief, quails came up from the sea.",
      "links": "<a href='/AIV/2/16/13'>Exod. 16:13</a>; <a href='/AIV/4/11/31'>Num. 11:31-32</a>; <a href='/AIV/23/78/26'>Ps. 78:26-29</a>",
      "comment": "This verse recalls God's miraculous provision of quails to the Israelites in the wilderness (cf. Exodus 16:13; Numbers 11:31), highlighting divine compassion amid judgment and the reversal of suffering through God's providence."
    },
    {
      "pk": 27019013,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 13,
      "text": "The punishments did not come upon the sinners without prior signs in the violence of thunder, for they justly suffered because of their wicked acts; for they practiced a more bitter hatred of strangers.",
      "links": "<a href='/AIV/2/9/23'>Exod. 9:23-26</a>; <a href='/AIV/2/22/21'>Exod. 22:21</a>; <a href='/AIV/5/10/19'>Deut. 10:19</a>",
      "comment": "By referencing thunder as a warning before punishment, the text emphasizes God's justice and the moral necessity of judgment, particularly for nations guilty of extreme xenophobia, echoing the broader biblical theme of hospitality (cf. Leviticus 19:34).",
      "sectionHeader": "Retribution for Inhospitality"
    },
    {
      "pk": 27019014,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 14,
      "text": "Others had refused to receive strangers when they came to them, but these made slaves of guests who were their benefactors.",
      "links": "<a href='/AIV/02/1/13-14'>Ex. 1:13-14</a>",
      "comment": "The reversal is a warning against ingratitude and injustice—a recurring biblical theme. The faithful, even in hardship, are ultimately vindicated."
    },
    {
      "pk": 27019015,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 15,
      "text": "And not only so — but, while punishment of some sort will come upon the former for having received strangers with hostility,",
      "links": "<a href='/AIV/01/47/11-12'>Gen. 47:11-12</a>",
      "comment": "This sharp contrast underscores the unpredictable nature of worldly favor, driving home the importance of faithfulness to God’s covenant, which cannot be broken."
    },
    {
      "pk": 27019016,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 16,
      "text": "the latter, having first received them with festal celebrations, afterward afflicted with terrible sufferings those who had already shared the same rights.",
      "links": "<a href='/AIV/01/47/1-6'>Gen. 47:1-6</a>",
      "comment": "Hospitality and its neglect have deep consequences in salvation history (see Hebrews 13:2). Christians are called to unity and charity in the household of faith."
    },
    {
      "pk": 27019017,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 17,
      "text": "They were stricken also with loss of sight — just as were those at the door of the righteous man — when, surrounded by yawning darkness, all of them tried to find the way through their own doors.",
      "links": "<a href='/AIV/01/47/27'>Gen. 47:27</a>",
      "comment": "The shared rights reflect early images of the one people of God. This unity foreshadows the universal scope of the Church, where all are called together in Christ (see Gal. 3:28)."
    },
    {
      "pk": 27019018,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 18,
      "text": "For the elements changed places with one another, as on a harp the notes vary the nature of the rhythm, while each note remains the same. This may be clearly inferred from the sight of what took place.",
      "links": "<a href='/AIV/2/14/20'>Exod. 14:20-22</a>; <a href='/AIV/27/19/6'>Wis. 19:6</a>; <a href='/AIV/23/114/3'>Ps. 114:3-5</a>",
      "comment": "Employing musical imagery, the verse poetically describes the supernatural reversal of natural order during the plagues; each 'element' retains its essence while acting contrary to usual patterns, symbolizing God's sovereign power over creation (cf. Psalm 104:32).",
      "sectionHeader": "Creation Serving God's Justice"
    },
    {
      "pk": 27019019,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 19,
      "text": "For land animals were transformed into water creatures, and creatures that swim moved over to the land.",
      "links": "<a href='/AIV/2/7/19'>Exod. 7:19-21</a>; <a href='/AIV/23/104/29'>Ps. 104:29-30</a>; <a href='/AIV/27/16/24'>Wis. 16:24</a>",
      "comment": "This verse develops the idea of elemental transformation, vividly portraying the miraculous plagues where natural boundaries are blurred, reinforcing the theme that God can transcend and reshape creation to achieve divine justice (cf. Exodus 7–12)."
    },
    {
      "pk": 27019020,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 20,
      "text": "Fire even in water retained its normal power, and water forgot its fire-quenching nature.",
      "links": "<a href='/AIV/02/16/14-15'>Ex. 16:14-15</a>",
      "comment": "A miraculous reversal, further portraying God as the Lord of creation and prefiguring greater spiritual sacraments yet to come—such as the Bread of Life."
    },
    {
      "pk": 27019021,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 21,
      "text": "Flames, on the contrary, failed to consume the flesh of perishable creatures that walked among them, nor did they melt the crystalline, quick-melting kind of heavenly food.",
      "links": "<a href='/AIV/19/136/24'>Ps. 136:24</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "This verse highlights the miraculous nature of God's provision during the Exodus, notably the protection of manna ('crystalline, quick-melting kind of heavenly food') from being destroyed by fire, emphasizing divine power over natural elements."
    },
    {
      "pk": 27019022,
      "translation": "AIV",
      "book": 27,
      "bookName": "Wisdom",
      "bookAbbreviation": "Wis",
      "chapter": 19,
      "verse": 22,
      "text": "For in every way, O Lord, You have exalted and glorified Your people, and You have not neglected those who are with You at any time or place.",
      "links": "<a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "The promise of God never abandoning His people anticipates Christ’s promise to build and preserve His Church (see Matt. 16:18; 28:20). This endures as a sign of divine faithfulness."
    }
  ],
  "translatedAt": "2026-01-02T06:04:50.109Z",
  "sections": [
    {
      "title": "The Pursuit of the Israelites by the Egyptians",
      "startVerse": 1,
      "endVerse": 5
    },
    {
      "title": "God's Protection and Wonders at the Red Sea",
      "startVerse": 6,
      "endVerse": 9
    },
    {
      "title": "Remembrance of the Plagues and God's Provision",
      "startVerse": 10,
      "endVerse": 12
    },
    {
      "title": "Retribution for Inhospitality",
      "startVerse": 13,
      "endVerse": 17
    },
    {
      "title": "Creation Serving God's Justice",
      "startVerse": 18,
      "endVerse": 22
    }
  ]
}