{
  "book": 6,
  "bookName": "Joshua",
  "bookAbbreviation": "Josh",
  "chapter": 14,
  "sections": [
    {
      "title": "The Allotment of the Land in Canaan",
      "startVerse": 1,
      "endVerse": 14
    },
    {
      "title": "Caleb Receives Hebron",
      "startVerse": 15,
      "endVerse": 15
    }
  ],
  "verses": [
    {
      "pk": 6014001,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 1,
      "text": "These are the inheritances that the people of Israel received in the land of Canaan, which Eleazar the priest, Joshua son of Nun, and the heads of the fathers' houses of the tribes of the Israelites distributed to them.",
      "links": "<a href='/AIV/4/34/17-29'>Num. 34:17-29</a>; <a href='/AIV/6/19/51'>Josh 19:51</a>",
      "comment": "This verse stresses the importance of the priest and leader working together in the distribution of the land. The involvement of Eleazar the priest shows the strong connection between civil leadership and spiritual authority in Israel.",
      "sectionHeader": "The Allotment of the Land in Canaan"
    },
    {
      "pk": 6014002,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 2,
      "text": "Their inheritance was assigned by lot, just as the LORD had commanded through Moses for the nine tribes and the half-tribe.",
      "links": "<a href='/AIV/4/26/55-56'>Num. 26:55-56</a>; <a href='/AIV/6/18/10'>Josh 18:10</a>",
      "comment": "The use of lots reveals that God Himself determines the boundaries. The allotment is understood as an act of divine providence, connecting to the biblical theme that God directs His people in concrete, even ordinary things."
    },
    {
      "pk": 6014003,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 3,
      "text": "For Moses had already given an inheritance to the two and a half tribes beyond the Jordan; but to the Levites he gave no inheritance among them.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>; <a href='/AIV/6/13/14'>Josh 13:14</a>",
      "comment": "The Levites are set apart from other tribes; their inheritance is spiritual rather than material (see Deut 18:1-2). Their unique role foreshadows the New Testament understanding of a priestly people distinct for God's service."
    },
    {
      "pk": 6014004,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 4,
      "text": "For the people of Joseph were two tribes, Manasseh and Ephraim. And no portion was given to the Levites in the land, except cities to dwell in, with their pasture lands for their livestock and their possessions.",
      "links": "<a href='/AIV/1/48/5'>Gen. 48:5</a>; <a href='/AIV/6/21/2'>Josh 21:2</a>",
      "comment": "By dividing Joseph into two tribes, the number remains twelve. The Levites receive only cities, again emphasizing spiritual priorities and service, paralleling how the early Church understood apostolic ministry living among the people."
    },
    {
      "pk": 6014005,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 5,
      "text": "The people of Israel did just as the LORD had commanded Moses; they allotted the land.",
      "links": "<a href='/AIV/4/34/13'>Num. 34:13</a>",
      "comment": "Obedience to God's command is emphasized. This theme points prophetically toward Christ, whose obedience secures the true inheritance for all God’s children (<a href='/AIV/58/5/8-9'>Heb. 5:8-9</a>)."
    },
    {
      "pk": 6014006,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 6,
      "text": "Then the people of Judah came to Joshua at Gilgal. And Caleb the son of Jephunneh the Kenizzite said to him, 'You know what the LORD said to Moses the man of God concerning you and me in Kadesh-barnea.'",
      "links": "<a href='/AIV/4/14/24'>Num. 14:24</a>; <a href='/AIV/5/1/36'>Deut. 1:36</a>",
      "comment": "Caleb’s approach to Joshua at Gilgal brings to mind the continuing importance of personal faith and relationship with God. That Moses is called 'the man of God' illustrates the office and unique authority given to specific mediators."
    },
    {
      "pk": 6014007,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 7,
      "text": "'I was forty years old when Moses the servant of the LORD sent me from Kadesh-barnea to spy out the land, and I brought back word to him as it was in my heart.'",
      "links": "<a href='/AIV/4/13/6'>Num. 13:6</a>",
      "comment": "Caleb’s honesty—speaking 'what was in my heart'—reflects the biblical call for faithfulness and witness, a theme underlying the qualifications for spiritual leadership both in the Old and New Testament."
    },
    {
      "pk": 6014008,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 8,
      "text": "'But my brothers who went up with me made the heart of the people melt; yet I wholly followed the LORD my God.'",
      "links": "<a href='/AIV/4/13/31-33'>Num. 13:31-33</a>",
      "comment": "Caleb’s total fidelity is contrasted with the fear of the others. 'Wholly followed' echoes the absolute devotion expected of God’s people—a type of the call to holiness and perseverance in faith entrusted to the Church (see <a href='/AIV/66/2/10'>Rev. 2:10</a>)."
    },
    {
      "pk": 6014009,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 9,
      "text": "'And Moses swore on that day, saying, “Surely the land on which your foot has trodden shall be an inheritance for you and your children forever, because you have wholly followed the LORD my God.”'",
      "links": "<a href='/AIV/4/14/24'>Num. 14:24</a>; <a href='/AIV/5/1/35-36'>Deut. 1:35-36</a>",
      "comment": "The gift of inheritance is sustained by faithfulness. The promise to one’s descendants foreshadows the way eternal inheritance is passed on through generations of the faithful, echoing the covenant’s enduring nature."
    },
    {
      "pk": 6014010,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 10,
      "text": "'And now, behold, the LORD has kept me alive, just as he said, these forty-five years since the LORD spoke this word to Moses, while Israel wandered in the wilderness. And now, here I am this day, eighty-five years old.'",
      "links": "<a href='/AIV/4/14/30-34'>Num. 14:30-34</a>",
      "comment": "Caleb’s long life is attributed to God’s faithfulness, highlighting the spiritual principle that God sustains His servants. The motif of fulfillment after years of trial provides a parallel to endurance rewarded, as found in New Testament promises."
    },
    {
      "pk": 6014011,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 11,
      "text": "'I am still as strong today as I was in the day that Moses sent me; my strength now is as my strength was then, for war and for going out and coming in.'",
      "links": "<a href='/AIV/5/34/7'>Deut. 34:7</a>",
      "comment": "This physical vigor in old age underscores God’s ongoing empowerment of those who are faithful. It reminds us that spiritual vigor matters as much as physical, relating to the call to endure and serve robustly even in later years."
    },
    {
      "pk": 6014012,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 12,
      "text": "'So now give me this hill country of which the LORD spoke on that day. For you heard on that day how the Anakim were there, with great fortified cities. It may be that the LORD will be with me, and I shall drive them out just as the LORD said.'",
      "links": "<a href='/AIV/4/13/28'>Num. 13:28</a>; <a href='/AIV/6/15/14'>Josh 15:14</a>",
      "comment": "Caleb’s request for the hill country (Hebron) reflects confidence in God’s word over human obstacles. This faith for conquest mirrors the courage needed to take spiritual territory in the New Covenant, trusting in divine presence and promise."
    },
    {
      "pk": 6014013,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 13,
      "text": "Then Joshua blessed him, and gave Hebron to Caleb the son of Jephunneh for an inheritance.",
      "links": "<a href='/AIV/6/21/12'>Josh 21:12</a>",
      "comment": "Joshua’s blessing and giving of land is a solemn act, echoing the practice of bestowing spiritual and physical blessings through authoritative leaders, as seen in later acts of laying on of hands (<a href='/AIV/44/13/3'>Acts 13:3</a>), a sign of God’s favor and commissioning."
    },
    {
      "pk": 6014014,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 14,
      "text": "Therefore Hebron became the inheritance of Caleb the son of Jephunneh the Kenizzite to this day, because he wholly followed the LORD, the God of Israel.",
      "links": "<a href='/AIV/6/21/12'>Josh 21:12</a>",
      "comment": "This verse again credits faithfulness as the condition for inheritance—underscoring that covenant blessings are realized through steadfast obedience, a key biblical theme echoed throughout the Scriptures."
    },
    {
      "pk": 6014015,
      "translation": "AIV",
      "book": 6,
      "bookName": "Joshua",
      "bookAbbreviation": "Josh",
      "chapter": 14,
      "verse": 15,
      "text": "Now the name of Hebron formerly was Kiriath-arba; Arba was the greatest man among the Anakim. And the land had rest from war.",
      "links": "<a href='/AIV/1/23/2'>Gen. 23:2</a>; <a href='/AIV/6/11/23'>Josh 11:23</a>",
      "comment": "The historical note about Hebron’s former name stresses the complete transformation through God’s promise. The rest from war foreshadows the ultimate rest promised to God’s faithful in Christ (<a href='/AIV/58/4/8-11'>Heb. 4:8-11</a>).",
      "sectionHeader": "Caleb Receives Hebron"
    }
  ],
  "translatedAt": "2025-12-28T02:13:07.791Z"
}