{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 10,
  "verses": [
    {
      "pk": 17010001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 1,
      "text": "Meanwhile, Tobit was counting each day that Tobias was delayed. When many days had passed and Tobias did not return, Tobit said, 'Could something have happened? Has he been detained, or has Gabael died and no one returned the money?'",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>; <a href='/AIV/17/1/15'>Tobit 1:15</a>",
      "comment": "Tobit's anxiety for his son and the awaited repayment echoes the theme of trust in God's providence. Like Abraham waiting for Isaac (Genesis 22), Tobit must trust through uncertainty.",
      "sectionHeader": "Tobit and Anna Mourn the Delay of Tobias"
    },
    {
      "pk": 17010002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 2,
      "text": "And he became very troubled.",
      "links": "<a href='/AIV/18/6/26'>Job 6:26</a>; <a href='/AIV/19/77/3'>Ps. 77:3</a>",
      "comment": "The distress of Tobit highlights the human experience of worry and waiting. Note Job’s similar emotional struggle (Job 6:26) and the Psalms’ expressions of sorrow (Psalm 77:3)."
    },
    {
      "pk": 17010003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 3,
      "text": "Anna, his wife, said, 'My son has perished.' But Tobit replied, 'Be still and do not be troubled. He is safe.'",
      "links": "<a href='/AIV/17/5/18'>Tobit 5:18-22</a>; <a href='/AIV/45/4/20'>Rom. 4:20</a>",
      "comment": "Anna’s maternal concern contrasts Tobit’s reassurance rooted in faith. The call to trust echoes Abraham’s unwavering hope (Romans 4:20), subtly encouraging confidence in the unseen workings of God."
    },
    {
      "pk": 17010004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 4,
      "text": "But Anna went out every day along the road by which they had departed, and she watched the road. Evening would fall, and then she would go home, and mourn and weep, grieving deeply for her son.",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Anna’s persistent longing mirrors the heart of the father in the parable of the prodigal son (Luke 15:20), showing parental love as a reflection of God’s own mercy and readiness to embrace the repentant."
    },
    {
      "pk": 17010005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 5,
      "text": "But Tobit grieved for his son each day, remembering how his journey had been dangerous. He said, 'Why has my son delayed? Might he have been harmed there?'",
      "links": "<a href='/AIV/19/142/2'>Ps. 142:2</a>; <a href='/AIV/17/6/1-6'>Tobit 6:1-6</a>",
      "comment": "Tobit’s ongoing grief is a reminder that even those strong in faith encounter worry, similar to David’s laments (Psalm 142:2). That anxious love provides a window into God’s own concern for us."
    },
    {
      "pk": 17010006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 6,
      "text": "But Tobit kept saying to her, \"Be quiet and do not worry, my dear; he is safe. Perhaps something unexpected has happened. The man who went with him is trustworthy and is one of our own relatives. Do not grieve, my dear; he will be home soon.\"",
      "links": "<a href='/AIV/1/43/13'>Gen. 43:13-14</a>; <a href='/AIV/28/2/6'>Sir. 2:6</a>; <a href='/AIV/57/4/6'>Phil. 4:6-7</a>",
      "comment": "Tobit's attempt to reassure Anna reflects the patriarchal expectation for husbands to contain anxiety and offer hope, much as Jacob did when his sons went to Egypt (Genesis 43:14); here faith in kinship and divine providence undergirds Tobit’s trust in Raphael as a trustworthy intermediary.",
      "sectionHeader": "Tobias Prepares to Return with Sarra"
    },
    {
      "pk": 17010007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 7,
      "text": "She answered him, \"Be quiet yourself! Stop trying to deceive me! My child has perished.\" Every day she would rush out and watch the road by which her son had departed, and would heed no one. When the sun set she would go in and mourn and weep all night long, unable to sleep at all.",
      "links": "<a href='/AIV/1/37/34'>Gen. 37:34-35</a>; <a href='/AIV/30/31/15'>Jer. 31:15</a>; <a href='/AIV/49/15/20'>Luke. 15:20</a>",
      "comment": "Anna's grief highlights the maternal vulnerability often seen in biblical narratives (cf. Genesis 37:35; Jeremiah 31:15), underscoring human anguish and the struggle to trust God’s unseen care; her daily vigil illustrates deep familial love and anxiety in diaspora settings."
    },
    {
      "pk": 17010008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 8,
      "text": "Tobias replied, 'I cannot stay, for my father and mother will be anxious. Let me go home.'",
      "links": "<a href='/AIV/42/2/49'>Luke 2:49'</a>; <a href='/AIV/17/5/22'>Tobit 5:22</a>",
      "comment": "Tobias’ eagerness to return reflects Christ’s urgency in fulfilling His mission and obeying His Father (Luke 2:49). The obedience of the son to the parents highlights the significance of the fourth commandment."
    },
    {
      "pk": 17010009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 9,
      "text": "But Tobias said, 'No! I beg you to send me back to my father.'",
      "links": "<a href='/AIV/17/7/13-14'>Tobit 7:13-14</a>; <a href='/AIV/19/112/3'>Ps. 112:3</a>",
      "comment": "The transfer of wealth and blessing at marriage reflects covenantal faithfulness and echoes biblical patterns of inheritance and provision (Psalm 112:3)."
    },
    {
      "pk": 17010010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 10,
      "text": "So Raguel promptly gave Tobias his wife Sarah, as well as half of all his property: male and female slaves, oxen and sheep, donkeys and camels, clothing, money, and household goods.",
      "links": "<a href='/AIV/17/8/21'>Tobit 8:21</a>; <a href='/AIV/1/28/4'>Gen. 28:4</a>",
      "comment": "Raguel’s blessing invokes God as the source of security and peace, reminiscent of patriarchal blessings (Genesis 28:4). The emphasis on God’s providence prepares readers to grasp the sacramental reality of blessing."
    },
    {
      "pk": 17010011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 11,
      "text": "Then he saw them safely off; he embraced Tobias and said, 'Farewell, my child; have a safe journey. The Lord of heaven prosper you and your wife Sarah, and may I see children of yours before I die.'",
      "links": "<a href='/AIV/17/7/16'>Tobit 7:16</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "The close relationship among Edna, Sarra, and Tobias shows the importance of family unity during times of transition, pointing to the spiritual support found within the believing community."
    },
    {
      "pk": 17010012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 12,
      "text": "Then he kissed his daughter Sarah and said to her, 'My daughter, honor your father-in-law and your mother-in-law, since from now on they are as much your parents as those who gave you birth. Go in peace, daughter, and may I hear a good report about you as long as I live.' Then he bade them farewell and let them go. Then Edna said to Tobias, 'My child and dear brother, the Lord of heaven bring you back safely, and may I live long enough to see children of you and of my daughter Sarah before I die. In the sight of the Lord I entrust my daughter to you; do nothing to grieve her all the days of your life. Go in peace, my child. From now on I am your mother and Sarah is your beloved wife. May we all prosper together all the days of our lives.' Then she kissed them both and saw them safely off.",
      "links": "<a href='/AIV/19/128/6'>Ps. 128:6</a>; <a href='/AIV/1/50/23'>Gen. 50:23</a>",
      "comment": "The longing to see grandchildren is a biblical theme (Psalm 128:6; Genesis 50:23), symbolizing hope for blessing and continuity within God’s people—a hint at the spiritual fruitfulness promised to those who remain in the covenant."
    },
    {
      "pk": 17010013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 13,
      "text": "Tobias parted from Raguel with happiness and joy, praising the Lord of heaven and earth, King over all, because he had made his journey a success. Finally, he blessed Raguel and his wife Edna, and said, 'I have been commanded by the Lord to honor you all the days of my life.'",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/41/7/10'>Mark 7:10</a>",
      "comment": "Raguel charges Sarra to honor her new parents, tying in the commandment to honor one’s father and mother (Exodus 20:12; Mark 7:10). This deepens the theology of obedience and familial authority, which foreshadows the Church’s structure and spiritual parenthood."
    },
    {
      "pk": 17010014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 14,
      "text": "He blessed them and said, 'May the Lord of heaven protect you all the days of your life.'",
      "links": "<a href='/AIV/19/121/7-8'>Ps. 121:7-8</a>; <a href='/AIV/17/12/20'>Tobit 12:20</a>",
      "comment": "The closing blessing invokes lasting divine protection, much like the priestly blessing (Psalm 121:7-8). This foreshadows the practice of blessing in the liturgical tradition, preparing hearts for a deeper appreciation of sacramental grace."
    }
  ],
  "translatedAt": "2025-12-28T23:45:15.710Z",
  "sections": [
    {
      "title": "Tobit and Anna Mourn the Delay of Tobias",
      "startVerse": 1,
      "endVerse": 5
    },
    {
      "title": "Tobias Prepares to Return with Sarra",
      "startVerse": 6,
      "endVerse": 14
    }
  ]
}