{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 4,
  "verses": [
    {
      "pk": 17004001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 1,
      "text": "That day, Tobit remembered the silver he had deposited with Gabael at Rhages in Media, and he said to himself,",
      "links": "<a href='/AIV/17/1/14'>Tob. 1:14</a>; <a href='/AIV/17/4/20'>Tob. 4:20</a>",
      "comment": "Tobit is mindful of his family’s well-being and seeks to secure their future, a recurring theme in wisdom literature. See also Proverbs 13:22 for similar concern.",
      "sectionHeader": "Tobit Prepares for Death"
    },
    {
      "pk": 17004002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 2,
      "text": "\"I have asked for death; why don’t I call my son Tobias and explain all this to him before I die?\"",
      "links": "<a href='/AIV/17/3/6'>Tob. 3:6</a>; <a href='/AIV/1/49/29'>Gen. 49:29</a>",
      "comment": "Tobit’s wish to instruct his son parallels the patriarchal blessings in Genesis 49, showing the importance of passing on wisdom and faith before death."
    },
    {
      "pk": 17004003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 3,
      "text": "So he called his son Tobias. When Tobias came, he said, \"My son, when I die, bury me properly. Honor your mother, and do not neglect her all the days of her life. Remember how many dangers she endured for you while you were in her womb.\"",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/26/17'>Deut. 26:17</a>",
      "comment": "Tobit’s command echoes the fourth commandment, to honor one’s parents. The stress on burial mirrors the care for the body found in Jewish and early Christian tradition.",
      "sectionHeader": "Tobit's Instructions and Counsel to Tobias"
    },
    {
      "pk": 17004004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 4,
      "text": "When she dies, bury her beside me in the same grave.",
      "links": "<a href='/AIV/1/23/19'>Gen. 23:19</a>; <a href='/AIV/1/25/9'>Gen. 25:9</a>",
      "comment": "Family burial reflects the significance of family unity even after death, as seen with the patriarchs Abraham and Sarah."
    },
    {
      "pk": 17004005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 5,
      "text": "My son, remember the Lord our God all your days. Refuse to sin, and do what is right all your life. Do not walk in the ways of wrongdoing.",
      "links": "<a href='/AIV/20/3/6'>Prov. 3:6</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Echoes wisdom tradition (Proverbs, Psalms), emphasizing constant faithfulness and avoidance of sin."
    },
    {
      "pk": 17004006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 6,
      "text": "If you do what is true, you will prosper in your works, as everyone who acts in truth will.",
      "links": "<a href='/AIV/5/28/1'>Deut. 28:1</a>; <a href='/AIV/19/37/3'>Ps. 37:3</a>",
      "comment": "This principle of blessing for righteousness is a repeated theme in covenant theology."
    },
    {
      "pk": 17004007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 7,
      "text": "Give alms from your possessions to all who live uprightly, and do not let your eye begrudge the gift when you give. Do not turn your face away from any poor person, and the face of God will not be turned away from you.",
      "links": "<a href='/AIV/20/19/17'>Prov. 19:17</a>; <a href='/AIV/40/6/3-4'>Matt. 6:3-4</a>",
      "comment": "Generosity to the poor is a major biblical theme, further echoed by Jesus in the Gospels (Matt. 6), showing how charity draws us closer to God's presence."
    },
    {
      "pk": 17004008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 8,
      "text": "If you have much, give more in proportion; if you have little, do not be afraid to give according to that little.",
      "links": "<a href='/AIV/42/21/1-4'>Luke 21:1-4</a>; <a href='/AIV/47/8/12'>2 Cor. 8:12</a>",
      "comment": "Giving is not measured by amount but by sacrifice and intention, as Christ teaches in the parable of the widow’s mite."
    },
    {
      "pk": 17004009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 9,
      "text": "In this way you will be laying up a good store for yourself against the day of necessity.",
      "links": "<a href='/AIV/40/6/19-20'>Matt. 6:19-20</a>; <a href='/AIV/54/6/18-19'>1 Tim. 6:18-19</a>",
      "comment": "The connection between charity and God’s future reward ties into Jesus' teaching on storing up treasures in heaven, suggesting a visible link between earthly actions and eternal destiny."
    },
    {
      "pk": 17004010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 10,
      "text": "For charity delivers from death and keeps one from entering the darkness.",
      "links": "<a href='/AIV/60/4/8'>1 Pet. 4:8</a>; <a href='/AIV/20/10/2'>Prov. 10:2</a>",
      "comment": "Good works, especially charity, are described as a means of spiritual preservation; this aligns with the teaching that faith and love work together in salvation (cf. James 2:14-17)."
    },
    {
      "pk": 17004011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 11,
      "text": "Indeed, almsgiving, for all who practice it, is an excellent offering in the presence of the Most High.",
      "links": "<a href='/AIV/24/19/17'>Prov. 19:17</a>; <a href='/AIV/28/3/30'>Sir. 3:30</a>; <a href='/AIV/47/6/1'>Matt. 6:1-4</a>",
      "comment": "Almsgiving is commended as a sacrificial act pleasing to God, reflecting wisdom literature’s emphasis on charity (see Sirach 3:30); it connects material generosity with spiritual reward before the Most High."
    },
    {
      "pk": 17004012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 12,
      "text": "Beware, my son, of every kind of fornication. First of all, marry a woman from among the descendants of your ancestors; do not marry a foreign woman, who is not of your father’s tribe; for we are the descendants of the prophets. Remember, my son, that Noah, Abraham, Isaac, and Jacob, our ancestors of old, all took wives from among their kindred. They were blessed in their children, and their posterity will inherit the land.",
      "links": "<a href='/AIV/1/24/3'>Gen. 24:3-4</a>; <a href='/AIV/1/28/1'>Gen. 28:1-2</a>; <a href='/AIV/15/9/1'>Ezra. 9:1-2</a>",
      "comment": "Tobit urges endogamy to preserve faith and covenant identity, recalling Genesis patriarchs’ marriages within their kin; such warnings reflect concerns over assimilation and fidelity, seen also in Ezra-Nehemiah."
    },
    {
      "pk": 17004013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 13,
      "text": "So now, my son, love your kindred, and in your heart do not disdain your kindred, the sons and daughters of your people, by refusing to take a wife for yourself from among them. For in pride there is ruin and great confusion. And in idleness there is loss and dire poverty, because idleness is the mother of famine.",
      "links": "<a href='/AIV/24/13/10'>Prov. 13:10</a>; <a href='/AIV/24/19/15'>Prov. 19:15</a>; <a href='/AIV/28/10/13'>Sir. 10:13</a>",
      "comment": "This verse critiques pride and idleness, associating them with social disorder and poverty; the linkage between diligence and blessing echoes Proverbs (e.g., Proverbs 6:6-11) and underscores community solidarity."
    },
    {
      "pk": 17004014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 14,
      "text": "If you serve God, you will be repaid. Watch yourself in all your actions, and act with discipline in your conduct.",
      "links": "<a href='/AIV/58/13/16'>Heb. 13:16</a>; <a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "Ties diligence in both faith and works to God’s reward; echoes New Testament calls to self-discipline and active faith."
    },
    {
      "pk": 17004015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 15,
      "text": "Do not do to anyone what you would not want done to you. Do not drink wine till you become drunk, and do not let drunkenness accompany you on your journey.",
      "links": "<a href='/AIV/40/7/12'>Matt. 7:12</a>; <a href='/AIV/20/23/20'>Prov. 23:20</a>",
      "comment": "This verse teaches the 'Golden Rule,' a key principle reiterated by Jesus as foundational to the Law and Prophets."
    },
    {
      "pk": 17004016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 16,
      "text": "Give your bread to the hungry and your clothes to those in need. Give alms from all your possessions, and do not hesitate to share them.",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>; <a href='/AIV/40/25/35'>Matt. 25:35</a>",
      "comment": "Almsgiving and works of mercy foreshadow Christ’s teaching in Matthew 25, where caring for the poor is equated to serving Christ himself."
    },
    {
      "pk": 17004017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 17,
      "text": "Place your bread and wine on the graves of the righteous, but do not give to sinners.",
      "links": "<a href='/AIV/2/29/41'>Ex. 29:41</a>; <a href='/AIV/21/9/7'>Eccl. 9:7</a>",
      "comment": "Ancient Jewish practice included acts of remembrance and intercession for the dead; this subtly underscores the value of praying for those who have gone before us."
    },
    {
      "pk": 17004018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 18,
      "text": "Seek counsel from every wise person, and do not despise any useful advice.",
      "links": "<a href='/AIV/20/11/14'>Prov. 11:14</a>; <a href='/AIV/20/15/22'>Prov. 15:22</a>",
      "comment": "Highlights the importance of listening to tradition and the wisdom of elders, which is a key theme of biblical discipleship."
    },
    {
      "pk": 17004019,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 19,
      "text": "At all times bless the Lord God, ask Him to make your paths straight, and to prosper all your plans and purposes. No nation possesses wisdom, but only the Lord Himself gives it. He brings down whomever He chooses to the underworld, and raises up others to the light.",
      "links": "<a href='/AIV/19/25/4'>Ps. 25:4</a>; <a href='/AIV/20/21/30'>Prov. 21:30</a>",
      "comment": "God’s providence is supreme; wisdom and guidance come from constant prayer and trust in God’s sovereignty."
    },
    {
      "pk": 17004020,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 20,
      "text": "And now, my son, let me explain to you that I left ten talents of silver in trust with Gabael son of Gabrias, at Rages in Media.",
      "links": "<a href='/AIV/17/1/14'>Tob. 1:14</a>; <a href='/AIV/17/4/1'>Tob. 4:1</a>; <a href='/AIV/17/5/3'>Tob. 5:3</a>",
      "comment": "Tobit entrusts valuable silver with a fellow Israelite in exile, demonstrating communal bonds and prudent stewardship vital for diaspora survival (compare Joseph’s management in Genesis 41:39-44)."
    },
    {
      "pk": 17004021,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 4,
      "verse": 21,
      "text": "Do not be afraid, my son, that although we have become poor, you possess great wealth if you fear God, avoid every sin, and do what is pleasing in His sight.\"",
      "links": "<a href='/AIV/40/6/33'>Matt. 6:33</a>; <a href='/AIV/19/34/9'>Ps. 34:9</a>",
      "comment": "True riches are found in devotion to God and upright living, echoing Christ’s teaching that godliness surpasses material wealth. The notion also hints at spiritual inheritance, pointing toward a more sacramental understanding of God’s gracious provision."
    }
  ],
  "translatedAt": "2025-12-28T07:01:29.748Z",
  "sections": [
    {
      "title": "Tobit Prepares for Death",
      "startVerse": 1,
      "endVerse": 2
    },
    {
      "title": "Tobit's Instructions and Counsel to Tobias",
      "startVerse": 3,
      "endVerse": 21
    }
  ]
}