{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 10,
  "verses": [
    {
      "pk": 17010001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 1,
      "text": "Now, day by day, Tobit kept counting how many days Tobias would need for going and for returning. And when the days had passed and his son did not appear,",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>; <a href='/AIV/17/1/15'>Tobit 1:15</a>",
      "comment": "Separated narration from dialogue and ensured a standalone verse as in source text.",
      "sectionHeader": "Tobit and Anna Mourn the Delay of Tobias"
    },
    {
      "pk": 17010002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 2,
      "text": "he said, \"Is it possible that he has been detained? Or that Gabael has died, and there is no one to give him the money?\"",
      "comment": "Restored Tobit's questioning and emotional context, matching reference verse.",
      "links": "<a href='/AIV/17/10/2'>Tob. 10:2</a>"
    },
    {
      "pk": 17010003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 3,
      "text": "And he began to worry.",
      "links": "<a href='/AIV/17/5/18'>Tobit 5:18-22</a>; <a href='/AIV/45/4/20'>Rom. 4:20</a>",
      "comment": "Anna’s maternal concern contrasts Tobit’s reassurance rooted in faith. The call to trust echoes Abraham’s unwavering hope (Romans 4:20), subtly encouraging confidence in the unseen workings of God."
    },
    {
      "pk": 17010004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 4,
      "text": "His wife Anna said, \"My child has perished and is no longer among the living.\" And she began to weep and mourn for her son, saying,",
      "links": "<a href='/AIV/17/5/22'>Tobit 5:22</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Anna’s persistent longing mirrors the heart of the father in the parable of the prodigal son (Luke 15:20), showing parental love as a reflection of God’s own mercy and readiness to embrace the repentant."
    },
    {
      "pk": 17010005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 5,
      "text": "“Woe to me, my child, the light of my eyes, that I let you make the journey.”",
      "links": "<a href='/AIV/19/142/2'>Ps. 142:2</a>; <a href='/AIV/17/6/1-6'>Tobit 6:1-6</a>",
      "comment": "Anna's lament, with its poetic metaphor 'light of my eyes,' reflects the deep maternal affection and anxiety over a long absence, paralleling motifs of mourning found throughout the biblical tradition. The inclusion of this lament emphasizes the emotional cost borne by families in diaspora and exile."
    },
    {
      "pk": 17010006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 6,
      "text": "But Tobit kept saying to her, \"Be quiet and do not worry, my dear; he is safe. Perhaps something unexpected has happened. The man who went with him is trustworthy and is one of our own relatives. Do not grieve, my dear; he will be home soon.\"",
      "links": "<a href='/AIV/1/43/13'>Gen. 43:13-14</a>; <a href='/AIV/28/2/6'>Sir. 2:6</a>; <a href='/AIV/57/4/6'>Phil. 4:6-7</a>",
      "comment": "Tobit's attempt to reassure Anna reflects the patriarchal expectation for husbands to contain anxiety and offer hope, much as Jacob did when his sons went to Egypt (Genesis 43:14); here faith in kinship and divine providence undergirds Tobit’s trust in Raphael as a trustworthy intermediary.",
      "sectionHeader": "Tobias Prepares to Return with Sarra"
    },
    {
      "pk": 17010007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 7,
      "text": "She answered him, \"Be quiet yourself! Stop trying to deceive me! My child has perished.\" Every day she would rush out and watch the road by which her son had departed, and would heed no one. When the sun set she would go in and mourn and weep all night long, unable to sleep at all.",
      "links": "<a href='/AIV/1/37/34'>Gen. 37:34-35</a>; <a href='/AIV/30/31/15'>Jer. 31:15</a>; <a href='/AIV/49/15/20'>Luke. 15:20</a>",
      "comment": "Anna's grief highlights the maternal vulnerability often seen in biblical narratives (cf. Genesis 37:35; Jeremiah 31:15), underscoring human anguish and the struggle to trust God’s unseen care; her daily vigil illustrates deep familial love and anxiety in diaspora settings."
    },
    {
      "pk": 17010008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 8,
      "text": "But Raguel said to Tobias, 'Stay, my child, stay with me; I will send messengers to your father Tobit and they will inform him about you.'",
      "links": "<a href='/AIV/42/2/49'>Luke 2:49'</a>; <a href='/AIV/17/5/22'>Tobit 5:22</a>",
      "comment": "Raguel's offer to send messengers demonstrates ancient Near Eastern customs of hospitality and reassurance, aiming to alleviate the concerns of absent family members. This also shows the development of social bonds between the families through marriage, underlining the importance of community and communication even across great distances."
    },
    {
      "pk": 17010009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 9,
      "text": "But Tobias said, 'No! I beg you to send me back to my father.'",
      "links": "<a href='/AIV/17/7/13-14'>Tobit 7:13-14</a>; <a href='/AIV/19/112/3'>Ps. 112:3</a>",
      "comment": "The transfer of wealth and blessing at marriage reflects covenantal faithfulness and echoes biblical patterns of inheritance and provision (Psalm 112:3)."
    },
    {
      "pk": 17010010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 10,
      "text": "So Raguel promptly gave Tobias his wife Sarah, as well as half of all his property: male and female slaves, oxen and sheep, donkeys and camels, clothing, money, and household goods.",
      "links": "<a href='/AIV/17/8/21'>Tobit 8:21</a>; <a href='/AIV/1/28/4'>Gen. 28:4</a>",
      "comment": "Raguel’s blessing invokes God as the source of security and peace, reminiscent of patriarchal blessings (Genesis 28:4). The emphasis on God’s providence prepares readers to grasp the sacramental reality of blessing."
    },
    {
      "pk": 17010011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 11,
      "text": "Then he saw them safely off; he embraced Tobias and said, 'Farewell, my child; have a safe journey. The Lord of heaven prosper you and your wife Sarah, and may I see children of yours before I die.'",
      "links": "<a href='/AIV/17/7/16'>Tobit 7:16</a>; <a href='/AIV/19/30/5'>Ps. 30:5</a>",
      "comment": "The close relationship among Edna, Sarra, and Tobias shows the importance of family unity during times of transition, pointing to the spiritual support found within the believing community."
    },
    {
      "pk": 17010012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 12,
      "text": "Then he kissed his daughter Sarah and said to her, 'My daughter, honor your father-in-law and your mother-in-law, since from now on they are as much your parents as those who gave you birth. Go in peace, daughter, and may I hear a good report about you as long as I live.' Then he bade them farewell and let them go. Then Edna said to Tobias, 'My child and dear brother, the Lord of heaven bring you back safely, and may I live long enough to see children of you and of my daughter Sarah before I die. In the sight of the Lord I entrust my daughter to you; do nothing to grieve her all the days of your life. Go in peace, my child. From now on I am your mother and Sarah is your beloved wife. May we all prosper together all the days of our lives.' Then she kissed them both and saw them safely off.",
      "links": "<a href='/AIV/19/128/6'>Ps. 128:6</a>; <a href='/AIV/1/50/23'>Gen. 50:23</a>",
      "comment": "The longing to see grandchildren is a biblical theme (Psalm 128:6; Genesis 50:23), symbolizing hope for blessing and continuity within God’s people—a hint at the spiritual fruitfulness promised to those who remain in the covenant."
    },
    {
      "pk": 17010013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 10,
      "verse": 13,
      "text": "Tobias parted from Raguel with happiness and joy, praising the Lord of heaven and earth, King over all, because he had made his journey a success. Finally, he blessed Raguel and his wife Edna, and said, 'I have been commanded by the Lord to honor you all the days of my life.'",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/41/7/10'>Mark 7:10</a>",
      "comment": "Raguel charges Sarra to honor her new parents, tying in the commandment to honor one’s father and mother (Exodus 20:12; Mark 7:10). This deepens the theology of obedience and familial authority, which foreshadows the Church’s structure and spiritual parenthood."
    }
  ],
  "translatedAt": "2026-01-03T11:55:21.708Z",
  "sections": [
    {
      "title": "Tobit and Anna Mourn the Delay of Tobias",
      "startVerse": 1,
      "endVerse": 5
    },
    {
      "title": "Tobias Prepares to Return with Sarra",
      "startVerse": 6,
      "endVerse": 14
    }
  ]
}