{
  "book": 17,
  "bookName": "Tobit",
  "bookAbbreviation": "Tob",
  "chapter": 8,
  "sections": [
    {
      "title": "Tobias and Sarah in the Bridal Chamber",
      "startVerse": 1,
      "endVerse": 21
    }
  ],
  "verses": [
    {
      "pk": 17008001,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 1,
      "text": "When they had finished eating and drinking, they wanted to go to bed. So they took the young man and led him to the bedroom.",
      "links": "<a href='/AIV/17/7/16'>Tob 7:16</a>",
      "comment": "The narrative continues from the wedding feast as customary in Jewish weddings, and the formal escort to the bridal chamber signals the start of married life.",
      "sectionHeader": "Tobias and Sarah in the Bridal Chamber"
    },
    {
      "pk": 17008002,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 2,
      "text": "But Tobias, remembering Raphael's instructions, took the fish's liver and heart from his bag and placed them on the embers of the incense.",
      "links": "<a href='/AIV/17/6/8-9'>Tob 6:8-9</a>; <a href='/AIV/2/30/1'>Exod 30:1</a>",
      "comment": "The use of the fish's organs on the coals is an act of both faith and obedience to the angel's guidance, symbolizing the power of prayer combined with action."
    },
    {
      "pk": 17008003,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 3,
      "text": "The smell from the fish drove the demon away from them, and he fled to the farthest parts of Egypt. Raphael chased him and bound him there at once.",
      "links": "<a href='/AIV/17/6/7-8'>Tob 6:7-8</a>; <a href='/AIV/3/7/1'>Gen 7:1</a>",
      "comment": "The story highlights angelic ministry and the power of ritual acts authorized by God's messenger. There's a spiritual warfare aspect, paralleling the New Testament concept of resisting evil with both prayer and sacramental signs."
    },
    {
      "pk": 17008004,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 4,
      "text": "When the parents had gone out and shut the door of the room, Tobias got out of bed and said to Sarah, \"Sister, get up, and let us pray and implore our Lord that he grant us mercy and safety.\"",
      "links": [
        "Gen 24:12",
        "Matt 18:19",
        "Sir 7:31"
      ],
      "comment": "Tobias’s call to prayer before consummating his marriage reflects both piety and caution, acknowledging dependence on God’s mercy amid fear, especially given Sarah’s tragic marital history (cf. Tobit 6:16-17); this demonstrates an integration of faith into intimate areas of life, echoing the practice of seeking God’s favor as seen in Genesis 24:12."
    },
    {
      "pk": 17008005,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 5,
      "text": "Tobias said, 'Blessed are you, O God of our fathers, and blessed is your name forever and ever. Let the heavens and all your creatures bless you.'",
      "links": "<a href='/AIV/19/145/21'>Ps 145:21</a>; <a href='/AIV/27/2/20'>Dan 2:20</a>",
      "comment": "Tobias’ prayer echoes the doxologies found throughout the Psalms, reminding believers to begin every venture by blessing God. There’s a Christological undertone—a married couple as a type of Christ and His Church (<a href='/AIV/49/5/31-32'>Eph 5:31-32</a>)."
    },
    {
      "pk": 17008006,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 6,
      "text": "You made Adam and gave him Eve his wife as a helper and support. From them the human race has come. You said, ‘It is not good that the man should be alone; let us make a helper for him like himself.’",
      "links": "<a href='/AIV/1/2/18-22'>Gen 2:18-22</a>",
      "comment": "Tobias acknowledges the divine institution of marriage rooted in creation, connecting their union to the same act by which God joined Adam and Eve—a clear affirmation of marriage as a sacred institution."
    },
    {
      "pk": 17008007,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 7,
      "text": "Now, Lord, I do not take this my sister for lust, but in sincerity. Grant that we may find mercy, and may grow old together.'",
      "links": "<a href='/AIV/40/19/5-6'>Matt 19:5-6</a>; <a href='/AIV/49/5/25'>Eph 5:25</a>",
      "comment": "This prayer proclaims marriage as more than a union for pleasure but for mutual sanctification, echoing the biblical teaching that marriage is for holiness, not just desire."
    },
    {
      "pk": 17008008,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 8,
      "text": "And together they said, 'Amen, Amen.'",
      "links": "<a href='/AIV/16/8/6'>Neh 8:6</a>",
      "comment": "The double 'Amen' stresses solemn affirmation and agreement with God’s will, reminiscent of liturgical prayers where the faithful assent to God's purposes."
    },
    {
      "pk": 17008009,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 9,
      "text": "Then they slept for the night.",
      "links": [
        "Ps 4:8",
        "Gen 2:25"
      ],
      "comment": "Here the narrative simply notes their rest after entrusting their union to the Lord’s care, showing the peace that comes from authentic prayer."
    },
    {
      "pk": 17008010,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 10,
      "text": "But Raguel arose and called his servants; they went and dug a grave,",
      "links": "<a href='/AIV/17/7/11'>Tob 7:11</a>",
      "comment": "Raguel's fear is based on the tragic deaths of Sarah’s previous husbands, reflecting the seriousness and urgency he felt about the fate of Tobias."
    },
    {
      "pk": 17008011,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 11,
      "text": "for he said, 'Perhaps he too has died.'",
      "links": "<a href='/AIV/17/6/14'>Tob 6:14</a>",
      "comment": "This detail emphasizes human anxiety and the weight of past tragedies. It contrasts with Tobias’ trust in God’s providence."
    },
    {
      "pk": 17008012,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 12,
      "text": "saying, \"Send one of the maids and have her go in to see if he is alive. But if he is dead, let us bury him without anyone knowing it.\"",
      "links": [
        "Gen 44:19",
        "Mark 5:35",
        "1 Sam 20:19"
      ],
      "comment": "Raguel’s secretive instructions reveal the anxiety surrounding Sarah’s past seven husbands, who all died on their wedding night (Tobit 3:8), and underscore the themes of fear, shame, and protective parental love within ancient Near Eastern family dynamics."
    },
    {
      "pk": 17008013,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 13,
      "text": "he said to his wife Edna, 'Send one of the maids to see if he is alive. If he is not, let us bury him without anyone knowing.'",
      "links": [
        "Tob 6:14",
        "John 20:3-8"
      ],
      "comment": "This private conversation underscores the gravity of the situation. The secrecy in burying Tobias if he was dead reveals both a sense of shame and fear of scandal."
    },
    {
      "pk": 17008014,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 14,
      "text": "So they sent the maid, lit a lamp, and opened the door. The maid went in and found them both asleep together.",
      "links": [
        "Mark 5:41",
        "Luke 8:54",
        "Acts 9:40"
      ],
      "comment": "The lighting of the lamp and the opening of the door have subtle echoes of resurrection imagery—awakening to life, hope, and restored relationship. There’s a spiritual parallel to God bringing new life where death was feared."
    },
    {
      "pk": 17008015,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 15,
      "text": "So the maid went out and told them, 'He is alive, nothing is wrong.'",
      "links": [
        "Gen 45:26",
        "Matt 28:7"
      ],
      "comment": "Great relief and happiness for Raguel’s household; much like the reversal of mourning seen in other biblical accounts, e.g., the prodigal son and Christ’s resurrection appearances (<a href='/AIV/42/15/24'>Luke 15:24</a>)."
    },
    {
      "pk": 17008016,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 16,
      "text": "Then Raguel blessed God, saying: 'Blessed are you, O God, with every pure and holy blessing. Let all your saints and all your creatures bless you; let all your angels and chosen ones bless you forever.'",
      "links": "<a href='/AIV/19/103/20-22'>Ps 103:20-22</a>; <a href='/AIV/66/5/13'>Rev 5:13</a>",
      "comment": "The emphasis on all 'saints' and 'chosen ones' blessing God anticipates the church as a communion that includes saints and angels, both in heaven and on earth."
    },
    {
      "pk": 17008017,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 17,
      "text": "'You made me glad, and it has not turned out as I expected. You have shown us great mercy, and you have spared us from the disgrace I feared.'",
      "links": "<a href='/AIV/19/30/11'>Ps 30:11</a>",
      "comment": "God answers with mercy, overturning fear and shame—this reflects the recurring biblical theme that trust in God is always justified."
    },
    {
      "pk": 17008018,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 18,
      "text": "Then he ordered his servants to fill in the grave before daybreak.",
      "links": "<a href='/AIV/19/128/1-4'>Ps 128:1-4</a>",
      "comment": "Prayer for the couple’s wellbeing and perseverance together shows the desire for God’s continuing grace in their marriage; this foreshadows the concept of marital grace as a lifelong divine assistance."
    },
    {
      "pk": 17008019,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 19,
      "text": "After this he asked his wife to bake many loaves of bread; and he went out to the herd and brought two steers and four rams and ordered them to be slaughtered. So they began to make preparations.",
      "links": [
        "Gen 29:22",
        "Judg 14:10",
        "John 2:1-2"
      ],
      "comment": "Covering up the prepared grave marks a final end to the threat of death; symbolically, it serves as a rebirth into hope and joy."
    },
    {
      "pk": 17008020,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 20,
      "text": "Then he called for Tobias and swore on oath to him in these words: 'You shall not leave here for fourteen days, but shall stay here eating and drinking with me; and you shall cheer up my daughter, who has been depressed.'",
      "links": "<a href='/AIV/17/7/14'>Tob 7:14</a>",
      "comment": "The joyful celebration echoes themes of feasting after deliverance, as in the Passover and Christ’s own parables of wedding banquets (<a href='/AIV/42/14/15-24'>Luke 14:15-24</a>)."
    },
    {
      "pk": 17008021,
      "translation": "AIV",
      "book": 17,
      "bookName": "Tobit",
      "bookAbbreviation": "Tob",
      "chapter": 8,
      "verse": 21,
      "text": "Take at once half of what I own and return in safety to your father; the other half will be yours when my wife and I die. Take courage, my child. I am your father and Edna is your mother, and we belong to you as well as to your wife now and forever. Take courage, my child.",
      "links": "<a href='/AIV/17/11/18'>Tob 11:18</a>",
      "comment": "The prescribed fourteen-day celebration emphasizes the sacredness and public recognition of marriage, reminiscent of the weeks of feasting found in Jewish wedding traditions."
    }
  ],
  "translatedAt": "2025-12-29T00:37:42.340Z"
}