{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 21,
  "sections": [
    {
      "title": "Exhortation to Repentance and Wisdom",
      "startVerse": 1,
      "endVerse": 12
    },
    {
      "title": "The Way of Wisdom and Folly",
      "startVerse": 13,
      "endVerse": 28
    }
  ],
  "verses": [
    {
      "pk": 28021001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 1,
      "text": "My child, have you sinned? Do not do it again, but pray for forgiveness for your past actions.",
      "links": "<a href='/AIV/20/28/13'>Prov. 28:13</a>; <a href='/AIV/19/51/3-4'>Ps. 51:3-4</a>",
      "comment": "This verse emphasizes repentance and the necessity of prayer for forgiveness, closely mirroring both Old Testament wisdom literature and Jesus’ later teaching on repentance (Matt. 4:17). Note the strong call to not repeat sin—a foretaste of ongoing conversion in Christian life.",
      "sectionHeader": "Exhortation to Repentance and Wisdom"
    },
    {
      "pk": 28021002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 2,
      "text": "Flee from sin as you would from a serpent; for if you approach sin, it will bite you. Its teeth are lion’s teeth, destroying the lives of people.",
      "links": "<a href='/AIV/20/23/32'>Prov. 23:32</a>; <a href='/AIV/19/58/4'>Ps. 58:4</a>",
      "comment": "Sin is depicted as deadly, vividly compared to venomous snake and a lion. Both images from wisdom literature stress the spiritual danger of sin, and highlight the urgency of avoiding occasions of sin—echoing Jesus’ advice to cut off anything that causes you to stumble (Matt. 18:8-9)."
    },
    {
      "pk": 28021003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 3,
      "text": "All lawlessness is like a two-edged sword; its wounds leave no healing.",
      "links": "<a href='/AIV/20/5/4'>Prov. 5:4</a>; <a href='/AIV/41/9/43-48'>Mark 9:43-48</a>",
      "comment": "Lawlessness is shown to bring lasting harm. The emphasis on the unhealable wounds prefigures the eternal consequences of unrepented sin spoken of by Christ (Mark 9:47-48)."
    },
    {
      "pk": 28021004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 4,
      "text": "Terror and violence will lay waste riches; even the houses of arrogant people will be destroyed.",
      "links": "<a href='/AIV/20/15/25'>Prov. 15:25</a>; <a href='/AIV/23/13/11'>Isa. 13:11</a>",
      "comment": "The ruin awaiting the proud connects with God ‘bringing down the arrogant’ throughout Scripture (e.g., Isa. 2:11). This theme features in the Magnificat (Luke 1:52), pointing toward reversal that comes through God’s justice."
    },
    {
      "pk": 28021005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 5,
      "text": "The prayer of the poor goes from their lips to the ears of God, and His judgment will come swiftly.",
      "links": "<a href='/AIV/19/34/6'>Ps. 34:6</a>; <a href='/AIV/42/18/7'>Luke 18:7</a>",
      "comment": "God’s special attention to the poor echoes numerous Old and New Testament themes (Ps. 34:6; Luke 18:7). It implies God’s justice both in hearing the oppressed and punishing the proud."
    },
    {
      "pk": 28021006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 6,
      "text": "Someone who detests reproof is on the path of sinners; but the one who fears the Lord will repent in his heart.",
      "links": "<a href='/AIV/20/13/1'>Prov. 13:1</a>; <a href='/AIV/19/119/120'>Ps. 119:120</a>",
      "comment": "This verse contrasts the attitude toward correction: in Jewish wisdom tradition, rejection of reproof marks one as aligned with unrighteousness (cf. Proverbs 12:1), while true fear of the Lord is shown in humble self-examination and inner repentance, highlighting the value of teachability for spiritual growth (cf. Psalm 51:17)."
    },
    {
      "pk": 28021007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 7,
      "text": "The mighty in speech are widely known; when they slip, the sensible person knows it.",
      "links": "<a href='/AIV/20/18/2'>Prov. 18:2</a>; <a href='/AIV/19/12/3-4'>Ps. 12:3-4</a>",
      "comment": "This verse contrasts public reputation for eloquence with the discerning judgment of the wise. While those skilled in words attain notoriety, their faults and inconsistencies do not escape the notice of the prudent. The verse echoes the wisdom tradition’s caution that external acclaim does not guarantee true wisdom or immunity from error (cf. Proverbs 10:19, James 3:2)."
    },
    {
      "pk": 28021008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 8,
      "text": "Whoever builds his house with another’s money is gathering stones for his own grave.",
      "links": "<a href='/AIV/20/15/27'>Prov. 15:27</a>; <a href='/AIV/20/22/16'>Prov. 22:16</a>",
      "comment": "Constructing a foundation upon greed and exploitation leads to self-destruction—a principle Jesus amplifies regarding unjust wealth (Luke 16:9)."
    },
    {
      "pk": 28021009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 9,
      "text": "Bandits’ gatherings are like bundles of tow, and they end in a flame of fire.",
      "links": "<a href='/AIV/23/1/31'>Isa. 1:31</a>; <a href='/AIV/18/18/16'>Job 18:16</a>",
      "comment": "Here, the association of evil doers with inevitable destruction is highlighted. The imagery of fire prefigures Biblical themes of judgment (Matt. 13:40-42)."
    },
    {
      "pk": 28021010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 10,
      "text": "The way of sinners is smooth stones, but at its end is the pit of Hades.",
      "links": "<a href='/AIV/19/73/18-19'>Ps. 73:18-19</a>; <a href='/AIV/40/7/13'>Matt. 7:13</a>",
      "comment": "The easy path leads to destruction, echoing Jesus’ teaching about the wide and narrow gates (Matt. 7:13). The reference to Hades continues the Old Testament theme of the grave and foreshadows deeper New Testament revelations."
    },
    {
      "pk": 28021011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 11,
      "text": "He who keeps the law controls his own thoughts; perfect fear of the Lord is wisdom.",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7</a>; <a href='/AIV/20/9/10'>Prov. 9:10</a>",
      "comment": "Obedience to God leads to inner transformation. This is a clear connection between the law and wisdom, echoing Old Testament wisdom and foreshadowing Christ’s teaching on interior conversion (Matt. 5:21-22)."
    },
    {
      "pk": 28021012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 12,
      "text": "Those who are not wise will not be taught; but there is a wisdom which grows bitter among those who lack understanding.",
      "links": "<a href='/AIV/20/12/1'>Prov. 12:1</a>; <a href='/AIV/40/13/15'>Matt. 13:15</a>",
      "comment": "Wisdom is inaccessible to the stubborn, paralleling Jesus’ warnings about hardheartedness. True wisdom brings joy, but false wisdom brings bitterness—a spiritual reality that calls for grace and humility."
    },
    {
      "pk": 28021013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 13,
      "text": "The knowledge of the wise overflows like a river, and their counsel is like a living spring.",
      "links": "<a href='/AIV/20/18/4'>Prov. 18:4</a>; <a href='/AIV/43/4/14'>John 4:14</a>",
      "comment": "Wisdom is depicted as abundant and life-giving, a powerful image that Christ later uses of Himself as the source of living water (John 4:14). The connection between wisdom and life becomes central to the Gospel message.",
      "sectionHeader": "The Way of Wisdom and Folly"
    },
    {
      "pk": 28021014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 14,
      "text": "A fool’s heart is like a shattered vessel; it holds no knowledge.",
      "links": "<a href='/AIV/20/12/23'>Prov. 12:23</a>; <a href='/AIV/19/14/1'>Ps. 14:1</a>",
      "comment": "Foolishness leads to emptiness—spiritual blindness that is often associated with being ‘broken’ or unable to receive God’s word. This links to the importance of interior formation and Divine grace."
    },
    {
      "pk": 28021015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 15,
      "text": "When an intelligent person hears a proverb, he praises it and adds to it; when a fool hears it, he merely laughs or throws it away.",
      "links": "<a href='/AIV/20/1/5-7'>Prov. 1:5-7</a>; <a href='/AIV/20/17/10'>Prov. 17:10</a>",
      "comment": "Wisdom is receptive and expansive. This highlights the value of tradition—wise persons preserve and build upon wisdom."
    },
    {
      "pk": 28021016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 16,
      "text": "A fool’s chatter is like a burden on a journey, but delight is found in the speech of the intelligent.",
      "links": "<a href='/AIV/20/25/12'>Prov. 25:12</a>; <a href='/AIV/19/19/10'>Ps. 19:10</a>",
      "comment": "Instruction is depicted as precious. This mirrors the treasures of wisdom tradition passed through generations, emphasizing reverence for teaching authority in the Church."
    },
    {
      "pk": 28021017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 17,
      "text": "The utterance of a sensible person is sought in the assembly, and they ponder his words in their minds.",
      "links": "<a href='/AIV/20/14/16'>Prov. 14:16</a>; <a href='/AIV/20/1/10-16'>Prov. 1:10-16</a>",
      "comment": "The wise are careful in their actions, avoiding dangerous situations or company. This mirrors New Testament calls to avoid the appearance of evil (1 Thess. 5:22)."
    },
    {
      "pk": 28021018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 18,
      "text": "Like a house in ruins is wisdom to a fool, and to the ignorant, knowledge is talk that has no meaning.",
      "links": "<a href='/AIV/20/11/2'>Prov. 11:2</a>; <a href='/AIV/20/17/28'>Prov. 17:28</a>",
      "comment": "Respect for boundaries signifies prudence. Displaying proper manners is a sign of wisdom and inner order, paralleling the virtue of modesty and reverence."
    },
    {
      "pk": 28021019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 19,
      "text": "To a senseless person education is fetters on his feet, and like manacles on his right hand.",
      "links": "<a href='/AIV/20/17/27'>Prov. 17:27</a>; <a href='/AIV/19/141/3'>Ps. 141:3</a>",
      "comment": "Speech is to be measured and thoughtful. The warning recalls Christ’s teaching in Matt. 12:36 about accountability for every word spoken."
    },
    {
      "pk": 28021020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 20,
      "text": "A fool raises his voice when he laughs, but the wise smile quietly.",
      "links": "<a href='/AIV/20/10/32'>Prov. 10:32</a>; <a href='/AIV/49/4/29'>Eph. 4:29</a>",
      "comment": "The contrast between foolish and wise speech points toward the transformative power of words for blessing. St. Paul’s exhortations about grace-filled speech reflect this wisdom tradition."
    },
    {
      "pk": 28021021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 21,
      "text": "To the sensible person education is like a golden ornament, and like a bracelet on the right arm.",
      "links": "<a href='/AIV/20/25/12'>Prov. 25:12</a>; <a href='/AIV/19/12/6'>Ps. 12:6</a>",
      "comment": "The value of wisdom is immeasurable. This verse subtly supports the tradition of seeking and transmitting learned counsel through the ages."
    },
    {
      "pk": 28021022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 22,
      "text": "The foot of a fool rushes into a house, but an experienced person waits respectfully outside.",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>; <a href='/AIV/40/7/26'>Matt. 7:26</a>",
      "comment": "Wisdom lacking truth destroys, unlike Christ who likens His true teaching to building on a solid foundation (Matt. 7:24-27)."
    },
    {
      "pk": 28021023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 23,
      "text": "A boor peers into the house from the door, but a cultivated person remains outside.",
      "links": "<a href='/AIV/20/15/5'>Prov. 15:5</a>; <a href='/AIV/20/12/1'>Prov. 12:1</a>",
      "comment": "For those lacking wisdom, discipline is seen as oppressive rather than liberating—echoing themes from Proverbs (10:17)—illustrating how receptiveness to guidance marks the difference between folly and growth in righteousness."
    },
    {
      "pk": 28021024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 24,
      "text": "It is ill-mannered for a person to listen at a door; the discreet would be grieved by the disgrace.",
      "links": "<a href='/AIV/20/29/9'>Prov. 29:9</a>; <a href='/AIV/19/37/12-13'>Ps. 37:12-13</a>",
      "comment": "Restraint and subdued joy mark the wise, a virtue cultivated in the Christian pursuit of holiness and humility."
    },
    {
      "pk": 28021025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 25,
      "text": "The lips of babblers speak of what is not their concern, but the words of the prudent are weighed in the balance.",
      "links": "<a href='/AIV/20/1/9'>Prov. 1:9</a>; <a href='/AIV/20/4/9'>Prov. 4:9</a>",
      "comment": "This metaphor suggests wisdom is not just useful, but ornamental and beautiful. It invites the reader to cherish the tradition of learning and spiritual inheritance."
    },
    {
      "pk": 28021026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 26,
      "text": "The mind of fools is in their mouth, but the mouth of the wise is in their mind.",
      "links": "<a href='/AIV/20/15/7'>Prov. 15:7</a>; <a href='/AIV/20/8/5'>Prov. 8:5</a>",
      "comment": "Again, the vessel imagery points to being unable to receive God’s truth—reflecting on the need for continuous inner renewal."
    },
    {
      "pk": 28021027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 27,
      "text": "When an ungodly person curses an adversary, he curses himself.",
      "links": "<a href='/AIV/20/26/27'>Prov. 26:27</a>; <a href='/AIV/19/109/17'>Ps. 109:17</a>",
      "comment": "The reflexive nature of cursing here reflects the biblical principle that evil utterances or malediction ultimately rebound upon the speaker. Addressed to the 'ungodly' (Greek: 'asebēs'), it warns that wishing harm upon opponents does not exempt one from divine justice; rather, such speech implicates oneself morally and spiritually (cf. Psalm 109:17, Proverbs 26:27)."
    },
    {
      "pk": 28021028,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 21,
      "verse": 28,
      "text": "A whisperer degrades himself and is hated in his neighborhood.",
      "links": "<a href='/AIV/20/18/8'>Prov. 18:8</a>; <a href='/AIV/20/26/20'>Prov. 26:20</a>",
      "comment": "The term 'whisperer' (Greek: 'psithyristēs') refers specifically to those who spread secrets or stir up intrigue within a community. Instead of universal condemnation, the verse focuses on the loss of standing within one's own local context—noting that such behavior corrupts character and destroys communal trust (cf. Proverbs 16:28, Leviticus 19:16)."
    }
  ],
  "translatedAt": "2026-01-01T21:59:58.058Z"
}