{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 23,
  "sections": [
    {
      "title": "A Prayer for Wisdom and Purity",
      "startVerse": 1,
      "endVerse": 15
    },
    {
      "title": "The Dangers of Sinful Speech and Lust",
      "startVerse": 16,
      "endVerse": 25
    },
    {
      "title": "The Blessing of Obedience",
      "startVerse": 26,
      "endVerse": 27
    }
  ],
  "verses": [
    {
      "pk": 28023001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 1,
      "text": "O Lord, Father and Master of my life, do not abandon me to their counsel, nor let me fall by them.",
      "links": "<a href='/AIV/19/141/4'>Ps 141:4</a>; <a href='/AIV/24/10/23'>Jer 10:23</a>",
      "comment": "Sirach begins with a prayer for God's guidance and protection from harmful advice and influences. The use of 'Father and Master' highlights the filial relationship with God, hinting at the importance of spiritual authority.",
      "sectionHeader": "A Prayer for Wisdom and Purity"
    },
    {
      "pk": 28023002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 2,
      "text": "Who will set discipline over my thoughts, and wisdom over my heart, so that they do not dominate me, and so that my transgressions may not be multiplied, and my sins may not increase?",
      "links": "<a href='/AIV/19/51/10'>Ps 51:10</a>; <a href='/AIV/20/4/23'>Prov 4:23</a>",
      "comment": "This verse recognizes the need for wisdom and discipline over the inner life. The desire to be freed from the dominance of sin points toward the need for God's transformative grace."
    },
    {
      "pk": 28023003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 3,
      "text": "Let me not fall into the hands of my own shameful desires, nor allow sinful passion to rule over me.",
      "links": "<a href='/AIV/19/119/133'>Ps 119:133</a>; <a href='/AIV/45/6/12'>Rom 6:12</a>",
      "comment": "The author asks God for the grace to overcome disordered passions, foreshadowing New Testament teaching on resisting the desires of the flesh (Romans 6:12)."
    },
    {
      "pk": 28023004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 4,
      "text": "O Lord, Father, God of my life, do not give me deceitful lips, nor let arrogance enter my heart.",
      "links": "<a href='/AIV/19/120/2-3'>Ps 120:2-3</a>; <a href='/AIV/59/3/2'>Jas 3:2</a>",
      "comment": "The emphasis on truthful speech and humility highlights the spiritual and moral dangers of the tongue, and mirrors themes taken up in James 3:2."
    },
    {
      "pk": 28023005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 5,
      "text": "Keep far from me greed and lust, and do not let shamelessness and impurity possess me.",
      "links": "<a href='/AIV/19/119/37'>Ps 119:37</a>; <a href='/AIV/48/5/16'>Gal 5:16</a>",
      "comment": "This is a plea for interior purity and moderation. Such prayers anticipate the New Testament call to walk by the Spirit and put to death the deeds of the flesh."
    },
    {
      "pk": 28023006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 6,
      "text": "Let neither the cravings of the flesh nor sinful desires seize me, and do not permit a shameless soul and senseless passion to rule over me.",
      "links": "<a href='/AIV/45/13/14'>Rom 13:14</a>; <a href='/AIV/19/119/133'>Ps 119:133</a>",
      "comment": "Another call to be guarded from unclean passions. The soul's vulnerability to sin shows the need for ongoing guidance and the transformative work of grace."
    },
    {
      "pk": 28023007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 7,
      "text": "Those who are trained in discipline will speak wisely, and those who watch over their lips will not be caught in transgression.",
      "links": "<a href='/AIV/20/10/19'>Prov 10:19</a>; <a href='/AIV/59/1/26'>Jas 1:26</a>",
      "comment": "Wisdom is manifested through self-control, especially in speech. The importance of training and discipline is rooted in a tradition of formation for a virtuous life."
    },
    {
      "pk": 28023008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 8,
      "text": "The sinner's mouth is full of evil, and the arrogant person's tongue is a consuming fire.",
      "links": "<a href='/AIV/20/16/27'>Prov 16:27</a>; <a href='/AIV/59/3/6'>Jas 3:6</a>",
      "comment": "Speech has the power to destroy or to edify. Discipline in speech reflects inner virtue and holiness."
    },
    {
      "pk": 28023009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 9,
      "text": "Do not accustom your mouth to oaths, and do not become familiar with the naming of the Holy One.",
      "links": "<a href='/AIV/20/20/25'>Prov 20:25</a>; <a href='/AIV/40/5/34-37'>Matt 5:34-37</a>",
      "comment": "Careless speaking, especially invoking the divine name, is to be avoided. Jesus later builds on this, instructing his followers to avoid oaths altogether (Matt 5:34–37)."
    },
    {
      "pk": 28023010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 10,
      "text": "For as a servant who is constantly examined will not be without marks, so one who swears continually will not be free from sin.",
      "links": "<a href='/AIV/38/5/4'>Eccl 5:4</a>; <a href='/AIV/40/5/37'>Matt 5:37</a>",
      "comment": "Frequent swearing is compared to constant punishment; both leave marks. This reflects the belief that habitual sins entrench vice."
    },
    {
      "pk": 28023011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 11,
      "text": "A man who swears many oaths will be filled with iniquity, and punishment will not depart from his house. If he offends, his sin is upon him; and if he disregards it, he sins doubly. If he has sworn in vain, he will not be justified, for his house will be filled with disaster.",
      "links": "<a href='/AIV/20/6/12-15'>Prov 6:12-15</a>; <a href='/AIV/59/5/12'>Jas 5:12</a>",
      "comment": "Swearing oaths frivolously or falsely has practical and spiritual consequences; integrity is preferred. See James 5:12."
    },
    {
      "pk": 28023012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 12,
      "text": "There is another kind of speech which is like death; let it not be found among Jacob's descendants. For all these things will be far from the godly, and they will not wallow in sins.",
      "links": "<a href='/AIV/19/34/13'>Ps 34:13</a>; <a href='/AIV/49/5/4'>Eph 5:4</a>",
      "comment": "Inappropriate speech is viewed as deadly to the soul—a reminder to cultivate holiness in conversation."
    },
    {
      "pk": 28023013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 13,
      "text": "Do not become accustomed to lewd speech, for such speech has no place except in sin.",
      "links": "<a href='/AIV/49/5/4'>Eph 5:4</a>; <a href='/AIV/51/3/8'>Col 3:8</a>",
      "comment": "Avoiding lewdness in speech points to the need for purity not just of action but also of words—anticipating New Testament exhortations (Ephesians 5:4)."
    },
    {
      "pk": 28023014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 14,
      "text": "Remember your father and mother when you sit among great men, for you may forget yourself in their presence and become foolish, and wish that you had not been born, and bring curse upon your life.",
      "links": "<a href='/AIV/2/20/12'>Exod 20:12</a>; <a href='/AIV/49/6/2'>Eph 6:2</a>",
      "comment": "Honoring one's parents is linked with one's reputation and ultimate happiness. The familial dimension of virtue is stressed."
    },
    {
      "pk": 28023015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 15,
      "text": "A man who becomes accustomed to abusive words will never be disciplined all his days, and will be branded as a sinner.",
      "links": "<a href='/AIV/20/13/3'>Prov 13:3</a>; <a href='/AIV/59/3/6'>Jas 3:6</a>",
      "comment": "Speech forms character; sin in speech reflects and deepens interior disorder."
    },
    {
      "pk": 28023016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 16,
      "text": "Two types of people multiply sins, and a third brings anger: passionate desire like a burning fire will not be quenched until it is consumed; a man who commits sexual sin in his body will not cease until the fire burns out.",
      "links": "<a href='/AIV/20/6/27-28'>Prov 6:27-28</a>; <a href='/AIV/46/6/18'>1 Cor 6:18</a>",
      "comment": "Here sin is compared with an unquenchable fire, especially sexual immorality. The body is not separate from the soul in virtue or vice—a theme developed later by St. Paul in 1 Corinthians 6:18.",
      "sectionHeader": "The Dangers of Sinful Speech and Lust"
    },
    {
      "pk": 28023017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 17,
      "text": "To a shameless one, every bread is sweet, and he will not be weary until death stops him.",
      "links": "<a href='/AIV/20/9/17'>Prov 9:17</a>; <a href='/AIV/58/11/25'>Heb 11:25</a>",
      "comment": "'Every bread is sweet' is a metaphor for indulgence in illicit pleasures, which ultimately leads to destruction. Hebrews 11:25 offers a New Testament parallel regarding the fleeting pleasures of sin."
    },
    {
      "pk": 28023018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 18,
      "text": "A man who is unfaithful to marriage, thinking, 'Who sees me? Darkness surrounds me, and the walls hide me; no one sees me—why should I fear? The Most High will not remember my sins.'",
      "links": "<a href='/AIV/19/139/11-12'>Ps 139:11-12</a>; <a href='/AIV/24/23/24'>Jer 23:24</a>",
      "comment": "The secretive nature of sin is highlighted, but the folly in thinking one can hide from God is exposed."
    },
    {
      "pk": 28023019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 19,
      "text": "He only fears the eyes of men, and does not realize that the eyes of the Lord are a thousand times brighter than the sun, watching over the ways of men, and seeing even the innermost places.",
      "links": "<a href='/AIV/19/33/13-15'>Ps 33:13-15</a>; <a href='/AIV/42/12/2-3'>Luke 12:2-3</a>",
      "comment": "God’s omniscience means nothing is truly hidden. Christ reaffirms this when he says what is done in secret will be revealed (Luke 12:2–3)."
    },
    {
      "pk": 28023020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 20,
      "text": "He knew all things before ever they were created, so even now, after they are finished, he sees them all.",
      "links": "<a href='/AIV/58/4/13'>Heb 4:13</a>; <a href='/AIV/19/139/16'>Ps 139:16</a>",
      "comment": "Affirms God’s perfect foreknowledge—He sees and knows all, from creation to the end. See Hebrews 4:13."
    },
    {
      "pk": 28023021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 21,
      "text": "Such a man will be punished in the streets of the city, and where he least expects it, he will be seized.",
      "links": "<a href='/AIV/20/7/22-23'>Prov 7:22-23</a>",
      "comment": "Public discipline and consequences often follow private sin. Biblical wisdom literature often links unrepented hidden sin to eventual exposure."
    },
    {
      "pk": 28023022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 22,
      "text": "So also with a woman who leaves her husband and brings in an heir by another man.",
      "links": "<a href='/AIV/2/20/14'>Exod 20:14</a>; <a href='/AIV/20/2/17'>Prov 2:17</a>",
      "comment": "Adultery is strongly condemned for both men and women. The legal and spiritual consequences are highlighted."
    },
    {
      "pk": 28023023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 23,
      "text": "For first, she has disobeyed the law of the Most High; second, she has committed a sin against her husband; and third, she has brought forth children by another man.",
      "links": "<a href='/AIV/3/20/10'>Lev 20:10</a>; <a href='/AIV/40/19/9'>Matt 19:9</a>",
      "comment": "Threefold gravity of the sin is explained: disobedience to God, betrayal of spouse, and family disorder—indicating the seriousness of marital fidelity."
    },
    {
      "pk": 28023024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 24,
      "text": "Such a woman will be brought before the assembly, and her children will not take root; her offspring will not flourish.",
      "links": "<a href='/AIV/5/23/2'>Deut 23:2</a>; <a href='/AIV/28/9/16'>Hos 9:16</a>",
      "comment": "Sin has consequences not only for the individual, but also for their descendants, echoing other Old Testament warnings about generational effects."
    },
    {
      "pk": 28023025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 25,
      "text": "She will leave her memory as a curse, and her disgrace will never be wiped out.",
      "links": "<a href='/AIV/20/10/7'>Prov 10:7</a>",
      "comment": "A warning that public and persistent sin leads to lasting shame—a reputation for evil is hard to remove."
    },
    {
      "pk": 28023026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 26,
      "text": "Those who remain after her will know that nothing is better than the fear of the Lord, and nothing sweeter than to heed the commandments of the Lord.",
      "links": "<a href='/AIV/19/19/9'>Ps 19:9-10</a>; <a href='/AIV/20/1/7'>Prov 1:7</a>",
      "comment": "Contrast is made between the bitterness of sin and the sweetness of fearing God and obedience. Holiness is seen as the true source of joy and blessing.",
      "sectionHeader": "The Blessing of Obedience"
    },
    {
      "pk": 28023027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 23,
      "verse": 27,
      "text": "Those who survive her will recognize that nothing is better than the fear of the Lord, and nothing sweeter than to heed the commandments of the Lord.",
      "links": [
        "Ps 19:10-11",
        "Prov 1:7",
        "Eccl 12:13"
      ],
      "comment": "This verse concludes with the wisdom tradition's central theme: true happiness and security are found in reverent obedience to God; it echoes similar sentiments in Proverbs 1:7 and Psalm 19:10, highlighting the surpassing value and sweetness of living under God's guidance, particularly after experiencing the destructive consequences of folly and sin alluded to earlier in the chapter."
    }
  ],
  "translatedAt": "2025-12-28T06:59:55.307Z"
}