{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 8,
  "verses": [
    {
      "pk": 18008001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 1,
      "text": "At that time, news reached Judith, daughter of Merari, son of Ox, son of Joseph, son of Ozel, son of Elai, son of Jamnor, son of Gideon, son of Raphael, son of Ahithub, son of Elijah, son of Hilkiah, son of Eliab, son of Nathanael, son of Salamiel, son of Sarasaddai, son of Israel.",
      "links": "<a href='/AIV/1/46/20'>Gen. 46:20</a>; <a href='/AIV/4/1/7'>Num. 1:7</a>",
      "comment": "Judith’s genealogy is traced in detail, affirming her noble Jewish birth from a prominent lineage within Israel, which stresses the importance of tradition and inheritance, themes similarly reflected in the preservation of the faith and teachings throughout history.",
      "sectionHeader": "Judith's Family and Widowhood"
    },
    {
      "pk": 18008002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 2,
      "text": "Her husband Manasseh had died during the barley harvest.",
      "links": "<a href='/AIV/1/35/20'>Gen. 35:20</a>; <a href='/AIV/20/31/10'>Prov. 31:10</a>",
      "comment": "Judith’s widowhood is significant, as it symbolizes both personal suffering and the enduring hope and faith in God’s providence, reflecting the biblical motif where widows often receive special care from God (cf. <a href='/AIV/19/68/5'>Ps. 68:5</a>)."
    },
    {
      "pk": 18008003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 3,
      "text": "He had suffered heatstroke in Bethulia, while he was supervising those who were binding sheaves in the fields.",
      "links": "<a href='/AIV/8/2/22'>Ruth 2:22</a>; <a href='/AIV/18/1/5'>Judith 1:5</a>",
      "comment": "The mention of Bethulia connects the setting to earlier parts of the story and grounds the events in a real community. Manasseh’s death during harvest calls to mind the cycle of life and God’s providence."
    },
    {
      "pk": 18008004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 4,
      "text": "He was carried back to Bethulia, where he died, and was buried with his ancestors in the field between Dothan and Balamon.",
      "links": "<a href='/AIV/1/23/19'>Gen. 23:19</a>; <a href='/AIV/6/24/33'>Josh. 24:33</a>",
      "comment": "Burial among ancestors highlights the continuity of faith across generations. It echoes Old Testament traditions of honoring the dead within one’s lineage."
    },
    {
      "pk": 18008005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 5,
      "text": "Judith remained a widow for three years and four months.",
      "links": "<a href='/AIV/42/2/36-37'>Luke 2:36-37</a>; <a href='/AIV/8/16/22'>Judith 16:22</a>",
      "comment": "The deliberate mention of her extended widowhood connects to the virtue of perseverance in holiness, similar to Anna the prophetess (Luke 2)."
    },
    {
      "pk": 18008006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 6,
      "text": "She made herself a tent on the roof of her house, and wore sackcloth around her waist. She fasted all the days of her widowhood except on the day before the sabbath and the sabbath itself, the day before the new moon and the day of the new moon, and the feast days of Israel.",
      "links": "<a href='/AIV/49/2/37'>Luke. 2:37</a>; <a href='/AIV/34/6/10'>Dan. 6:10</a>; <a href='/AIV/19/4/3'>Esth. 4:3</a>",
      "comment": "Judith's fasting and sackcloth signify deep mourning and penitence, her abstention on holy days reflects respect for religious observance (cf. Lev 23), highlighting her piety amidst crisis."
    },
    {
      "pk": 18008007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 7,
      "text": "She was very beautiful in appearance, and her husband Manasseh had left her gold and silver, servants and maidservants, cattle and lands; she owned all these.",
      "links": "<a href='/AIV/20/31/10-31'>Prov. 31:10-31</a>; <a href='/AIV/19/112/3'>Ps. 112:3</a>",
      "comment": "Judith’s beauty and resources recall the godly woman of Proverbs 31, showing that material blessings can be used for God’s glory while remaining humble and devout."
    },
    {
      "pk": 18008008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 8,
      "text": "No one spoke ill of her, for she greatly feared God.",
      "links": "<a href='/AIV/18/11/18'>Judith 11:18</a>; <a href='/AIV/20/31/30'>Prov. 31:30</a>",
      "comment": "Her reputation of holiness highlights that true fear of God is visible to others in one’s conduct (see also Proverbs 31)."
    },
    {
      "pk": 18008009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 9,
      "text": "She heard what the people said—that the water supply had failed, and she learned that the people were rebelling against Uzziah and the rulers because of thirst.",
      "links": "<a href='/AIV/18/7/1-7'>Judith 7:1-7</a>; <a href='/AIV/4/20/2'>Num. 20:2</a>",
      "comment": "The crisis of water scarcity recalls earlier biblical events (e.g., Exodus), where God's providence is contrasted with people's doubts.",
      "sectionHeader": "Judith Summons the Elders"
    },
    {
      "pk": 18008010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 10,
      "text": "Judith sent her maid, who was in charge of all her things, to call Uzziah, Chabris, and Charmis, the elders of her city.",
      "links": "<a href='/AIV/18/6/16'>Judith 6:16</a>; <a href='/AIV/2/18/15'>Ex. 18:15</a>",
      "comment": "Judith’s initiative in approaching the city elders shows the critical role of spiritual leadership, reminiscent of the importance of wise counselors in salvation history."
    },
    {
      "pk": 18008011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 11,
      "text": "They came to her, and she said to them, 'Listen to me, rulers of the people of Bethulia! What you have said to the people today is not right; it will bring punishment.",
      "links": "<a href='/AIV/20/15/22'>Prov. 15:22</a>; <a href='/AIV/21/5/6'>Eccl. 5:6</a>",
      "comment": "Judith rebukes the elders for their poor judgment, showing the importance of speaking truth even to those in authority.",
      "sectionHeader": "Judith's Exhortation to Trust in God"
    },
    {
      "pk": 18008012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 12,
      "text": "You have set an oath between God and yourselves, promising to surrender the city to our enemies if the Lord does not help us within these days.",
      "links": "<a href='/AIV/3/27/2'>Lev. 27:2</a>; <a href='/AIV/4/30/2'>Num. 30:2</a>",
      "comment": "The making of oaths underscores the seriousness of promises before God. Judith critiques rash vows, which echoes the biblical caution against binding oaths except in submission to God’s will."
    },
    {
      "pk": 18008013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 13,
      "text": "Who are you to put God to the test today, and to set yourselves in the place of God among men?",
      "links": "<a href='/AIV/5/6/16'>Deut. 6:16</a>; <a href='/AIV/40/4/7'>Matt. 4:7</a>",
      "comment": "Judith’s rhetorical question echoes Deuteronomy: 'You shall not put the LORD your God to the test.' Her rebuke points toward deep trust and reliance on divine will, anticipating Jesus' own citation in the temptation narrative."
    },
    {
      "pk": 18008014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 14,
      "text": "You are testing the Lord Almighty, but you will never know anything unless he decides by his will.",
      "links": "<a href='/AIV/19/115/3'>Ps. 115:3</a>; <a href='/AIV/23/40/13'>Isa. 40:13</a>",
      "comment": "Judith boldly affirms God’s sovereignty. Her challenge highlights our dependence on divine initiative, a recurring biblical theme."
    },
    {
      "pk": 18008015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 15,
      "text": "You cannot force him to act as a man, or dictate to him as you might do to another human.",
      "links": "<a href='/AIV/19/50/21'>Ps. 50:21</a>; <a href='/AIV/45/9/20'>Rom. 9:20-21</a>",
      "comment": "God cannot be manipulated by human expectations, a humility echoed in Paul’s letters about God’s authority over the clay (Romans 9)."
    },
    {
      "pk": 18008016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 16,
      "text": "Therefore, wait for his salvation, and do not set a time limit for the Lord our God, for he is not like man to be threatened or compelled.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/45/8/24-25'>Rom. 8:24-25</a>",
      "comment": "The call to wait on God for salvation links beautifully to biblical patience; salvation comes in God’s timing, not ours."
    },
    {
      "pk": 18008017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 17,
      "text": "Therefore, while we wait for his deliverance, let us call upon him to help us, and he will hear our voice, if it pleases him.",
      "links": "<a href='/AIV/23/34/15'>Ps. 34:15</a>; <a href='/AIV/23/50/15'>Ps. 50:15</a>; <a href='/AIV/29/30/18'>Isa. 30:18</a>",
      "comment": "Judith urges trust in God's deliverance, emphasizing prayerful patience, a recurring biblical theme (cf. Psalm 27:14), affirming divine sovereignty in response to supplication."
    },
    {
      "pk": 18008018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 18,
      "text": "For never in our generation nor in these days has there been any tribe or family or people or town of ours that worships gods made with hands, as was done in days gone by.",
      "links": "<a href='/AIV/2/20/4'>Exod. 20:4</a>; <a href='/AIV/6/24/14'>Josh. 24:14-16</a>; <a href='/AIV/7/2/11'>Judg. 2:11-13</a>",
      "comment": "She recalls Israel’s consistent monotheism since their reforms, contrasting present faithfulness with former idolatry, an echo of Deuteronomy's warnings against false gods."
    },
    {
      "pk": 18008019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 19,
      "text": "That was why our ancestors were handed over to the sword and to pillage, and so they suffered a great catastrophe before our enemies.",
      "links": "<a href='/AIV/7/2/14'>Judg. 2:14</a>; <a href='/AIV/14/36/16'>2Chr. 36:16-19</a>; <a href='/AIV/30/7/20'>Jer. 7:20</a>",
      "comment": "Judith links ancestral disasters—sword and pillage—to lapses in faith, referencing prophetic teachings that national suffering results from covenantal unfaithfulness (cf. Judges 2:11-15)."
    },
    {
      "pk": 18008020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 20,
      "text": "But we know no other god but him, and so we hope that he will not disdain us or any of our nation.",
      "links": "<a href='/AIV/5/6/4'>Deut. 6:4</a>; <a href='/AIV/23/73/25'>Ps. 73:25</a>; <a href='/AIV/30/14/22'>Jer. 14:22</a>",
      "comment": "She anchors Israel’s hope in their exclusive devotion to the one true God, echoing the Shema (Deut 6:4) and expressing confidence God will not reject his faithful people."
    },
    {
      "pk": 18008021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 21,
      "text": "For if we are captured, all Judea will be captured and our sanctuary will be plundered; and he will make us pay for its desecration with our blood.",
      "links": "<a href='/AIV/30/7/14'>Jer. 7:14</a>; <a href='/AIV/40/3/12'>Mic. 3:12</a>; <a href='/AIV/20/1/21'>1Macc. 1:21-24</a>",
      "comment": "Judith warns that their defeat would expose Judea and the sanctuary to desecration, showing the understood link between national survival and the honor of God's dwelling place."
    },
    {
      "pk": 18008022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 22,
      "text": "The slaughter of our kindred and the captivity of the land and the desolation of our inheritance—all this he will bring on our heads among the Gentiles, wherever we serve as slaves; and we shall be an offense and a disgrace in the eyes of those who acquire us.",
      "links": "<a href='/AIV/5/28/37'>Deut. 28:37</a>; <a href='/AIV/30/24/9'>Jer. 24:9</a>; <a href='/AIV/31/2/15'>Lam. 2:15-16</a>",
      "comment": "She anticipates the shame and exile that would result from defeat, echoing covenant curses (Deut 28:36-37) and the loss of inheritance associated with national apostasy."
    },
    {
      "pk": 18008023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 23,
      "text": "For our slavery will not bring us into favor, but the Lord our God will turn it to dishonor.",
      "links": "<a href='/AIV/5/28/20'>Deut. 28:20</a>; <a href='/AIV/23/44/13'>Ps. 44:13</a>; <a href='/AIV/30/42/18'>Jer. 42:18</a>",
      "comment": "Judith insists that subjugation will not earn favor from oppressors, but instead bring further dishonor, reflecting theological conviction that only fidelity to God brings true honor."
    },
    {
      "pk": 18008024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 24,
      "text": "Therefore, my brothers, let us set an example for our kindred, for their lives depend upon us, and the sanctuary — both the temple and the altar — rests upon us.",
      "links": "<a href='/AIV/6/24/15'>Josh. 24:15</a>; <a href='/AIV/13/29/17'>1Chr. 29:17</a>; <a href='/AIV/34/3/17'>Dan. 3:17-18</a>",
      "comment": "Judith urges communal responsibility, emphasizing that their actions directly affect the survival of their people and the fate of the sanctuary."
    },
    {
      "pk": 18008025,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 25,
      "text": "In spite of everything let us give thanks to the Lord our God, who is putting us to the test as he did our ancestors.",
      "links": "<a href='/AIV/23/107/1'>Ps. 107:1</a>; <a href='/AIV/34/3/28'>Dan. 3:28</a>; <a href='/AIV/66/1/2'>Jas. 1:2-3</a>",
      "comment": "Echoing themes of testing from Israel’s history, Judith urges gratitude and perseverance, recognizing trials as opportunities for communal growth and faithfulness."
    },
    {
      "pk": 18008026,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 26,
      "text": "Remember what he did with Abraham, and how he tested Isaac, and what happened to Jacob in Syrian Mesopotamia, while he was tending the sheep of Laban, his mother’s brother.",
      "links": "<a href='/AIV/1/22/1'>Gen. 22:1</a>; <a href='/AIV/1/32/24'>Gen. 32:24-28</a>; <a href='/AIV/1/31/38'>Gen. 31:38-42</a>",
      "comment": "Judith invokes the patriarchs Abraham, Isaac, and Jacob, recalling their trials as precedents for faith under hardship (cf. Gen 22:1-19; Gen 32:22-32), reinforcing the virtue of endurance."
    },
    {
      "pk": 18008027,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 27,
      "text": "For he has not tried us with fire, as he did them, to search their hearts, nor has he taken vengeance on us; but the Lord scourges those who are close to him in order to admonish them.",
      "links": "<a href='/AIV/24/3/12'>Prov. 3:12</a>; <a href='/AIV/65/12/6'>Heb. 12:6</a>; <a href='/AIV/23/94/12'>Ps. 94:12</a>",
      "comment": "She notes that God disciplines those he loves without destruction, paralleling Proverbs 3:12 and Hebrews 12:6, viewing suffering as divine admonition for the faithful."
    },
    {
      "pk": 18008028,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 28,
      "text": "Uzziah said to her, 'All that you have spoken is true, and no one can contradict your words.",
      "links": "<a href='/AIV/20/23/12'>Prov. 23:12</a>; <a href='/AIV/18/11/19'>Judith 11:19</a>",
      "comment": "Uzziah’s acknowledgment of Judith’s wisdom suggests that leadership can come from unexpected people, as God raises up humble yet wise voices."
    },
    {
      "pk": 18008029,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 29,
      "text": "Today is not the first time your wisdom has been shown, but from the beginning of your life all the people have recognized your understanding, for your heart’s disposition is right.",
      "links": "<a href='/AIV/9/16/7'>1Sam. 16:7</a>; <a href='/AIV/27/7/27'>Wis. 7:27</a>; <a href='/AIV/28/4/14'>Sir. 4:14</a>",
      "comment": "Judith’s reputation for wisdom is affirmed by the elders, paralleling biblical themes where righteous leadership is recognized by the community from an early age."
    },
    {
      "pk": 18008030,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 30,
      "text": "But the people were so thirsty that they compelled us to do for them what we have promised, and made us take an oath that we cannot break.",
      "links": "<a href='/AIV/2/17/2'>Exod. 17:2-3</a>; <a href='/AIV/4/20/2'>Num. 20:2-5</a>; <a href='/AIV/23/106/32'>Ps. 106:32-33</a>",
      "comment": "The leaders’ oath in response to the people's distress highlights the tension between communal necessity and individual conscience during crisis, a dilemma seen in other biblical narratives."
    },
    {
      "pk": 18008031,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 31,
      "text": "Pray for us, for you are a godly woman, and God may hear your prayers so that rain will fall and fill up our cisterns, and we will not faint.",
      "links": "<a href='/AIV/18/8/6'>Judith 8:6</a>; <a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Requesting Judith’s intercession prefigures the value of community prayer and the intercessory role of holy men and women throughout the ages."
    },
    {
      "pk": 18008032,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 32,
      "text": "Judith answered, 'Hear me. I will do something that will be remembered by generations of our people.",
      "links": "<a href='/AIV/18/13/16'>Judith 13:16</a>; <a href='/AIV/42/1/48'>Luke 1:48</a>",
      "comment": "Her resolve to act recalls God working through humble servants, with echoes of Mary’s Magnificat ('all generations will call me blessed').",
      "sectionHeader": "Judith's Resolve and the Elders' Blessing"
    },
    {
      "pk": 18008033,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 33,
      "text": "Tonight, you will stand at the gate, and I will go out with my maid. Do not inquire about what I am doing until I return.",
      "links": "<a href='/AIV/18/10/1'>Judith 10:1</a>; <a href='/AIV/18/13/20'>Judith 13:20</a>",
      "comment": "Judith’s secrecy hints at obedience and trust, reminiscent of figures who step forward in faith, trusting God’s mysterious plan."
    },
    {
      "pk": 18008034,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 34,
      "text": "Only, do not try to find out what I am doing; for I will not tell you until I have finished what I am about to do.",
      "links": "<a href='/AIV/19/4/16'>Esth. 4:16</a>; <a href='/AIV/49/2/19'>Luke. 2:19</a>",
      "comment": "Judith requests secrecy regarding her plan, demonstrating faith-driven initiative akin to Esther or Deborah, which contrasts communal deliberation with divinely inspired action."
    },
    {
      "pk": 18008035,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 35,
      "text": "Then they said, 'Go in peace. May the Lord God go before you, to take vengeance on our enemies.'",
      "links": "<a href='/AIV/2/13/21'>Ex. 13:21</a>; <a href='/AIV/18/13/4'>Judith 13:4</a>",
      "comment": "A prayer of blessing recalls not only God as the guide, but the responsibility to let God’s justice come by his own means."
    },
    {
      "pk": 18008036,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 36,
      "text": "So they left the tent and returned to their posts.",
      "links": "<a href='/AIV/18/10/6'>Judith 10:6</a>",
      "comment": "This closing notes the readiness and submission of the elders to Judith’s faith-driven leadership, prefiguring how humble and obedient service can prepare the way for God’s deliverance."
    }
  ],
  "translatedAt": "2026-01-02T07:10:49.053Z",
  "sections": [
    {
      "title": "Judith's Family and Widowhood",
      "startVerse": 1,
      "endVerse": 8
    },
    {
      "title": "Judith Summons the Elders",
      "startVerse": 9,
      "endVerse": 10
    },
    {
      "title": "Judith's Exhortation to Trust in God",
      "startVerse": 11,
      "endVerse": 31
    },
    {
      "title": "Judith's Resolve and the Elders' Blessing",
      "startVerse": 32,
      "endVerse": 36
    }
  ]
}