{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 7,
  "verses": [
    {
      "pk": 18007001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 1,
      "text": "The next day, Holofernes ordered all his army and the allied forces to move against Bethulia, to take possession of the hill country and seize all the mountain passes.",
      "links": "<a href='/AIV/18/4/7'>Jdt 4:7</a>; <a href='/AIV/18/6/1'>Jdt 6:1</a>",
      "comment": "This verse shows the military strategy against the faithful in Bethulia, emphasizing the importance of defending the holy city, reminiscent of the defense of Jerusalem (Nehemiah 4:13).",
      "sectionHeader": "The Siege of Bethulia"
    },
    {
      "pk": 18007002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 2,
      "text": "All the fighting men moved up that night, taking positions near the springs on the slopes below Bethulia. They placed their main camp in the valley and deployed auxiliary troops to block the access roads.",
      "links": "<a href='/AIV/18/6/12'>Jdt 6:12</a>",
      "comment": "The besieging army not only plans to cut off water but also lines of escape. The motif of water and siege recalls other biblical moments of trial, such as Exodus 14:22, drawing a parallel to spiritual sustenance in difficult times."
    },
    {
      "pk": 18007003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 3,
      "text": "Their camp extended over the entire plain, covering it from Dothan to Belbaim, facing Bethulia.",
      "links": "<a href='/AIV/18/3/9'>Jdt 3:9</a>",
      "comment": "The scope of enemy presence surrounding the city underscores the dire situation, illustrating the overwhelming opposition often faced by the people of God."
    },
    {
      "pk": 18007004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 4,
      "text": "When the Israelites saw the immense multitude, they were greatly troubled and said to each other, 'These people are going to consume the whole land. Not even the highest mountain or deepest valley will escape their strength.'",
      "links": "<a href='/AIV/19/46/2'>Ps. 46:2</a>; <a href='/AIV/18/6/19'>Jdt 6:19</a>",
      "comment": "The fear and anxiety of the people reflect common human reactions to overwhelming trouble, yet God's providence is often revealed in such moments, foreshadowing Christ's own steadfastness during His Passion."
    },
    {
      "pk": 18007005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 5,
      "text": "Still, each man took up his arms. They lit fires on the ramparts and kept watch all night.",
      "links": "<a href='/AIV/16/4/21'>Neh. 4:21</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "The vigilance of the city’s defenders highlights the call for perseverance and spiritual alertness, a recurring theme seen in the Gospels (Mark 13:33)."
    },
    {
      "pk": 18007006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 6,
      "text": "On the second day, Holofernes led out all his cavalry in full view of the Israelites at Bethulia. He inspected the approaches to their city and looked for all the springs supplying water at the base of the hill.",
      "links": "<a href='/AIV/12/18/17'>2Kgs. 18:17</a>; <a href='/AIV/7/7/24'>Judg. 7:24</a>; <a href='/AIV/29/36/2'>Isa. 36:2</a>",
      "comment": "Holofernes’ inspection and show of force exploits psychological warfare, and his focus on the water supply reveals ancient siege tactics, recognizing that a city’s survival depended on access to water (cf. 2 Kings 18:31).",
      "sectionHeader": "The Counsel of Achior"
    },
    {
      "pk": 18007007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 7,
      "text": "He seized the springs of water and stationed troops there, placing a guard over them. Then, returning to his officers, he gathered together the leaders of the Edomites, the Moabites, and the commanders of the coastland.",
      "links": "<a href='/AIV/14/32/3'>2Chr. 32:3-4</a>; <a href='/AIV/7/3/12'>Judg. 3:12-14</a>; <a href='/AIV/4/20/17'>Num. 20:17-18</a>",
      "comment": "By seizing the springs, Holofernes begins strangling Bethulia strategically, while involving local chieftains (Edomites, Moabites, coastlanders) reflects the broad coalition against Israel, reminiscent of Psalm 83:6-8."
    },
    {
      "pk": 18007008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 8,
      "text": "Then all the chieftains of the Edomites and all the leaders of the Moabites and the commanders of the coastland came to him and said,",
      "links": "<a href='/AIV/4/22/4'>Num. 22:4</a>; <a href='/AIV/23/83/6'>Ps. 83:6-8</a>",
      "comment": "The gathering of regional leaders demonstrates the political and military alliances arrayed against Israel and sets the stage for their counsel to Holofernes."
    },
    {
      "pk": 18007009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 9,
      "text": "\"Listen to what we have to say, my lord, and your army will suffer no losses.",
      "links": "<a href='/AIV/5/20/10'>Deut. 20:10</a>; <a href='/AIV/24/15/22'>Prov. 15:22</a>",
      "comment": "Their promise of a strategy that guarantees no losses appeals to Holofernes’ ambitions and underscores the reliance on attrition rather than direct conflict."
    },
    {
      "pk": 18007010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 10,
      "text": "This people, the Israelites, do not rely on their spears but on the height of the mountains where they live, for it is not easy to reach the tops of their mountains.",
      "links": "<a href='/AIV/23/125/2'>Ps. 125:2</a>; <a href='/AIV/23/121/1'>Ps. 121:1-2</a>",
      "comment": "The advisers observe that Israel’s strength lies in their mountain stronghold, not in military might—echoing the frequent biblical theme of God’s people relying on positions of perceived weakness (cf. 2 Chronicles 32:7-8).",
      "sectionHeader": "The Suffering of Bethulia"
    },
    {
      "pk": 18007011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 11,
      "text": "Therefore, my lord, do not fight against them in regular formation, and not a man of your army will fall.",
      "links": "<a href='/AIV/6/6/2'>Josh. 6:2-3</a>; <a href='/AIV/14/20/15'>2Chr. 20:15-17</a>",
      "comment": "A recommendation for a siege rather than direct battle illustrates ancient wisdom regarding warfare and foreshadows God’s people being tested by endurance rather than force."
    },
    {
      "pk": 18007012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 12,
      "text": "Remain in your camp, and keep all the men in your forces with you; let your servants take possession of the spring of water that flows from the foot of the mountain,",
      "links": "<a href='/AIV/7/9/45'>Judg. 9:45</a>; <a href='/AIV/10/17/2'>2Sam. 17:2</a>",
      "comment": "The suggestion to control the spring reinforces the centrality of water and sustenance in ancient warfare, with deprivation as the chosen tactic (cf. Deuteronomy 28:53-57's siege warnings).",
      "sectionHeader": "The People's Lament and Uzziah’s Promise"
    },
    {
      "pk": 18007013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 13,
      "text": "for this is where all the people of Bethulia get their water. So thirst will destroy them, and they will surrender their town. Meanwhile, we and our people will go up to the tops of the nearby mountains and camp there to keep watch to see that no one gets out of the town.",
      "links": "<a href='/AIV/12/6/24'>2Kgs. 6:24-25</a>; <a href='/AIV/31/4/4'>Lam. 4:4</a>",
      "comment": "The plan to induce surrender through thirst recalls the grim reality of siege warfare and highlights the vulnerability of a city cut off from its lifelines."
    },
    {
      "pk": 18007014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 14,
      "text": "They and their wives and children will waste away with famine, and before the sword reaches them they will be strewn about in the streets where they live.",
      "links": "<a href='/AIV/3/26/39'>Lev. 26:39</a>; <a href='/AIV/31/2/11'>Lam. 2:11-12</a>",
      "comment": "The predicted suffering of women and children emphasizes the communal cost of war and is evocative of the lamentations attached to Jerusalem’s sieges (cf. Lamentations 2:11-12)."
    },
    {
      "pk": 18007015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 15,
      "text": "Thus you will pay them back with evil, because they rebelled and did not receive you peaceably.”",
      "links": "<a href='/AIV/5/32/35'>Deut. 32:35</a>; <a href='/AIV/38/1/10'>Obad. 1:10</a>",
      "comment": "The rationale for vengeance is presented as just retribution for Israel’s resistance, echoing the pervasive theme of divine and human reckoning in the Old Testament (cf. Deuteronomy 32:35)."
    },
    {
      "pk": 18007016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 16,
      "text": "These words pleased Holofernes and all his attendants, and he gave orders to do as they had said.",
      "links": "<a href='/AIV/24/21/30'>Prov. 21:30</a>; <a href='/AIV/19/3/9'>Esth. 3:9-10</a>",
      "comment": "Holofernes readily accepts the counsel, underscoring his calculative cruelty and the pragmatic acceptance of ruthless strategies in ancient military leadership."
    },
    {
      "pk": 18007017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 17,
      "text": "So the army of the Ammonites moved forward, together with five thousand Assyrians, and they encamped in the valley and seized the water supply and the springs of the Israelites.",
      "links": "<a href='/AIV/7/7/24'>Judg. 7:24</a>; <a href='/AIV/14/32/4'>2Chr. 32:4</a>",
      "comment": "The mobilization of Ammonites and Assyrians demonstrates the unity of Israel’s foes and the tactical sealing off of the city’s water supply marks the intensification of the siege."
    },
    {
      "pk": 18007018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 18,
      "text": "And the Edomites and Ammonites went up and encamped in the hill country opposite Dothan; and they sent some of their men toward the south and the east, toward Egrebeh, which is near Chusi beside the Wadi Mochmur. The rest of the Assyrian army encamped in the plain, and covered the whole face of the land. Their tents and supply trains spread out in great number, and they formed a vast multitude.",
      "links": "<a href='/AIV/1/37/17'>Gen. 37:17</a>; <a href='/AIV/7/4/13'>Judg. 4:13</a>; <a href='/AIV/6/10/5'>Josh. 10:5</a>",
      "comment": "The extensive deployment of enemy troops around Bethulia creates an image of total encirclement and overwhelming odds, emphasizing the isolation and apparent hopelessness of the Israelites (cf. Psalm 3:6)."
    },
    {
      "pk": 18007019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 19,
      "text": "The Israelites then cried out to the Lord their God, for their courage failed, because all their enemies had surrounded them, and there was no way of escape from them.",
      "links": "<a href='/AIV/2/14/10'>Exod. 14:10</a>; <a href='/AIV/7/6/6'>Judg. 6:6</a>; <a href='/AIV/9/7/8'>1Sam. 7:8</a>",
      "comment": "The Israelites’ despair and collective prayer reflect a recurring pattern in Scripture when Israel faces overwhelming crisis (cf. Judges 10:10-16), highlighting prayer as a last refuge."
    },
    {
      "pk": 18007020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 20,
      "text": "The whole Assyrian army, their infantry, chariots, and cavalry, surrounded them for thirty-four days, until all the water containers of every inhabitant of Bethulia were empty;",
      "links": "<a href='/AIV/12/6/25'>2Kgs. 6:25</a>; <a href='/AIV/31/4/9'>Lam. 4:9</a>",
      "comment": "Thirty-four days of siege exhausts the city’s resources and symbolizes prolonged divine testing, reminiscent of other periods of trial (e.g., Numbers 14:33’s years of wandering)."
    },
    {
      "pk": 18007021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 21,
      "text": "their cisterns were going dry, and on no day did they have enough water to drink, for their drinking water was rationed.",
      "links": "<a href='/AIV/31/2/11'>Lam. 2:11-12</a>; <a href='/AIV/39/4/8'>Jonah. 4:8</a>",
      "comment": "The rationing and drying up of cisterns illustrate the life-threatening reality of siege, reinforcing the severity of Bethulia’s plight."
    },
    {
      "pk": 18007022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 22,
      "text": "Their children were listless, and the women and young men fainted from thirst and were collapsing in the streets of the town and in the gateways; they no longer had any strength.",
      "links": "<a href='/AIV/31/2/19'>Lam. 2:19</a>; <a href='/AIV/36/1/20'>Joel. 1:20</a>",
      "comment": "The visible suffering of the vulnerable—children, women, and young men—heightens the narrative’s pathos, emphasizing the devastating impact of siege conditions (cf. Lamentations 2:19)."
    },
    {
      "pk": 18007023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 23,
      "text": "Then all the people, the young men, the women, and the children, gathered around Uzziah and the rulers of the town and cried out with a loud voice, and said before all the elders,",
      "links": "<a href='/AIV/2/16/2'>Exod. 16:2-3</a>; <a href='/AIV/4/14/2'>Num. 14:2</a>",
      "comment": "The people’s appeal to their leaders shows the social strain and desperation a siege brings, and the burden leaders bear in crisis (cf. Exodus 17:2-4)."
    },
    {
      "pk": 18007024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 24,
      "text": "\"Let God judge between you and us! You have done us a great injury in not making peace with the Assyrians.",
      "links": "<a href='/AIV/1/31/53'>Gen. 31:53</a>; <a href='/AIV/7/11/27'>Judg. 11:27</a>",
      "comment": "Blaming their leaders for refusing terms with the enemy reveals growing internal dissent and a loss of faith, foreshadowing the people’s recurring struggles with leadership and judgment (cf. Numbers 14:2-4)."
    },
    {
      "pk": 18007025,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 25,
      "text": "For now we have no one to help us; God has sold us into their hands, to be strewn before them in thirst and exhaustion.",
      "links": "<a href='/AIV/5/32/30'>Deut. 32:30</a>; <a href='/AIV/6/7/7'>Josh. 7:7</a>; <a href='/AIV/7/4/9'>Judg. 4:9</a>",
      "comment": "The sense of divine abandonment reflects Israel’s theology of covenant, where national calamity is perceived as the result of God’s judgment for collective sin (cf. Judges 2:14-15)."
    },
    {
      "pk": 18007026,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 26,
      "text": "Now summon them and surrender the whole town as booty to the army of Holofernes and to all his forces.",
      "links": "<a href='/AIV/30/38/17'>Jer. 38:17</a>; <a href='/AIV/35/9/17'>Hos. 9:17</a>",
      "comment": "The call to surrender—out of fear of death and suffering—highlights the extremity of the situation and the challenge of persevering in faith under duress."
    },
    {
      "pk": 18007027,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 27,
      "text": "For it would be better for us to be captured by them. We shall indeed become slaves, but our lives will be spared, and we shall not witness our little ones dying before our eyes, and our wives and children drawing their last breath.",
      "links": "<a href='/AIV/2/14/12'>Exod. 14:12</a>; <a href='/AIV/31/4/10'>Lam. 4:10</a>",
      "comment": "Their willingness to accept enslavement for survival contrasts the dilemma between physical life and liberty, echoing similar crises in Israel’s history (cf. Jeremiah 38:2)."
    },
    {
      "pk": 18007028,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 28,
      "text": "We call to witness against you heaven and earth and our God, the Lord of our ancestors, who punishes us for our sins and the sins of our ancestors; do today the things that we have described!”",
      "links": "<a href='/AIV/5/30/19'>Deut. 30:19</a>; <a href='/AIV/29/1/2'>Isa. 1:2</a>",
      "comment": "The people invoke God as witness to their suffering and judge of their leaders, blending lamentation with confession of sin and the theological link between suffering and transgression (cf. Deuteronomy 30:1-3; Daniel 9:5-6).",
      "sectionHeader": "Prayer in Distress"
    },
    {
      "pk": 18007029,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 29,
      "text": "Then great and general lamentation arose throughout the assembly, and they cried out to the Lord God with a loud voice.",
      "links": "<a href='/AIV/7/2/4'>Judg. 2:4</a>; <a href='/AIV/9/7/6'>1Sam. 7:6</a>; <a href='/AIV/36/1/14'>Joel. 1:14</a>",
      "comment": "The unified, loud lament before God demonstrates the communal nature of prayer and repentance in crisis, intending to prompt divine compassion (cf. Joel 2:17)."
    },
    {
      "pk": 18007030,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 30,
      "text": "But Uzziah said to them, “Courage, my brothers and sisters! Let us hold out for five days more; by that time the Lord our God will turn his mercy to us again, for he will not forsake us utterly.",
      "links": "<a href='/AIV/5/31/6'>Deut. 31:6</a>; <a href='/AIV/31/3/31'>Lam. 3:31-32</a>; <a href='/AIV/23/27/14'>Ps. 27:14</a>",
      "comment": "Uzziah’s exhortation to hold out and trust in God’s mercy demonstrates leadership under duress and reveals faith in ultimate divine deliverance (cf. Psalm 27:14)."
    },
    {
      "pk": 18007031,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 31,
      "text": "But if these days pass by, and no help comes for us, I will do as you say.”",
      "links": "<a href='/AIV/2/16/28'>Exod. 16:28</a>; <a href='/AIV/7/6/13'>Judg. 6:13</a>",
      "comment": "Uzziah’s conditional promise offers a compromise, reflecting the tension between faith and pragmatism when divine intervention is not yet manifest."
    },
    {
      "pk": 18007032,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 32,
      "text": "Then he dismissed the people to their various posts, and they went up on the walls and towers of their town. The women and children he sent home. In the town they were in great misery.",
      "links": "<a href='/AIV/16/4/13'>Neh. 4:13</a>; <a href='/AIV/9/30/6'>1Sam. 30:6</a>",
      "comment": "The return of the people to their desperate posts while suffering persists captures the suspense and imminent need for God’s deliverance, setting the stage for the unfolding of salvation (cf. Exodus 14:13)."
    }
  ],
  "translatedAt": "2025-12-28T06:58:02.877Z",
  "sections": [
    {
      "title": "The Siege of Bethulia",
      "startVerse": 1,
      "endVerse": 5
    },
    {
      "title": "The Counsel of Achior",
      "startVerse": 6,
      "endVerse": 9
    },
    {
      "title": "The Suffering of Bethulia",
      "startVerse": 10,
      "endVerse": 11
    },
    {
      "title": "The People's Lament and Uzziah’s Promise",
      "startVerse": 12,
      "endVerse": 27
    },
    {
      "title": "Prayer in Distress",
      "startVerse": 28,
      "endVerse": 32
    }
  ]
}