{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 11,
  "verses": [
    {
      "pk": 18011001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 1,
      "text": "Then Holofernes said to her, \"Take courage, woman. Do not be afraid in your heart, for I have never harmed anyone who chose to serve Nebuchadnezzar, the king of all the earth.",
      "links": "<a href='/AIV/27/3/4'>Dan 3:4</a>; <a href='/AIV/12/18/25'>2 Kgs 18:25</a>",
      "comment": "Holofernes presents himself as merciful to those who submit, echoing the theme of rulers demanding ultimate loyalty. Nebuchadnezzar's title, 'king of all the earth,' points towards rulers claiming divine authority, which has parallels in later biblical prophecy.",
      "sectionHeader": "Judith Before Holofernes"
    },
    {
      "pk": 18011002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 2,
      "text": "Now, if your people who live in these mountains had not despised me, I would not have lifted my spear against them. But they did this to themselves.",
      "links": "<a href='/AIV/07/8/34'>Judg 8:34</a>; <a href='/AIV/14/20/23'>2 Chr 20:23</a>",
      "comment": "The assertion that people bring punishment on themselves points to the recurring biblical principle of reaping what one sows (see Gal 6:7). It sets up the narrative contrast between prideful resistance and humble submission."
    },
    {
      "pk": 18011003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 3,
      "text": "But now, tell me for what reason you have fled from them and have come to us. It is clear that you have come for your own safety. Take heart—you will live tonight, and no harm will come to you.",
      "links": "<a href='/AIV/06/2/13'>Josh 2:13</a>; <a href='/AIV/08/3/13'>Ruth 3:13</a>",
      "comment": "Holofernes offers Judith safety, reminiscent of Rahab’s negotiation with the Israelite spies (Josh 2:13). The importance of refuge and safety ties into the biblical theme of God as a protector."
    },
    {
      "pk": 18011004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 4,
      "text": "No one will hurt you. Rather, all will treat you well, as they do the servants of my lord King Nebuchadnezzar.",
      "links": [
        "Gen 39:4",
        "Dan 1:9",
        "Esth 2:17"
      ],
      "comment": "Holofernes assures Judith of her safety by appealing to the benevolence extended to those serving Nebuchadnezzar, highlighting ancient customs of honoring envoys and reflecting the high regard for royal authority (cf. Esther 2:9)."
    },
    {
      "pk": 18011005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 5,
      "text": "Judith replied, \"Accept the words of your servant. Allow your servant to speak to you, and I will tell you nothing false tonight.",
      "links": "<a href='/AIV/01/24/33'>Gen 24:33</a>; <a href='/AIV/18/32/21'>Job 32:21-22</a>",
      "comment": "Judith’s humble approach aligns with biblical examples of wise speech and honest petitioning before authority (cf. Esther and Daniel)."
    },
    {
      "pk": 18011006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 6,
      "text": "If you follow the words of your servant, God will accomplish something through you, and my lord will not fail in any of his purposes.",
      "links": "<a href='/AIV/01/50/20'>Gen 50:20</a>; <a href='/AIV/27/2/21'>Dan 2:21</a>",
      "comment": "Judith’s statement recognizes divine providence working through human instruments, recalling Joseph’s words (Gen 50:20) and Daniel’s prayers (Dan 2:21). Subtly, it highlights how God works His purposes even through the hands of others, emphasizing trust in His sovereign guidance."
    },
    {
      "pk": 18011007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 7,
      "text": "As surely as Nebuchadnezzar lives, who rules over all living things, and as surely as your authority is real under him, you will not fail in what I say.",
      "links": "<a href='/AIV/27/3/9'>Dan 3:9</a>",
      "comment": "Judith cleverly appeals to Holofernes’ sense of power, but ultimately, her loyalty remains with God, whom she never names directly in this moment. The interplay of temporal and divine authority is a key biblical theme."
    },
    {
      "pk": 18011008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 8,
      "text": "For we have heard of your wisdom and skill, and it is reported throughout the whole world that you alone are the best in the whole kingdom, the most informed and the most astounding in military strategy.",
      "links": [
        "1 Kgs 10:1-9",
        "Sir 44:3-4",
        "Dan 2:48"
      ],
      "comment": "Judith flatters Holofernes, acknowledging his reputation for unparalleled wisdom and military skill, a common diplomatic strategy in the Ancient Near East to win favor and create rapport (cf. 1 Kings 10:1-9 regarding Solomon)."
    },
    {
      "pk": 18011009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 9,
      "text": "Now as for Achior’s speech in your council, we have heard his words, for the people of Bethulia spared him and he told them all he had said to you.",
      "links": [
        "Jdt 6:10-14",
        "Num 22:31-35",
        "Josh 2:8-14"
      ],
      "comment": "Judith references Achior's earlier speech (Judith 5–6), revealing her knowledge of Assyrian council proceedings and positioning herself as trustworthy and well-informed before Holofernes."
    },
    {
      "pk": 18011010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 10,
      "text": "Therefore, lord and master, do not disregard what he said, but keep it in your mind, for it is true. Indeed our nation cannot be punished, nor can the sword prevail against them, unless they sin against their God.",
      "links": [
        "Deut 28:15",
        "Josh 7:11-12",
        "Jdt 5:20-21"
      ],
      "comment": "Echoing Achior’s testimony, Judith emphasizes a Deuteronomic theme: Israel’s security depends on covenant faithfulness, as God alone permits or restricts their defeat (cf. Deut 28:1, 15; Josh 7:11-12).",
      "sectionHeader": "Judith Reveals Israel’s Plight and Her Plan"
    },
    {
      "pk": 18011011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 11,
      "text": "But now, so that you, my lord, may not be defeated or have your purpose thwarted, death will come upon them. For a sin has overtaken them, by which they are about to provoke their God to anger when they do what is wrong.",
      "links": "<a href='/AIV/27/1/8'>Dan 1:8</a>; <a href='/AIV/03/11/47'>Lev 11:47</a>",
      "comment": "Reference to the Law’s dietary rules connects to Daniel refusing defiled food (Dan 1:8), emphasizing the holiness present in obedience to sacred law and tradition."
    },
    {
      "pk": 18011012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 12,
      "text": "Since their food supply is exhausted and their water is almost gone, they have planned to kill their livestock and have resolved to eat whatever God’s laws have forbidden them.",
      "links": "<a href='/AIV/03/2/12'>Lev 2:12</a>; <a href='/AIV/04/18/28-32'>Num 18:28-32</a>",
      "comment": "Observance of sacred offerings is central in the Old Testament (cf. Num 18:28-32). This hints at the purity and mediating role reserved for consecrated ministers, which continues mystically in the tradition of offering."
    },
    {
      "pk": 18011013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 13,
      "text": "They have decided to consume the first fruits of the grain and the tithes of the wine and oil, which they had consecrated and set aside for the priests who minister in the presence of our God in Jerusalem—things it is not lawful for any of the people even to touch with their hands.",
      "links": "<a href='/AIV/15/10/8'>Ezra 10:8</a>; <a href='/AIV/16/8/1'>Neh 8:1</a>",
      "comment": "The involvement of elders and Jerusalem as the religious center reflects the unity and authority found within the sacred assembly."
    },
    {
      "pk": 18011014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 14,
      "text": "Since even the people in Jerusalem have been doing this, they have sent messengers there to bring back permission from the council of the elders.",
      "links": "<a href='/AIV/03/22/9'>Lev 22:9</a>",
      "comment": "Eating what is set apart for the sanctuary was seen as a grave offense (Lev 22:9). Maintaining the holiness of offerings is seen as essential for remaining in God's favor—a practice with enduring spiritual meaning."
    },
    {
      "pk": 18011015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 15,
      "text": "When the response reaches them and they act upon it, on that very day they will be given into your hands to be destroyed.",
      "links": "<a href='/AIV/02/9/16'>Exod 9:16</a>;<a href='/AIV/27/6/26-27'>Dan 6:26-27</a>",
      "comment": "God’s wonders are linked to His universal plan of salvation. Miraculous acts are meant to evoke faith across nations, foreshadowing future revelations."
    },
    {
      "pk": 18011016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 16,
      "text": "For your servant is godfearing and serves the God of heaven, and I will stay with you, my lord, but every night your servant will go out into the valley and pray to God. He will tell me when they have committed their sins.",
      "links": "<a href='/AIV/01/20/7'>Gen 20:7</a>; <a href='/AIV/27/6/10'>Dan 6:10</a>",
      "comment": "Judith’s request for time to pray recalls Daniel’s daily prayer (Dan 6:10). Continual prayer is a spiritual discipline taught throughout the scriptures."
    },
    {
      "pk": 18011017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 17,
      "text": "Then I will return and let you know, so you can go out with all your army. Not one of them will be able to resist.",
      "links": "<a href='/AIV/07/4/14'>Judg 4:14</a>",
      "comment": "Judith seeks to be both an instrument and a channel of God’s will. Her intercession has significant power, a pattern found often in biblical mediators."
    },
    {
      "pk": 18011018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 18,
      "text": "I will lead you through the territory of Judea until you reach Jerusalem, and I will set your throne in the midst of it. You will drive them out like sheep that have no shepherd, and not even a dog will bark at you.",
      "links": "<a href='/AIV/04/23/22'>Num 23:22'>Num 23:22</a>; <a href='/AIV/26/34/5'>Ezek 34:5</a>",
      "comment": "The imagery of a people 'without a shepherd' recalls prophetic descriptions of spiritual need (Ezek 34:5; cf. Matt 9:36). Judith speaks prophetically, blending truth and irony, preparing the way for a decisive act."
    },
    {
      "pk": 18011019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 19,
      "text": "All these things have been told to me in advance, and I was sent to declare them to you.",
      "links": "<a href='/AIV/09/3/11'>1 Sam 3:11</a>",
      "comment": "Judith’s claim of revelation marks her as a prophet-like figure. Such authority to declare God’s will is rare and carries deep responsibility."
    },
    {
      "pk": 18011020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 20,
      "text": "Her words pleased Holofernes and all his servants. They marveled at her wisdom and said,",
      "links": [
        "1 Kgs 10:6-9",
        "Jdt 8:29",
        "Dan 2:46-47"
      ],
      "comment": "Judith’s rhetoric wins admiration from Holofernes and his servants, setting up the dramatic tension between her outward compliance and her true intentions, and foreshadowing the motif of wisdom overcoming might (cf. Prov 21:22)."
    },
    {
      "pk": 18011021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 21,
      "text": "No other woman from one end of the earth to the other looks so beautiful or speaks so wisely!",
      "links": [
        "Esth 2:7",
        "1 Sam 25:3",
        "Sir 36:22"
      ],
      "comment": "Judith's beauty and eloquence are seen as exceptional, emphasizing the frequent biblical theme of God using unexpected instruments—especially wise women—to achieve deliverance (cf. Esther 2:17; 2 Sam 14:2–20)."
    },
    {
      "pk": 18011022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 22,
      "text": "Then Holofernes said to her, “God has done well to send you ahead of the people, to strengthen our hands and bring destruction on those who have despised my lord.”",
      "links": [
        "Gen 50:20",
        "Josh 2:9-11",
        "Jdt 13:17"
      ],
      "comment": "Holofernes interprets Judith's arrival as divinely ordained to aid his campaign, ironically expressing a theological truth inverted from the narrative's actual outcome, reminiscent of Pharaoh's misunderstanding of God's purposes in Exodus 10:1–2.",
      "sectionHeader": "Judith Wins Favor with Holofernes"
    },
    {
      "pk": 18011023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 23,
      "text": "Holofernes said to her, \"God has done well to send you ahead of the people, so you may have power in their midst. You are beautiful and wise in your speech. If you do as you have promised, your God will be my God, and you shall live in the palace of King Nebuchadnezzar and be known throughout all the earth.\"",
      "links": "<a href='/AIV/08/1/16'>Ruth 1:16</a>; <a href='/AIV/27/6/26'>Dan 6:26</a>",
      "comment": "Holofernes’ declaration parallels Ruth's words of conversion (Ruth 1:16), foreshadowing the universality and outreach of the faith. The idea of becoming renowned among all peoples points to God's desire for His truth to reach all nations through the holy example of His servants."
    }
  ],
  "translatedAt": "2025-12-28T23:43:43.810Z",
  "sections": [
    {
      "title": "Judith Before Holofernes",
      "startVerse": 1,
      "endVerse": 9
    },
    {
      "title": "Judith Reveals Israel’s Plight and Her Plan",
      "startVerse": 10,
      "endVerse": 21
    },
    {
      "title": "Judith Wins Favor with Holofernes",
      "startVerse": 22,
      "endVerse": 23
    }
  ]
}