{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 5,
  "sections": [
    {
      "title": "Holofernes Learns of Israel’s Defenses",
      "startVerse": 1,
      "endVerse": 21
    },
    {
      "title": "Hostility Against Achior",
      "startVerse": 22,
      "endVerse": 24
    }
  ],
  "verses": [
    {
      "pk": 18005001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 1,
      "text": "It was reported to Holofernes, the commander of the Assyrian army, that the Israelites had prepared for war, closed the mountain passes, fortified every high hill, and set up obstacles in the plains.",
      "links": "<a href='/AIV/15/4/1'>Ezra 4:1</a>; <a href='/AIV/16/4/7'>Neh 4:7</a>",
      "comment": "This verse sets the context for the chapter, revealing Israel's defensive preparations against an invading power. It echoes Israel’s historic trust in God and strategic readiness.",
      "sectionHeader": "Holofernes Learns of Israel’s Defenses"
    },
    {
      "pk": 18005002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 2,
      "text": "He was furious when he heard this, and he called together all the rulers of Moab, the leaders of Ammon, and all the governors of the coastal regions.",
      "links": "<a href='/AIV/7/3/12'>Judg 3:12-14</a>",
      "comment": "Holofernes' anger and response reveal the threat Israel posed to regional powers when united in defense, hinting at a recurring biblical theme of God’s people disturbing the peace of evildoers."
    },
    {
      "pk": 18005003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 3,
      "text": "He said to them, 'Tell me, you men of Canaan, who is this people that lives in the hill country? What towns do they inhabit, how large is their army, and what is the source of their power and strength? Who is their king, and who leads their army?'",
      "links": "<a href='/AIV/6/2/9'>Josh 2:9-11</a>",
      "comment": "Holofernes’ interrogation reflects a worldly perspective, measuring strength by numbers and leadership. This contrasts with the Bible’s theme that true strength comes from faith in God."
    },
    {
      "pk": 18005004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 4,
      "text": "He continued, 'Why have they alone refused to come out to meet me, like all the inhabitants of the West?'",
      "links": "<a href='/AIV/1/14/8'>Gen 14:8-12</a>;<a href='/AIV/7/2/10'>Judg 2:10-12</a>",
      "comment": "Israel's separate identity and fidelity is emphasized. Their refusal to submit symbolizes the principle of being set apart for God."
    },
    {
      "pk": 18005005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 5,
      "text": "Then Achior, the leader of all the Ammonites, said to him, 'Let my lord hear a word from his servant, and I will tell you the truth about this people who dwell in the hill country. No lie will come from your servant’s mouth.'",
      "links": "<a href='/AIV/4/34/17'>Num 34:17-19</a>",
      "comment": "Achior presents himself as a trustworthy source. This will be important for his later positive portrayal and the significance given to truth-telling—a virtue emphasized throughout Scripture."
    },
    {
      "pk": 18005006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 6,
      "text": "This people are descendants of the Chaldeans.",
      "links": "<a href='/AIV/1/11/28-31'>Gen 11:28-31</a>; <a href='/AIV/6/24/2'>Josh 24:2</a>",
      "comment": "Achior roots Israel’s origin in Chaldea, recalling Abraham’s call. Tracing spiritual ancestry is a recurring theme, especially in understanding covenant and salvation history."
    },
    {
      "pk": 18005007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 7,
      "text": "They once lived as sojourners in Mesopotamia, because they were unwilling to follow the gods of their ancestors, who were in Chaldea.",
      "links": "<a href='/AIV/1/12/1'>Gen 12:1</a>; <a href='/AIV/6/24/2'>Josh 24:2</a>",
      "comment": "Israel rejects idolatry for devotion to the one true God. This separation for the sake of holiness prefigures deeper biblical calls to faithful worship and obedience."
    },
    {
      "pk": 18005008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 8,
      "text": "They left the way of their ancestors and worshiped the God of heaven, the God they came to know. So they were driven out from the presence of their gods and fled to Mesopotamia, where they lived for a long time.",
      "links": "<a href='/AIV/6/24/2'>Josh 24:2</a>",
      "comment": "Emphasizing conversion and fidelity to the true God, which later resonates with New Testament ideas of being called out from among the nations (cf. 2 Cor 6:17). Faithfulness brings trials, yet is always rewarded."
    },
    {
      "pk": 18005009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 9,
      "text": "Their God commanded them to leave the place where they were living and to go into the land of Canaan. There they settled and became very prosperous in gold, silver, and livestock.",
      "links": "<a href='/AIV/1/12/1-9'>Gen 12:1-9</a>",
      "comment": "Divine command and blessing mark Israel’s journey—a pattern later fulfilled in how God leads His people into deeper covenant relationship by obedience and trust (cf. Heb 11:8)."
    },
    {
      "pk": 18005010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 10,
      "text": "But when a famine struck the land, they went down to Egypt and lived there as long as they found food. There they became an immense multitude, and none could number their descendants.",
      "links": "<a href='/AIV/1/46/6-7'>Gen 46:6-7</a>; <a href='/AIV/2/1/6-7'>Ex 1:6-7</a>",
      "comment": "Reference to the Egyptian sojourn and Israel’s increase in number. This typologically prefigures times of suffering followed by deliverance in salvation history."
    },
    {
      "pk": 18005011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 11,
      "text": "But the king of Egypt oppressed them with forced labor as they built his cities. Then they cried out to their God, who struck Egypt with dreadful plagues.",
      "links": "<a href='/AIV/2/1/8-14'>Ex 1:8-14</a>; <a href='/AIV/2/7/17-25'>Ex 7:17-25</a>",
      "comment": "This verse summarizes the Exodus—a central event of the Old Testament, prefiguring deliverance through Christ (cf. 1 Cor 10:1-4). Crying to God in distress and God’s rescue form a pattern of salvation."
    },
    {
      "pk": 18005012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 12,
      "text": "So Egypt drove them out from its presence, and God dried up the Red Sea before them,",
      "links": "<a href='/AIV/2/14/21-28'>Ex 14:21-28</a>",
      "comment": "The parting of the Red Sea is a dramatic symbol of divine intervention. It later becomes an archetype of baptism and liberation from sin (cf. 1 Cor 10:2, Rom 6:4)."
    },
    {
      "pk": 18005013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 13,
      "text": "and led them by the way to Sinai and to Kadesh Barnea. They drove out all who lived in the wilderness.",
      "links": "<a href='/AIV/4/10/12'>Num 10:12</a>; <a href='/AIV/6/5/6'>Josh 5:6</a>",
      "comment": "Israel’s journey through the wilderness reflects necessary purification before entering the promised rest, echoing the doctrine of sanctification."
    },
    {
      "pk": 18005014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 14,
      "text": "They settled in the land of the Amorites and, by their strength, wiped out all the people of Heshbon; then, crossing the Jordan, they took possession of all the hill country.",
      "links": "<a href='/AIV/4/21/21-26'>Num 21:21-26</a>; <a href='/AIV/6/3/14-17'>Josh 3:14-17</a>",
      "comment": "The conquest of Canaan demonstrates God’s faithfulness in granting the promised inheritance. The transition from wandering to security prefigures the Christian hope."
    },
    {
      "pk": 18005015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 15,
      "text": "They expelled the Canaanites, Perizzites, Jebusites, Shechemites, and all the Gergesites, and they lived there for many years.",
      "links": "<a href='/AIV/6/12/8-24'>Josh 12:8-24</a>",
      "comment": "Repeats the theme of holy separation for God's people. The continuous need for purity and faithfulness anticipates the spiritual warfare of later Christian life (cf. Eph 6:10-17)."
    },
    {
      "pk": 18005016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 16,
      "text": "As long as they did not sin against their God, they prospered, for God who hates wrongdoing was with them.",
      "links": "<a href='/AIV/4/14/34'>Num 14:34</a>; <a href='/AIV/19/1/6'>Psalm 1:6</a>",
      "comment": "This verse underscores the Deuteronomic theme that Israel’s prosperity depended on covenant faithfulness, echoing passages like Deuteronomy 28; it also highlights God's holiness and intolerance of injustice, reinforcing the narrative motif of divine protection as long as Israel avoided sin."
    },
    {
      "pk": 18005017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 17,
      "text": "But when they turned aside from the path he had set for them, they were defeated in great battles, carried off as captives, and the land was given over to their enemies.",
      "links": "<a href='/AIV/12/17/18-20'>2 Kings 17:18-20</a>",
      "comment": "Israel’s defeat is always linked with infidelity. Obedience to God’s law is presented as essential to true security, which resonates with later calls to perseverance in the faith (cf. Heb 3:12-14)."
    },
    {
      "pk": 18005018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 18,
      "text": "But now that they have returned to their God, they have come back from the places where they were scattered, regained Jerusalem, and now live in the hill country because it was left desolate.",
      "links": "<a href='/AIV/15/2/1'>Ezra 2:1</a>; <a href='/AIV/24/24/6'>Jer 24:6</a>",
      "comment": "Repentance and restoration are highlighted here, showing God’s readiness to forgive and renew His people—foreshadowing themes in the New Testament about reconciliation and return to grace."
    },
    {
      "pk": 18005019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 19,
      "text": "So now, my master and lord, if this people are living without offense to their God, they will be invincible, for their God will defend them, and we shall become the laughingstock of all the world.",
      "links": "<a href='/AIV/9/26/7'>2 Chron 26:7</a>; <a href='/AIV/19/46/7'>Ps 46:7</a>",
      "comment": "A non-Israelite recognizes divine protection as conditional upon fidelity. Even Israel’s enemies sense the reality of God’s covenant blessing and curse (see Deut 28)."
    },
    {
      "pk": 18005020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 20,
      "text": "But if they have sinned against their God, let us be sure that they will fall. Their God will give them over to us, and we will defeat them.",
      "links": "<a href='/AIV/6/7/13'>Josh 7:13</a>; <a href='/AIV/3/2/14'>Lam 2:14</a>",
      "comment": "The notion that sin removes God’s protecting hand speaks to the abiding importance of repentance and seeking God’s mercy—which remains central in Christian faith and life."
    },
    {
      "pk": 18005021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 21,
      "text": "Let us go up, then, and we will overpower them if their God is not with them.",
      "links": "<a href='/AIV/6/6/1'>Josh 6:1-2</a>",
      "comment": "Victory depends not on military strength but the presence of God. This central message underlies the hope and confidence of all the faithful amidst their battles."
    },
    {
      "pk": 18005022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 22,
      "text": "When Achior had finished saying these things, all the people, standing around the tent, began to grumble. Holofernes’ dignitaries and those living in the coastal region demanded that he be executed.",
      "links": "<a href='/AIV/19/2/1-3'>Ps 2:1-3</a>",
      "comment": "The truth can provoke hostility, especially among those who oppose God. Compare the fate of prophets and the reactions Jesus endured when speaking truth (cf. Matt 13:57).",
      "sectionHeader": "Hostility Against Achior"
    },
    {
      "pk": 18005023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 23,
      "text": "They said, 'We will not be afraid of the Israelites. See, they are a powerless and strengthless people. Let us go up, Lord Holofernes, and they will be devoured by your vast army.'",
      "links": "<a href='/AIV/23/10/8-14'>Isa 10:8-14</a>",
      "comment": "Boasts of military might and contempt for the seemingly weak are a recurring biblical motif. God works powerfully through the humble (cf. 1 Cor 1:27-29)."
    },
    {
      "pk": 18005024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 24,
      "text": "With those words, the crowd was roused to anger, and they plotted to destroy Achior and the Israelites.",
      "links": "<a href='/AIV/19/83/3'>Ps 83:3-4</a>; <a href='/AIV/4/16/41'>Num 16:41</a>",
      "comment": "The world’s rage against the people of God echoes through salvation history. Trust in God’s providence is always essential, even when surrounded by opponents."
    }
  ],
  "translatedAt": "2025-12-28T02:17:37.047Z"
}