{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 14,
  "sections": [
    {
      "title": "Judith's Instructions and the Enemy's Defeat",
      "startVerse": 1,
      "endVerse": 19
    }
  ],
  "verses": [
    {
      "pk": 18014001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 1,
      "text": "Then Judith said to them, \"Listen to me, my brothers. Take this head and hang it on the battlements of our city wall.\"",
      "links": "<a href='/AIV/7/7/25'>Judg. 7:25</a>; <a href='/AIV/9/15/7-8'>1 Sam. 17:54</a>",
      "comment": "Judith instructs the people to publicly display Holofernes' head, echoing the display of enemies defeated by God's people. The motif underscores God's deliverance through the humble and faithful.",
      "sectionHeader": "Judith's Instructions and the Enemy's Defeat"
    },
    {
      "pk": 18014002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 2,
      "text": "And when morning comes, each of you will take up your weapons, and every able-bodied man will go out from the city. You shall set a captain over them, as if you were about to go down into the plain toward the advance of the Assyrian army. Only do not go down.",
      "links": "<a href='/AIV/2/14/10-13'>Ex. 14:10-13</a>",
      "comment": "Judith orders the men to arm themselves as if going to battle, using a strategic ploy reminiscent of earlier biblical victories. Her wisdom and authority are foregrounded."
    },
    {
      "pk": 18014003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 3,
      "text": "Then the Assyrians will seize their armor and go into the camp to awaken their commanders. When they see Holofernes’ headless body, they will be seized with fear and will flee from before you.",
      "links": "<a href='/AIV/7/7/21-22'>Judg. 7:21-22</a>; <a href='/AIV/2/14/24-25'>Ex. 14:24-25</a>",
      "comment": "This anticipated panic among the enemy mirrors other Old Testament instances where God instilled fear in Israel's adversaries, showing God's sovereign action on behalf of the faithful."
    },
    {
      "pk": 18014004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 4,
      "text": "Then, as soon as you and all who live within the borders of Israel have overtaken them, give chase as far as you can.",
      "links": "<a href='/AIV/6/10/32-33'>Josh. 10:32-33</a>",
      "comment": "Judith calls for a complete rout of the enemy, encouraging cooperation among all Israel. This unity in action prefigures the need for a united leadership and community among God's people."
    },
    {
      "pk": 18014005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 5,
      "text": "But before you do any of this, summon Achior the Ammonite to me, so that he may see and recognize the one who despised the house of Israel and sent him to us as if we were to be destroyed.",
      "links": "<a href='/AIV/18/6/5'>Jdt. 6:5</a>; <a href='/AIV/2/18/11-12'>Ex. 18:11-12</a>",
      "comment": "Judith honors Achior, a Gentile ally, and provides him proof of God's victory. The inclusion of outsiders signals the universal scope of God's plan, later fulfilled supremely in Christ (Matt. 8:11)."
    },
    {
      "pk": 18014006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 6,
      "text": "So they called Achior from the house of Uzziah. When he arrived and saw the head of Holofernes in the hand of one of the people assembled there, he fell down on his face and fainted.",
      "links": "<a href='/AIV/18/6/10-14'>Jdt. 6:10-14</a>",
      "comment": "Achior's response—falling as though dead—reflects the awe before God's mighty works. Similar reactions to revelations occur throughout Scripture (Ezek. 1:28; Rev. 1:17)."
    },
    {
      "pk": 18014007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 7,
      "text": "But when they had raised him up, he bowed at Judith’s feet and paid her great honor. He said, \"Blessed are you in every tent of Judah! In every nation those who hear your name will be amazed.",
      "links": "<a href='/AIV/1/30/12-13'>Gen. 30:12-13</a>; <a href='/AIV/4/5/24'>Judg. 5:24</a>",
      "comment": "Achior’s blessing connects Judith to the line of honored women in Israel and points forward to the perpetual honor given to the mother of the Messiah (Luke 1:48)."
    },
    {
      "pk": 18014008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 8,
      "text": "But now tell me everything you have done in these days.\"",
      "links": "<a href='/AIV/6/2/22'>Josh. 2:22-24</a>; <a href='/AIV/19/5/4'>Esth. 5:4-8</a>; <a href='/AIV/49/24/18'>Luke. 24:18-19</a>",
      "comment": "Achior seeks a full account of Judith’s actions, displaying both reverence and a desire to understand the Lord’s intervention, encouraging the sharing of testimonies among God’s people."
    },
    {
      "pk": 18014009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 9,
      "text": "So in the presence of all the people, Judith told him everything she had done, from the day she went out until the hour she was speaking to them.",
      "links": "<a href='/AIV/19/66/16'>Ps. 66:16</a>",
      "comment": "Judith’s public testimony demonstrates the importance of transparent witness in the community, paralleling the apostolic testimony in the New Testament (Acts 4:20)."
    },
    {
      "pk": 18014010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 10,
      "text": "When she finished speaking, the people raised a great shout and made a joyful noise in their city.",
      "links": "<a href='/AIV/6/6/20'>Josh. 6:20</a>; <a href='/AIV/19/47/1'>Ps. 47:1</a>",
      "comment": "The people’s joyful response is reminiscent of Israel's collective celebrations after God's victories. Shared worship is seen as the right response to God's acts."
    },
    {
      "pk": 18014011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 11,
      "text": "But when the leaders of the Assyrian army heard the noise, they went to Holofernes’ tent.",
      "links": "<a href='/AIV/19/6/14'>Esth. 6:14</a>; <a href='/AIV/7/4/22'>Judg. 4:22</a>; <a href='/AIV/47/28/2'>Matt. 28:2-4</a>",
      "comment": "The Assyrians, disturbed by the celebration within the city, go to their leader. The noisy celebration juxtaposes Israel’s confidence against the confusion of the enemies."
    },
    {
      "pk": 18014012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 12,
      "text": "And they said to him, \"Awake, our lord, for the slaves have dared to come down to fight us, to their utter destruction.\"",
      "links": "<a href='/AIV/2/15/9'>Exod. 15:9</a>; <a href='/AIV/23/2/1'>Ps. 2:1-4</a>; <a href='/AIV/29/37/23'>Isa. 37:23-24</a>",
      "comment": "The soldiers’ pride is evident in calling the Israelites \"slaves,\" foreshadowing their ignorance of God’s true strength, as so often in the Bible (cf. 1 Sam. 17:42–47)."
    },
    {
      "pk": 18014013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 13,
      "text": "So Bagoas went in and knocked at the curtain of the tent, thinking that Holofernes was sleeping with Judith.",
      "links": "<a href='/AIV/18/13/13'>Jdt. 13:13</a>",
      "comment": "The actions of Bagoas underscore Judith’s reputation for beauty and virtue, which God used as an instrument for Israel’s salvation."
    },
    {
      "pk": 18014014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 14,
      "text": "But when he did not hear a sound, he opened the curtain, entered, and found him lying headless on the ground, sprawled on his face.",
      "links": "<a href='/AIV/7/4/21'>Judg. 4:21</a>; <a href='/AIV/9/17/51'>1Sam. 17:51</a>; <a href='/AIV/12/9/35'>2Kgs. 9:35</a>",
      "comment": "The shocking discovery fulfills Judith’s prophecy and foreshadows other moments when presumed power collapses suddenly (Dan. 5:30–31; Acts 12:21–23)."
    },
    {
      "pk": 18014015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 15,
      "text": "Bagoas shouted with a loud cry, wept, groaned, and called out to the women’s tent, \"One slave has brought disgrace upon the whole house of King Nebuchadnezzar. Look, Holofernes lies on the ground without a head!\"",
      "links": "<a href='/AIV/7/4/22'>Judg. 4:22</a>; <a href='/AIV/19/7/8'>Esth. 7:8</a>; <a href='/AIV/23/9/16'>Ps. 9:16</a>",
      "comment": "The lament and accusation reveals both the depth of the enemy’s humiliation and the overturning of worldly pride through God’s chosen instruments."
    },
    {
      "pk": 18014016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 16,
      "text": "When the leaders of the Assyrian army heard this, they tore their tunics, deeply shaken and infilled with panic and distress.",
      "links": "<a href='/AIV/1/37/34'>Gen. 37:34</a>; <a href='/AIV/6/7/6'>Josh. 7:6</a>",
      "comment": "Tearing one’s garments is a biblical sign of mourning and shock, seen throughout both Old and New Testaments (Matt. 26:65)."
    },
    {
      "pk": 18014017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 17,
      "text": "An outcry rose in the midst of their camp. In their tents, the army was thrown into great confusion.",
      "links": "<a href='/AIV/7/7/21-23'>Judg. 7:21-23</a>",
      "comment": "As in other Old Testament deliverances, confusion among the enemy is a sign of God’s direct intervention (Ex. 14:24–25; 2 Chron. 20:22–23)."
    },
    {
      "pk": 18014018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 18,
      "text": "But when all in the camp heard the news, they were filled with terror and dread, and no man remained with his neighbor. Panic-stricken, they all ran off together into the open country.",
      "links": "<a href='/AIV/1/35/5'>Gen. 35:5</a>; <a href='/AIV/22/14/1'>Prov. 14:1</a>",
      "comment": "God’s power causes formidable armies to disperse in panic. This demonstrates His sovereignty and the futility of human strength apart from Him—a recurring biblical theme."
    },
    {
      "pk": 18014019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 19,
      "text": "The Israelites pursued them down the mountain until they reached the borders of their own country.",
      "links": "<a href='/AIV/6/10/32-42'>Josh. 10:32-42</a>",
      "comment": "Israel’s complete victory, pursued persistently, is reminiscent of the thorough victories blessed by God under Moses and Joshua. This persistent and divinely mandated pursuit foreshadows the Church’s mission to proclaim victory over sin and death through steadfast faith."
    }
  ],
  "translatedAt": "2025-12-25T16:09:34.886Z"
}