{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 6,
  "sections": [
    {
      "title": "Holofernes' Anger at Achior",
      "startVerse": 1,
      "endVerse": 21
    }
  ],
  "verses": [
    {
      "pk": 18006001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 1,
      "text": "When the clamor of the men around the council had quieted, Holofernes, the commander of the Assyrian army, spoke to Achior before all the foreign chiefs and to all the sons of Moab.",
      "links": "<a href='/AIV/15/1/7'>Ezra 1:7</a>; <a href='/AIV/23/10/5'>Isa. 10:5</a>",
      "comment": "The narrative shifts to the direct confrontation between Holofernes and Achior, highlighting themes of trust in God's providence.",
      "sectionHeader": "Holofernes' Anger at Achior"
    },
    {
      "pk": 18006002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 2,
      "text": "He said to Achior the people of Ammon, \"Because you have prophesied to us, saying the Israelites are protected by their God to inflict harm on us, I will show you that there is no God but Nebuchadnezzar, and when we attack them, they will not stand against my power.\"",
      "links": "<a href='/AIV/27/3/15-18'>Dan 3:15-18</a>; <a href='/AIV/9/17/45-47'>1 Sam 17:45-47</a>",
      "comment": "Holofernes denies the existence of Israel's God, echoing pagan arrogance. This sets up a comparison with biblical figures like Goliath, who challenged the God of Israel."
    },
    {
      "pk": 18006003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 3,
      "text": "\"We, the servants of Nebuchadnezzar, will destroy them as one man. They will not withstand the force of our cavalry.\"",
      "links": "<a href='/AIV/10/2/11'>Judg 2:11</a>; <a href='/AIV/19/20/7-8'>Ps 20:7-8</a>",
      "comment": "The faith of God's people is about to be tested by overwhelming worldly power, often depicted in the Psalms and prophetic writings as a call to trust in God's deliverance."
    },
    {
      "pk": 18006004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 4,
      "text": "\"I will pass through them like a burning torch, and their mountains will be drunk with their blood, and their plains will be filled with their slain.\"",
      "links": "<a href='/AIV/23/10/16'>Isa 10:16</a>; <a href='/AIV/19/79/6-7'>Ps 79:6-7</a>",
      "comment": "Holofernes' violent imagery evokes ancient Near Eastern war rhetoric, emphasizing total conquest; the blood-drenched mountains and plains allude to utter devastation, paralleling prophetic oracles such as Isaiah 34:2-3 and Joel 3:13, highlighting God's sovereignty over historical events."
    },
    {
      "pk": 18006005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 5,
      "text": "\"For not even their mountains or hills or their foundations will bear their bodies when they fall before us.\"",
      "links": "<a href='/AIV/24/4/24-26'>Jer 4:24-26</a>",
      "comment": "This is language of total destruction, echoing prophetic proclamations—but the passage prepares for God’s intervention."
    },
    {
      "pk": 18006006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 6,
      "text": "\"They will fall by the sword of my men and be carried off as prisoners to all the provinces of my kingdom.\"",
      "links": "<a href='/AIV/23/37/36'>Isa 37:36</a>; <a href='/AIV/19/44/11-12'>Ps 44:11-12</a>",
      "comment": "The fate threatened is exile, a recurring punishment in Israel's history, notably in Assyrian and Babylonian periods."
    },
    {
      "pk": 18006007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 7,
      "text": "\"You, Achior, will share their fate, and you will fall along with them when they are overthrown.\"",
      "links": "<a href='/AIV/1/12/3'>Gen 12:3</a>; <a href='/AIV/16/4/3'>Neh 4:3</a>",
      "comment": "The curse on Achior for aligning with Israel ironically sets the stage for God's vindication of the faithful."
    },
    {
      "pk": 18006008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 8,
      "text": "\"You will not see my face again from this day, until I have taken vengeance on this people coming from Egypt.\"",
      "links": "<a href='/AIV/2/10/28'>Exod 10:28</a>",
      "comment": "Holofernes' vow of vengeance draws on the motif of divine retribution against rebellious peoples, with 'coming from Egypt' reflecting Israel’s Exodus heritage and casting them as perennial outsiders; it foreshadows God's deliverance when the situation appears most dire, as seen in Exodus narratives."
    },
    {
      "pk": 18006009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 9,
      "text": "Then Holofernes ordered his servants, who stood in his tent, to seize Achior and take him to Bethulia, to deliver him into the hands of the Israelites.",
      "links": "<a href='/AIV/18/7/6'>Jdt 7:6</a>",
      "comment": "God uses even the plans of enemies to position the righteous for deliverance—Achior is placed among those he defended."
    },
    {
      "pk": 18006010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 10,
      "text": "The servants took him and led him out of the camp into the plain, and from there into the hill country, arriving by the springs below Bethulia.",
      "links": "<a href='/AIV/18/7/17'>Jdt 7:17</a>; <a href='/AIV/7/15/18-19'>Jos 15:18-19</a>",
      "comment": "The springs of Bethulia foreshadow the coming siege and the importance of water, a biblical symbol of life and blessing."
    },
    {
      "pk": 18006011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 11,
      "text": "When the men of Israel in Bethulia saw them, they took up their weapons and ran out of the city to the top of the hill. But from a distance, they stopped the captors, slinging stones and keeping them from coming up.",
      "links": "<a href='/AIV/9/17/49'>1 Sam 17:49</a>; <a href='/AIV/7/16/3'>Jos 16:3</a>",
      "comment": "The defensive response echoes David's victory by sling; trusting in God’s providential protection."
    },
    {
      "pk": 18006012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 12,
      "text": "But they called out from the mountain to their captors, questioning, ‘Who are you? What business do you have with us? Who sent you here?’",
      "links": "<a href='/AIV/9/20/18'>1 Sam 20:18</a>",
      "comment": "Israel’s vigilance is consistently lauded throughout Scripture, highlighting discernment and readiness."
    },
    {
      "pk": 18006013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 13,
      "text": "The men tied Achior and left him at the foot of the hill, returning to their lord.",
      "links": "<a href='/AIV/18/8/1'>Jdt 8:1</a>",
      "comment": "The action fulfills Holofernes’ threat, but Achior’s fate will bear witness to the power and mercy of God."
    },
    {
      "pk": 18006014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 14,
      "text": "The Israelites came down from their city, approached Achior, untied him, and brought him into Bethulia.",
      "links": "<a href='/AIV/15/2/7'>Ezra 2:7</a>",
      "comment": "The hospitality and care shown to Achior prefigure the call to welcome the stranger, echoing themes found throughout salvation history."
    },
    {
      "pk": 18006015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 15,
      "text": "They set him before the rulers of their city, who were in those days Uzziah the son of Micah, of the tribe of Simeon, Chabris the son of Gothoniel, and Charmis the son of Melchiel.",
      "links": "<a href='/AIV/4/4/24'>Num 4:24</a>",
      "comment": "The formal introduction to the city's elders underscores the importance of ordered leadership and communal discernment—an emphasis visible in the structure of the early Church."
    },
    {
      "pk": 18006016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 16,
      "text": "They gathered all the elders, and Achior was brought before all the people and questioned about what had happened.",
      "links": "<a href='/AIV/6/27/1'>Acts 27:1</a>",
      "comment": "Achior’s testimony before the assembly mirrors the apostolic tradition of giving witness before the whole community."
    },
    {
      "pk": 18006017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 17,
      "text": "He explained to them all Holofernes had said in his council and his arrogant threats against the house of Israel.",
      "links": "<a href='/AIV/18/5/5-21'>Jdt 5:5-21</a>",
      "comment": "Achior recounts Holofernes' words, showing the challenge to God’s sovereignty, a recurring biblical test where God intervenes for His people."
    },
    {
      "pk": 18006018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 18,
      "text": "Then the people fell down and worshiped God, and cried out, 'O Lord, God of heaven, see their arrogance, and have mercy on our people, and look with favor on those who are sanctified to You.'",
      "links": "<a href='/AIV/19/123/3-4'>Ps 123:3-4</a>; <a href='/AIV/2/32/11-13'>Exod 32:11-13</a>",
      "comment": "This act of communal prayer demonstrates the importance of faith—in both early Israel and the Church—turning to God in distress with repentance and hope."
    },
    {
      "pk": 18006019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 19,
      "text": "They consoled Achior, commending him highly, and Uzziah brought him from the assembly into his own house and held a gathering for the elders. That night, they called on the God of Israel for help.",
      "links": "<a href='/AIV/19/34/18'>Ps 34:18</a>",
      "comment": "The caring treatment of Achior hints at the embrace of converts and the role of prayer among the leaders before important actions in salvation history."
    },
    {
      "pk": 18006020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 20,
      "text": "Then all the people, with one accord, continued to pray earnestly throughout the night in Bethulia.",
      "links": "<a href='/AIV/44/1/14'>Acts 1:14</a>; <a href='/AIV/19/134/1'>Ps 134:1</a>",
      "comment": "The unity and perseverance in prayer of God's people is highlighted: a model for Christian communities, especially in preparing for decisive spiritual battles."
    },
    {
      "pk": 18006021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 21,
      "text": "And they waited for morning to see what the Lord would do for them.",
      "links": "<a href='/AIV/2/14/13-14'>Exod 14:13-14</a>; <a href='/AIV/19/46/10'>Ps 46:10</a>",
      "comment": "The waiting for God’s deliverance recalls the Exodus and testifies to a living hope rooted in God’s steadfast faithfulness."
    }
  ],
  "translatedAt": "2025-12-28T02:19:15.406Z"
}