{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 15,
  "verses": [
    {
      "pk": 18015001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 1,
      "text": "When the men in the tents heard it, they were astonished at what had happened.",
      "links": "<a href='/AIV/2/14/24'>Exod. 14:24-25</a>; <a href='/AIV/6/2/9'>Josh. 2:9-11</a>; <a href='/AIV/9/14/15'>1Sam. 14:15</a>",
      "comment": "The Assyrian army's astonishment highlights the sudden reversal of fortune brought by God's intervention through Judith, echoing similar moments of divine deliverance in Israel's history (cf. Exodus 14:24-25).",
      "sectionHeader": "The Rout of the Assyrians"
    },
    {
      "pk": 18015002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 2,
      "text": "The Assyrians fleeing in terror ran down the mountain paths; those who remained in the camp were overtaken and slaughtered by the men of Israel.",
      "links": "<a href='/AIV/02/14/27'>Exod. 14:27</a>; <a href='/AIV/06/8/24'>Josh. 8:24</a>",
      "comment": "The chaotic flight and slaughter of the Assyrians reflect the panic often attributed to God's direct action in biblical battles (cf. Judges 7:21-22); Israel's courage is spurred by divine providence."
    },
    {
      "pk": 18015003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 3,
      "text": "Those who had camped in the hills around Bethulia also fled. Then all the Israelite soldiers rushed out upon them.",
      "links": "<a href='/AIV/6/8/19'>Josh. 8:19-21</a>; <a href='/AIV/7/7/21'>Judg. 7:21-23</a>; <a href='/AIV/9/14/22'>1Sam. 14:22</a>",
      "comment": "Those in ambush around Bethulia flee as word spreads of Holofernes' death, demonstrating how the defeat of a leader can demoralize a powerful force and enable a comprehensive victory (cf. 1 Samuel 17:51-52)."
    },
    {
      "pk": 18015004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 4,
      "text": "Uzziah sent men to Betomasthaim and Choba and Kola, and to all the frontiers of Israel, to tell what had taken place and to urge everyone to rush out upon the enemy to destroy them.",
      "links": "<a href='/AIV/7/7/23'>Judg. 7:23</a>; <a href='/AIV/9/11/7'>1Sam. 11:7-8</a>; <a href='/AIV/14/13/17'>2Chr. 13:17</a>",
      "comment": "Uzziah’s call for reinforcements signifies the unity and mobilization of Israel in response to God's deliverance; this widespread rally mirrors similar calls to arms in Israel’s history (cf. Judges 6:34-35)."
    },
    {
      "pk": 18015005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 5,
      "text": "When the Israelites heard it, they attacked the enemy with one accord and pursued them as far as Choba. Those in Jerusalem and all the hill country also joined in, for word had reached them of what had happened in the camp. The men of Gilead and Galilee encircled the enemy, striking them down as far as Damascus and its borders.",
      "links": "<a href='/AIV/6/10/29'>Josh. 10:29-40</a>; <a href='/AIV/9/11/11'>1Sam. 11:11</a>; <a href='/AIV/7/7/23'>Judg. 7:23-25</a>",
      "comment": "The national response underscores the collective identity of Israel in times of crisis, expanding the victory from Bethulia to involve Jerusalem, Gilead, and Galilee, symbolizing the restoration of communal hope and strength.",
      "sectionHeader": "Judith Honored and Israel Rejoices"
    },
    {
      "pk": 18015006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 6,
      "text": "The rest of the people of Bethulia fell upon the Assyrian camp and plundered it, acquiring great riches.",
      "links": "<a href='/AIV/2/12/35'>Exod. 12:35-36</a>; <a href='/AIV/12/7/16'>2Kgs. 7:16</a>; <a href='/AIV/9/30/16'>1Sam. 30:16-20</a>",
      "comment": "The plundering of the enemy camp conveys both material reward and divine justice, reminiscent of Israelite victories like the spoils at the Red Sea (Exodus 15:9)."
    },
    {
      "pk": 18015007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 7,
      "text": "And the Israelites, when they returned from the slaughter, took possession of what remained. Even the villages and towns in the hill country and in the plain obtained a great amount of plunder, for there was a vast quantity.",
      "links": "<a href='/AIV/4/31/27'>Num. 31:27</a>; <a href='/AIV/14/20/25'>2Chr. 20:25</a>",
      "comment": "Distribution of plunder among Israelites from various regions builds solidarity and affirms that God's salvation brings blessing to the whole nation (cf. Joshua 22:8)."
    },
    {
      "pk": 18015008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 8,
      "text": "All the men of Israel, and the inhabitants of Jerusalem who had come to witness God’s great deeds, honored Judith greatly.",
      "links": "<a href='/AIV/19/145/10'>Ps. 145:10</a>; <a href='/AIV/58/11/2'>Heb. 11:2</a>",
      "comment": "Judith is honored among all of Israel and specifically by Jerusalem—significant because Jerusalem is the spiritual heart of God's people. This also points to how exemplary faithfulness is worthy of remembrance and reverence in the tradition of honoring saints for their fidelity to God."
    },
    {
      "pk": 18015009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 9,
      "text": "When they met her, they all blessed her with one accord and said to her, \"You are the glory of Jerusalem, you are the great boast of Israel, you are the great pride of our nation!\"",
      "links": "<a href='/AIV/24/31/28'>Prov. 31:28-31</a>",
      "comment": "Judith is lauded as the glory and pride of Israel, a rare honor for a woman, anticipating later praise for heroines such as Mary (cf. Luke 1:48) and emphasizing the theme of God elevating the humble."
    },
    {
      "pk": 18015010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 10,
      "text": "You have done all this with your own hand; you have done great good to Israel, and God is well pleased with it. May the Almighty Lord bless you forever! And all the people said, \"Amen.\"",
      "links": "<a href='/AIV/1/14/19'>Gen. 14:19</a>; <a href='/AIV/9/25/32'>1Sam. 25:32</a>; <a href='/AIV/28/44/1'>Sir. 44:1</a>",
      "comment": "The people recognize both Judith's agency and God's pleasure in her deed, highlighting the cooperation between human faithfulness and divine will; their blessing invokes God's perpetual favor."
    },
    {
      "pk": 18015011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 11,
      "text": "All the people plundered the camp for thirty days. They gave Judith the tent of Holofernes and all his silver dishes, his beds, his bowls, and all his furnishings. She loaded them on her mules, and hitched up her carts to carry them.",
      "links": "<a href='/AIV/2/12/35'>Exod. 12:35-36</a>; <a href='/AIV/7/8/24'>Judg. 8:24-27</a>; <a href='/AIV/9/30/20'>1Sam. 30:20</a>",
      "comment": "Judith is honored with Holofernes' tent and treasures, signifying tangible recognition of her role as deliverer, and paralleling similar acts of rewarding Israel’s champions (cf. 1 Samuel 17:25)."
    },
    {
      "pk": 18015012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 12,
      "text": "All the women of Israel gathered to see her and blessed her, and some of them performed a dance in her honor. Judith took ivy-wreathed wands in her hands and distributed them to the women who were with her.",
      "links": "<a href='/AIV/2/15/20'>Exod. 15:20</a>; <a href='/AIV/9/18/6'>1Sam. 18:6-7</a>; <a href='/AIV/23/150/4'>Ps. 150:4</a>",
      "comment": "Women publicly honor Judith with dance and ritual using ivy—symbolizing victory and joy—reflecting ancient customs of celebrating triumph (cf. Exodus 15:20-21; 1 Samuel 18:6-7).",
      "sectionHeader": "Judith’s Legacy and Israel at Peace"
    },
    {
      "pk": 18015013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 13,
      "text": "She and those with her crowned themselves with olive branches. Judith led the dance before all the people, with the women following her, while all the men of Israel followed bearing arms and wearing garlands, singing hymns.",
      "links": "<a href='/AIV/2/15/20'>Exod. 15:20</a>; <a href='/AIV/10/6/14'>2Sam. 6:14</a>; <a href='/AIV/23/149/3'>Ps. 149:3</a>",
      "comment": "Olive crowns and dancing procession embody themes of peace, consecration, and communal thanksgiving, uniting warriors and women in celebration, evoking Psalm 149:3."
    },
    {
      "pk": 18015014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 15,
      "verse": 14,
      "text": "Judith began this thanksgiving before all Israel, and all the people joined in with a loud song of praise.",
      "links": "<a href='/AIV/2/15/1'>Exod. 15:1-21</a>; <a href='/AIV/7/5/1'>Judg. 5:1-3</a>",
      "comment": "Judith leads public thanksgiving, drawing the community into liturgical praise and affirming that victory belongs to God alone (cf. Psalm 118:14-15; Exodus 15:1)."
    }
  ],
  "translatedAt": "2025-12-28T06:58:16.044Z",
  "sections": [
    {
      "title": "The Rout of the Assyrians",
      "startVerse": 1,
      "endVerse": 4
    },
    {
      "title": "Judith Honored and Israel Rejoices",
      "startVerse": 5,
      "endVerse": 11
    },
    {
      "title": "Judith’s Legacy and Israel at Peace",
      "startVerse": 12,
      "endVerse": 14
    }
  ]
}