{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 12,
  "sections": [
    {
      "title": "Judith’s Preparation in Holofernes’ Camp",
      "startVerse": 1,
      "endVerse": 20
    }
  ],
  "verses": [
    {
      "pk": 18012001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 1,
      "text": "Then he commanded her to be led into the place where his silverware was set, and ordered her food from his table to be brought to her.",
      "links": "<a href='/AIV/18/10/18'>Jdt 10:18</a>; <a href='/AIV/18/13/1'>Jdt 13:1</a>",
      "comment": "The commander, Holofernes, offers Judith hospitality, which sets the stage for her plan. Hospitality to strangers echoes Abraham in Genesis 18:1-8.",
      "sectionHeader": "Judith’s Preparation in Holofernes’ Camp"
    },
    {
      "pk": 18012002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 2,
      "text": "But Judith said, 'I will not eat of it, lest there be an offense; instead, I will be provided from what I have brought with me.'",
      "links": "<a href='/AIV/18/10/5'>Jdt 10:5</a>; <a href='/AIV/27/1/8'>Dan. 1:8</a>",
      "comment": "Judith’s refusal to eat unclean food mirrors Daniel in Babylon (Daniel 1:8). This displays faithfulness to sacred laws regarding purity and food."
    },
    {
      "pk": 18012003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 3,
      "text": "Holofernes asked her, 'But if your provisions run out, where will we get more like them for you?'",
      "links": "<a href='/AIV/18/13/2'>Jdt 13:2</a>",
      "comment": "Holofernes shows continued concern for Judith’s needs, reflecting the royal practice of giving favor to honored guests (Esther 2:9)."
    },
    {
      "pk": 18012004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 4,
      "text": "Judith answered, 'As surely as you live, my lord, what your servant has will be enough until the LORD accomplishes by my hand what he has determined.'",
      "links": "<a href='/AIV/18/8/33'>Jdt 8:33</a>; <a href='/AIV/07/4/9'>Judg. 4:9</a>",
      "comment": "Judith hints at her divine mission. Her language recalls stories like Deborah in Judges 4:9, showing God using women as instruments for His purpose."
    },
    {
      "pk": 18012005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 5,
      "text": "Then the attendants of Holofernes led her to the tent, and she slept until midnight. Just before the morning watch she got up.",
      "links": "<a href='/AIV/02/14/24'>Ex. 14:24</a>; <a href='/AIV/18/13/1'>Jdt 13:1</a>",
      "comment": "Judith’s movement during the watches of night points to God's deliverance happening at such times (Exodus 14:24)."
    },
    {
      "pk": 18012006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 6,
      "text": "She sent word to Holofernes, saying, 'Let my lord now give orders to allow your servant to go out for prayer.'",
      "links": "<a href='/AIV/18/8/6'>Jdt 8:6</a>; <a href='/AIV/41/1/35'>Mark 1:35</a>",
      "comment": "Judith prioritizes prayer, like Jesus rising early to pray (Mark 1:35). She models reliance on God before decisive action."
    },
    {
      "pk": 18012007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 7,
      "text": "So Holofernes commanded his guards not to hinder her. She remained in the camp three days, going out at night to the valley of Bethulia to wash herself, and she prayed to the LORD, the God of Israel.",
      "links": "<a href='/AIV/18/8/6'>Jdt 8:6</a>; <a href='/AIV/03/14/8'>Lev. 14:8</a>",
      "comment": "Judith’s ritual washing and prayer show deep reverence for purity—echoes of rites in Leviticus. Three days is a biblically significant period (cf. Hosea 6:2; Luke 24:46)."
    },
    {
      "pk": 18012008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 8,
      "text": "After cleansing herself, she returned and remained pure in the tent until she ate her food in the evening.",
      "links": "<a href='/AIV/03/11/46-47'>Lev. 11:46-47</a>; <a href='/AIV/18/10/5'>Jdt 10:5</a>",
      "comment": "Judith maintains holiness and purity—image of faithful obedience. This level of personal discipline foreshadows New Testament calls to be 'set apart' (Romans 12:1)."
    },
    {
      "pk": 18012009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 9,
      "text": "Then she returned purified and stayed in the tent until she ate her food toward evening.",
      "links": "<a href='/AIV/3/11/44'>Lev. 11:44</a>; <a href='/AIV/34/1/8'>Dan. 1:8</a>; <a href='/AIV/18/8/6'>Jdt. 8:6</a>",
      "comment": "Judith's purification ritual reflects Jewish laws of ceremonial cleanness (cf. Lev. 15), highlighting her piety and separation from pagan influences before her impending act."
    },
    {
      "pk": 18012010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 10,
      "text": "On the fourth day Holofernes held a banquet for his personal attendants only, and did not invite any of his officers.",
      "links": "<a href='/AIV/19/1/10'>Esth. 1:10-12</a>; <a href='/AIV/34/5/1'>Dan. 5:1-2</a>",
      "comment": "Holofernes' exclusive banquet suggests increasing intimacy and vulnerability, setting the stage for Judith's decisive encounter and highlighting his isolation from his own commanders."
    },
    {
      "pk": 18012011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 11,
      "text": "He said to Bagoas, the eunuch who had charge of his personal affairs, 'Go and persuade the Hebrew woman who is in your care to join us and to eat and drink with us.'",
      "links": "<a href='/AIV/1/39/7'>Gen. 39:7</a>; <a href='/AIV/19/2/8'>Esth. 2:8-9</a>; <a href='/AIV/34/1/9'>Dan. 1:9</a>",
      "comment": "Bagoas, a court eunuch, often functions as an intermediary in ancient Near Eastern courts (cf. Esther 2:3), here facilitating Judith’s presence and emphasizing the role of palace officials in royal schemes."
    },
    {
      "pk": 18012012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 12,
      "text": "For it would be a disgrace if we let such a woman go without having intercourse with her. If we do not seduce her, she will laugh at us.",
      "links": "<a href='/AIV/1/39/12'>Gen. 39:12</a>; <a href='/AIV/10/13/11'>2Sam. 13:11-14</a>; <a href='/AIV/66/1/14'>Jas. 1:14-15</a>",
      "comment": "The emphasis on seduction exposes the predatory intentions of Holofernes and contrasts sharply with Judith's virtue, presenting a conflict between pagan lust and Hebrew faithfulness."
    },
    {
      "pk": 18012013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 13,
      "text": "So Bagoas left the presence of Holofernes, and approached her and said, 'Let this pretty girl not hesitate to come to my lord to be honored in his presence, and to enjoy drinking wine with us, and to become today like one of the Assyrian women who serve in the palace of Nebuchadnezzar.'",
      "links": "<a href='/AIV/19/2/16'>Esth. 2:16-17</a>; <a href='/AIV/34/1/5'>Dan. 1:5</a>",
      "comment": "Bagoas delivers an invitation laced with flattery and assimilation, urging Judith to accept foreign customs and further testing her resolve to maintain her Jewish identity."
    },
    {
      "pk": 18012014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 14,
      "text": "Judith replied, 'Who am I to refuse my lord? Whatever pleases him I will do at once, and it will be a joy to me until the day of my death.'",
      "links": "<a href='/AIV/34/3/16'>Dan. 3:16-18</a>; <a href='/AIV/19/4/16'>Esth. 4:16</a>",
      "comment": "Judith responds with diplomatic submission, concealing her true motives behind words that echo the humility and wisdom seen in Esther (Esther 5:4), setting up her strategic action."
    },
    {
      "pk": 18012015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 15,
      "text": "So she proceeded to dress herself in all her woman’s finery. Her maid went ahead and spread for her on the ground before Holofernes the lambskins she had received from Bagoas for her daily use in reclining.",
      "links": "<a href='/AIV/19/5/1'>Esth. 5:1</a>; <a href='/AIV/18/10/3'>Jdt. 10:3-4</a>",
      "comment": "Judith adorns herself with finery, echoing biblical motifs of beauty wielded for a greater cause (cf. Esther 5:1), while the lambskins suggest both luxury and perhaps a subtle metaphor for sacrifice."
    },
    {
      "pk": 18012016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 16,
      "text": "Then Judith came in and lay down. Holofernes’ heart was ravished with her and his passion was aroused, for he had been waiting for an opportunity to seduce her from the day he first saw her.",
      "links": "<a href='/AIV/7/16/4'>Judg. 16:4-6</a>; <a href='/AIV/34/13/31'>Dan. 13:31</a>",
      "comment": "Holofernes' overwhelming desire fulfills Judith’s plan, demonstrating how pride and passion make powerful men vulnerable, reinforcing the biblical theme of God using the weak to shame the strong (cf. 1 Cor. 1:27)."
    },
    {
      "pk": 18012017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 17,
      "text": "So Holofernes said to her, 'Have a drink and be merry with us!'",
      "links": "<a href='/AIV/24/23/31'>Prov. 23:31</a>; <a href='/AIV/34/5/4'>Dan. 5:4</a>; <a href='/AIV/19/1/8'>Esth. 1:8</a>",
      "comment": "Holofernes’ invitation to drink and make merry situates Judith in a position of deeper trust and possible danger, marking a pivotal moment before her act of deliverance, as seen in other stories of banquet intrigue (cf. Esther 7:2)."
    },
    {
      "pk": 18012018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 18,
      "text": "Judith said, “I will gladly drink, my lord, because today is the greatest day in my whole life.”",
      "links": "<a href='/AIV/18/13/4'>Jdt 13:4</a>",
      "comment": "The scene is now set for Judith’s action, with all witnesses gone. Darkness and secrecy recall moments of divine intervention throughout Scripture."
    },
    {
      "pk": 18012019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 19,
      "text": "Then she took what her maid had prepared and ate and drank before him.",
      "links": "<a href='/AIV/20/23/33-34'>Prov. 23:33–34</a>",
      "comment": "Drunkenness brings vulnerability, a repeated biblical theme. Moments of human weakness are often occasions for God’s power to be revealed."
    },
    {
      "pk": 18012020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 20,
      "text": "Holofernes was greatly pleased with her, and drank a great quantity of wine, much more than he had ever drunk in any one day since he was born.",
      "links": "<a href='/AIV/18/13/2-4'>Jdt 13:2–4</a>; <a href='/AIV/07/4/21'>Judg. 4:21</a>",
      "comment": "This verse leads directly into the climactic act of Judith’s mission. The pattern echoes Jael and Sisera (Judges 4:21). Judith as a typological figure points to the honor and spiritual authority God bestows even on the humble and those considered 'outsiders' by the world."
    }
  ],
  "translatedAt": "2026-01-01T04:59:23.654Z"
}