{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 1,
  "verses": [
    {
      "pk": 18001001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 1,
      "text": "In the twelfth year of the reign of Nebuchadnezzar, who ruled the Assyrians in Nineveh the great city—in those days Arphaxad also reigned over the Medes in Ecbatana—",
      "links": "<a href='/AIV/27/1/1-2'>Dan. 1:1-2</a>",
      "comment": "The historical context sets up the narrative during the time of Nebuchadnezzar. Nineveh, once destroyed (Nah. 1:1), is featured here symbolically to contrast earthly power with God's ultimate plan.",
      "sectionHeader": "Arphaxad Fortifies Ecbatana"
    },
    {
      "pk": 18001002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 2,
      "text": "He built massive walls around Ecbatana with hewn stones, each stone three cubits wide and six cubits long. He made the walls seventy cubits high and fifty cubits wide.",
      "links": "<a href='/AIV/16/3/8'>Neh. 3:8</a>",
      "comment": "Arphaxad’s building projects show the emphasis on earthly strength. This contrasts with biblical themes that true security is in God, not in fortifications (Ps. 127:1)."
    },
    {
      "pk": 18001003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 3,
      "text": "He set the towers on its gates one hundred cubits high, and their width was sixty cubits, at the gates he set them up proud of their strength.",
      "links": "<a href='/AIV/11/10/20'>1 Kings 10:20</a>",
      "comment": "This demonstrates earthly pride and the reliance on human achievement. Throughout Scripture, such pride is contrasted with reliance on God (Prov. 16:18)."
    },
    {
      "pk": 18001004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 4,
      "text": "He made its gates strong, with a height of seventy cubits, and their width forty cubits, wide enough for his massive armies, and his foot soldiers to march in military array.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "The gates' grandeur reflects military might, but ultimately in the biblical worldview, victory belongs to the Lord (1 Sam. 17:47)."
    },
    {
      "pk": 18001005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 5,
      "text": "Then Nebuchadnezzar king of Assyria made war on King Arphaxad in the great plain, which is on the border of Ragau.",
      "links": "<a href='/AIV/12/18/34'>2 Kings 18:34</a>",
      "comment": "This introduces the conflict between kingdom powers. In a spiritual sense, earthly wars foreshadow the larger battle between righteousness and evil (Eph. 6:12).",
      "sectionHeader": "Nebuchadnezzar Invades the West"
    },
    {
      "pk": 18001006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 6,
      "text": "Many nations joined him: all who lived in the hill country, and all those who lived along the Euphrates, Tigres, and Hydaspes, and in the plain of Arioch the king of the Elymaeans; many nations assembled for the battle.",
      "links": "<a href='/AIV/01/14/1-2'>Gen. 14:1-2</a>",
      "comment": "The unity of nations against a common enemy reflects themes of coalition seen throughout Scripture, often unified in opposition to God's will (Gen. 11:1-9)."
    },
    {
      "pk": 18001007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 7,
      "text": "But Nebuchadnezzar king of Assyria sent word to all the people of Persia, and to those who lived to the west, and to those who lived in Cilicia and Damascus, Lebanon and Anti-Lebanon, and to all those along the sea coast,",
      "links": "<a href='/AIV/23/10/8-14'>Isa. 10:8-14</a>",
      "comment": "Nebuchadnezzar’s summons signals a call to alliance, attempting universal power. This models how empires broker alliances but, ultimately, all authority is subject to God (Dan. 2:21)."
    },
    {
      "pk": 18001008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 8,
      "text": "And to those among the nations of Carmel and Gilead, the upper Galilee, and the great plain of Esdraelon,",
      "links": "<a href='/AIV/07/1/27-28'>Judg. 1:27-28</a>",
      "comment": "This wide geographic sweep shows the reach of Nebuchadnezzar’s ambition, highlighting the world’s diversity but also its subjection to God’s sovereignty (Ps. 22:28)."
    },
    {
      "pk": 18001009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 9,
      "text": "and all who were in Samaria and its towns, and beyond the Jordan as far as Jerusalem and Bethany and Chelous and Kadesh and the river of Egypt, and Tahpanhes and Raamses and the whole land of Goshen,",
      "links": [
        "Gen 41:45",
        "Ex 1:11",
        "Jer 2:16"
      ],
      "comment": "This verse lists a wide swath of territories, signaling the vast reach of Nebuchadnezzar’s demands; these regions—Samaria, Jerusalem, Egypt—represent the historic rivals and neighbors of Israel, evoking memories of the Exodus (cf. Exodus 1:8-14) and setting the stage for a pan-regional crisis."
    },
    {
      "pk": 18001010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 10,
      "text": "even beyond Tanis and Memphis, and all who lived in Egypt as far as the borders of Ethiopia.",
      "links": [
        "Isa 19:11",
        "Ezek 30:13",
        "Acts 8:27"
      ],
      "comment": "The reference to Tanis, Memphis, and Ethiopia emphasizes the inclusive scope of Nebuchadnezzar's summons, suggesting a threat that extends beyond the usual biblical boundaries and echoing ancient Near Eastern imperial ambitions (cf. Isaiah 11:11)."
    },
    {
      "pk": 18001011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 11,
      "text": "But all who lived in the whole region disregarded the summons of Nebuchadnezzar, king of the Assyrians, and refused to join him in the war; for they were not afraid of him, but regarded him as only one man. So they sent back his messengers empty-handed and in disgrace.",
      "links": [
        "Ex 5:2",
        "2 Kgs 18:35",
        "Jdt 5:21"
      ],
      "comment": "The united refusal of these nations underlines their autonomy and collective resistance; their view of Nebuchadnezzar as 'only one man' reveals both political defiance and theological confidence reminiscent of Psalm 2:1-6, where kings resist foreign domination."
    },
    {
      "pk": 18001012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 12,
      "text": "Then Nebuchadnezzar became very angry with this whole region, and swore by his throne and kingdom that he would take revenge on the whole territory of Cilicia and Damascus and Syria, that he would kill with his sword also all the inhabitants of the land of Moab, and the people of Ammon, and all Judea, and every one in Egypt, as far as the coasts of the two seas.",
      "links": [
        "Isa 10:5-14",
        "Jer 25:15-26",
        "Dan 4:30"
      ],
      "comment": "Nebuchadnezzar’s oath to take revenge depicts the typical ancient Near Eastern royal rage at defiance (cf. Daniel 3:19), while the mention of specific peoples—including Judea and Egypt—foreshadows conflict and highlights the theme of threatened judgment upon the entire region.",
      "sectionHeader": "The Defeat of Arphaxad"
    },
    {
      "pk": 18001013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 13,
      "text": "In the seventeenth year he led his forces against King Arphaxad and defeated him in battle, overthrowing the whole army of Arphaxad and all his cavalry and all his chariots.",
      "links": "<a href='/AIV/35/2/8'>Hab. 2:8</a>",
      "comment": "The plundering of cities serves as a warning against placing trust in wealth or security outside of God, a theme revisited by Jesus when He teaches about storing treasures in heaven (Matt. 6:19-21)."
    },
    {
      "pk": 18001014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 14,
      "text": "Thus he took possession of his towns and came to Ecbatana, captured its towers, plundered its markets, and turned its glory into disgrace.",
      "links": "<a href='/AIV/09/17/51'>1 Sam. 17:51</a>",
      "comment": "The total defeat of Arphaxad sets the stage for the display of God’s ability to humble the proud (cf. 1 Sam. 2:7)."
    },
    {
      "pk": 18001015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 15,
      "text": "He captured Arphaxad in the mountains of Ragau and struck him down with his spears, thus destroying him once and for all.",
      "links": "<a href='/AIV/17/1/4'>Esth. 1:4</a>",
      "comment": "The celebration mirrors feasting seen in royal courts, yet is a fleeting joy, in contrast with the everlasting joy God offers to the faithful (Isa. 25:6)."
    },
    {
      "pk": 18001016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 16,
      "text": "Then he returned to Nineveh, he and all his combined forces, a vast body of troops; and there he and his forces rested and feasted for one hundred twenty days.",
      "links": [
        "Gen 10:11",
        "Tob 1:15",
        "Jon 3:3-4"
      ],
      "comment": "The great feast after 120 days signals a transition from preparation to action, recalling other royal banquets before significant events (cf. Esther 1:3-4), and showing Nebuchadnezzar’s assertion of power and readiness to execute his wrath.",
      "sectionHeader": "Nebuchadnezzar’s Vow of Vengeance"
    }
  ],
  "translatedAt": "2025-12-29T00:34:05.715Z",
  "sections": [
    {
      "title": "Arphaxad Fortifies Ecbatana",
      "startVerse": 1,
      "endVerse": 4
    },
    {
      "title": "Nebuchadnezzar Invades the West",
      "startVerse": 5,
      "endVerse": 11
    },
    {
      "title": "The Defeat of Arphaxad",
      "startVerse": 12,
      "endVerse": 15
    },
    {
      "title": "Nebuchadnezzar’s Vow of Vengeance",
      "startVerse": 16,
      "endVerse": 16
    }
  ]
}